schemer-notes.tex
% Created 2025-11-22 Sat 08:26
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\setlength{\parindent}{0pt}
\usepackage{hyperref}
\usepackage{ccicons}
\usepackage[
type={CC},
modifier={by-sa},
version={4.0},
]{doclicense}
\author{Deepak Venkatesh}
\date{\today}
\title{The Schemer Simplified}
\hypersetup{
 pdfauthor={Deepak Venkatesh},
 pdftitle={The Schemer Simplified},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.4 (Org mode 9.6.15)}, 
 pdflang={English}}
\begin{document}

\thispagestyle{empty}
\begin{center}
\vspace*{0.3\textheight}
\large {\emph{``Programs must be written for people to read, \newline and only incidentally for machines to execute.''}}
\footnote{\href{https://web.mit.edu/6.001/6.037/sicp.pdf} {Structure \& Interpretation of Computer Programs by Abelson, Sussman \& Sussman}}\\[1em]
\bigskip
\vfill
\end{center}
\clearpage




\clearpage\maketitle

\begin{abstract}
This is fundamentally a study guide from my personal notes initially created to deepen my understanding of Lisp and programming in general.
`The Little Schemer' (4th edition) by Daniel Friedman and Matthias Felleisen is a remarkable book
that teaches programming concepts in a unique and playful way. It builds from first principles using only
a small set of primitives, showing how powerful ideas — such as recursion, functional programming, lambda
functions, closures, higher order functions, and interpreters can be expressed using just those few building
blocks. I am sharing this since other beginners could benefit from these pages. As Richard Feynman had said `If you want to master
something, teach it.' In the future I hope to append a similar guide for the sequel `The Seasoned Schemer' to this book.

\bigskip

While the book uses Scheme, I initially worked it out using Common Lisp and had adapted the examples accordingly. Now
I am working through it using Racket, a modern descendent of Scheme. Despite its lighthearted tone, the book is far
from an easy read. It demands close attention and careful thought. My advice to anyone who wants to learn Lisp is to
first work through Professor David Touretzky's book titled `Common Lisp A Gentle Introduction to Symbolic Computing'
(2nd ed.). It's a great book for introduction to programming not just Lisp. Throughout this guide I have given additional clarification
and background about computer science concepts which are not present in the `The Little Schemer'.

\bigskip

I am really thankful to Alonzo Church, John McCarthy, Daniel Friedman, Matthias Felleisen, Gerald Sussman, Guy Steele, and the PLT research group for
giving to us this wonderful language and book. I stumbled upon Lisp very late in life via a blog by Steve Losh and ventured into the grand language of Common Lisp via David Touretzky, Peter Seibel,
Paul Graham, and Peter Norvig. As a non programmer whose daily job has never involved writing a line of production code I could not have spent hours on end without the support of my family.
My daughter knows the names of half a dozen programming languages by now and has tried her hand at some concepts. She prefers Python though.

\bigskip

Who is this book and guide for? At the end of The Seasoned Schemer the authors say `You have reached the end of your introduction to computation.' But I feel differently about it.
This book is not an introduction to programming and neither this guide is. Readers should either have some understanding of Lisp to work through this book or experience with programming. If a
reader does take this book on without any knowledge of programming and a bit of introduction to Lisp then they will find it difficult but not impossible to work through especially the chapters 8, 9, and 10 in the book.
Chapter 9 is the most difficult followed by chapter 8 and then chapter 10. Rest of the chapters are fairly easy to moderate. I would say chapter 9 is the most difficult in both the books. I will be adding more details and
illustrations at a future date to make this even more readable.

\bigskip

This guide is not intended for any commercial purpose and all rights of `The Little Schemer' and `The Seasoned Schemer' are with the respective authors and publishers. This is only a deep study
of these two wonderful books.

\bigskip

All mistakes in this guide, whether typographical or conceptual, are entirely my own. Any misinterpretations are as
well. I am still learning Lisp and programming. With every subsequent reading of this book I learn something new and peel another layer of Lisp.


\vspace{1em}

\emph{Hardware and Software used for this study}
\begin{itemize}
\item Language: Racket (a Scheme)
\item Editor: Dr Racket
\item emacs for Org notes
\item chatgpt for assistance on Git and Org mode
\item Macbook Pro 2019 2.6 Ghz I7 Intel chip with 16 GB RAM
\end{itemize}
\end{abstract}

\bigskip
\bigskip
\begin{flushright}
'(deepak venkatesh)\\[0pt]
'(redmond wa usa)
\end{flushright}



\newpage
\vfill
\doclicenseThis

\clearpage
\setcounter{tocdepth}{4}
\tableofcontents
\clearpage

\section{Foreword}
\label{sec:orge085cf0}

By Gerald Sussman of MIT, co-author of the book SICP (the wizard book).

\bigskip

Key Takeaway:
\emph{In order to be creative one must first gain control of the medium.}

\vspace{1em}

\begin{itemize}
\item Core skills are the first set of things required to master any pursuit.
\item Deep understanding is required to visualize beforehand the program which will be written.
\item Lisp provides freedom and flexibility (this is something which will only come in due course of time, as we keep
learning more about programming).
\item Lisp was initially conceived as a theoretical vehicle for recursion and symbolic algebra (this is the algebra we
have been taught at school such as \((a + b)^2 = a^2 + b^2 + 2ab\)).
\item In Lisp procedures are first class. Procedures are essentially a `variant' of functions. A mathematical function
maps a given input to an output (domain - range/co-domain) but a procedure is a process to arrive at the result via
computation.
\item First Class basically means that the procedure itself can be passed around as arguments to other procedures.
Procedures can be return values. They can also be stored in data structures. A similar corollary (though not exact)
are composite functions which are usually taught in pre-calculus.
\item Lisp programs can manipulate representations of Lisp programs - this likely refers to macros and how in Lisp, code
can be treated as data.
\end{itemize}

\bigskip

\clearpage
