schemer-notes.org
* Preface

Key Takeaway:
/The goal of the book is to teach the reader to think recursively./

#+LATEX: \bigskip

+ Programs take data, apply a process on that data, and then produce some data.
+ Recursion is the act of defining an object or solving a problem in terms of itself.
+ The authors believe that writing programs recursively in Lisp is essentially pattern recongnition. Well I think
  it's true for any programming language or any programming paradigm. It is the same in other pursuits too such as mathematics or physics.
+ For recursive programming and studying, this book we will need only a few primitives/functions, namely:
  + ~car~
  + ~cdr~
  + ~cons~
  + ~atom?~
  + ~eq?~
  + ~null?~
  + ~add1~, ~sub1~
  + ~and~, ~or~
  + ~else~
  + ~lambda~
  + ~cond~
  + ~define~
+ The definitions of the above primitives I am not outlining here and will come to it as we work through the book.
+ Authors advise to read this book slowly. Very slowly and delibrately. Re-read it multiple times. Every concept
  should be clear before going onto the next page. It is better to keep going back and working through a chapter again than to
  continue forward without a 100% clarity.
+ In the preface we hit the first difference between Scheme and Common Lisp. ~()~ in Scheme is actually different
  from that in Common Lisp. Scheme considers ~()~ as /only/ a list and /not/ an atom. While in Common Lisp ~()~ is
  considered both an atom and a list. ~ATOM~ is defined as per the Lisp Hyperspec as well as Common Lisp The
  Language (2nd ed.) by Guy Steele as `The predicate ~ATOM~ is true if its argument is not a ~CONS~, and otherwise
  is false. In SBCL, a Common Lisp implementation ~ATOM~ will give ~T~.

  #+begin_src common-lisp
    (atom '())
    » T
    
  #+end_src

  We define our own predicate ~atom?~ in Scheme. 

  #+begin_src scheme
    (define atom?
      (lambda (x)
	(and (not (pair? x)) (not (null? x)))))
    
  #+end_src

  Some tests for checking ~atom?~ in Scheme below:

  #+begin_src scheme
    > (atom? 'a)
    #t
    > (atom? (quote ()))
    #f
    > (atom? '(a b c))
    #f
    > (atom? 42)
    #t
        
  #+end_src
  

*Core Terms/Concepts Learnt*
+ In Scheme ~()~ is only a list and not an atom.


#+LATEX: \newpage
* The Five Rules

1. The Law of ~car~ : The primitive ~car~ is defined only for non-empty lists.

2. The Law of ~cdr~: The primitive ~cdr~ is defined only for non-empty lists. The ~cdr~ of any non-empty list is always another list.

3. The Law of ~cons~: The primitive ~cons~ takes two arguments. The second argument to ~cons~ must be a list. The result is a list.

4. The Law of ~null?~: The primitive ~null?~ is defined only for lists.

5. The Law of ~eq?~: The primitive ~eq?~ in takes two arguments. Each must be a non numeric atom.


#+LATEX: \newpage

* The Ten Commandments

The First Commandment
+ When recurring on a list of atoms, ~lat~, ask two questions about it: ~(null? lat)~ and ~else~. When recurring on a number, ~n~, ask two
  questions about it: ~(zero? n)~ and ~else~. When recurring on a list of S-expressions, ~l~ ask three questions about it: ~(null? l)~,
  ~(atom? (car l))~, and ~else~.

The Second Commandment
+ Use ~cons~ to build lists.

The Third Commandment
+ When building a list, describe the first typical element, and then ~cons~ it onto the natural recursion.

The Fourth Commandment
+ Always change at least one argument while recurring. When recurring on a list of atoms, ~lat~, use ~(cdr lat)~. When recurring on a number, ~n~, use ~(sub1 n)~.
  And when recurring on a list of S-expressions, ~l~, use ~(car l)~ and ~(cdr l)~ if neither ~(null? l)~ nor ~(atom? (car l))~ are true. It must be changed to be closer to
  termination. The changing argument must be tested in the termination condition: When using ~cdr~, test termination with ~null?~ and when using ~sub1~, test termination with ~zero?~.

The Fifth Commandment
+ When building a value with ~+~, always use 0 for the value of the terminating line, for adding ~0~ does not change the value of an addition.
  When building a value with ~x~, always use 1 for the value of the terminating line, for adding ~1~ does not change the value of a multiplication.
  When building a value with ~cons~, always consider ~()~ for the value of the terminating line.

The Sixth Commandment
+ Simplify only after the function is correct.

The Seventh Commandment
+ Recur on the /subparts/ that are of the same nature
  - On the sublists of a list.
  - On the sub-expression of an arithmetic expression.

The Eight Commandment
+ Use help functions to abstract from representations.

The Ninth Commandment
+ Abstract common patterns with a new function.

The Tenth Commandment
+ Build functions to collect more than one value at a time

#+LATEX: \newpage
* Toys

This chapter introduces the primitives of Scheme. These are the basic building blocks.

#+LATEX: \bigskip

** The Law of ~car~
Key Takeaway:
/The primitive ~car~ is defined only for non-empty lists. The ~car~ is the first atom (element) of that list./

#+LATEX: \vspace{1em}

+ An atom is indivisible - number, strings.
+ Anything enclosed in parenthesis/brackets ~()~ is a list.
+ We can have nested lists which are also called improper lists and non-nested lists which are proper lists.
+ An S-expression which stands for Symbolic Expression is any Lisp object that can be read and evaluated by the
  Lisp reader.
+ Q. How many S-expressions are in the list ~(how are you doing so far)~ and what are they? The book answers 6 and
  those are the elements in the lists, basically the 6 atoms inside the list. 
+ A question asks how many S-expressions are in the list ~(((how) are) ((you) (doing so)) far)~ and gives the
  answer as 3. It refers to the 3 lists inside the outermost list.
+ The difference of ~()~ again comes up since it is both a list and an atom in Common Lisp unlike Scheme. The ~car~
  of ~()~ will be ~NIL~ in Common Lisp unlike Scheme. In Common Lisp as per the standards and empty list's ~car~ and
  ~cdr~ are both ~NIL~ (shown below).
  #+begin_src common-lisp
    (car ())
    » NIL
    
  #+end_src
+ ~car~ is the first atom/element of a list. If we try to find the ~car~ of a string of character or numbers we will
  get an error like below.
  #+begin_src scheme
      > (car 'a)
    . . car: contract violation
      expected: pair?
      given: 'a
    > (car 42)
    . . car: contract violation
      expected: pair?
      given: 42
    
  #+end_src

