schemer-notes.tex
\section{Preface}
\label{sec:org64846b7}

Key Takeaway:
\emph{The goal of the book is to teach the reader to think recursively.}

\bigskip

\begin{itemize}
\item Programs take data, apply a process on that data, and then produce some data.
\item Recursion is the act of defining an object or solving a problem in terms of itself.
\item The authors believe that writing programs recursively in Lisp is essentially pattern recongnition. Well I think
it's true for any programming language or any programming paradigm. It is the same in other pursuits too such as mathematics or physics.
\item For recursive programming and studying, this book we will need only a few primitives/functions, namely:
\begin{itemize}
\item \texttt{car}
\item \texttt{cdr}
\item \texttt{cons}
\item \texttt{atom?}
\item \texttt{eq?}
\item \texttt{null?}
\item \texttt{add1}, \texttt{sub1}
\item \texttt{and}, \texttt{or}
\item \texttt{else}
\item \texttt{lambda}
\item \texttt{cond}
\item \texttt{define}
\end{itemize}
\item The definitions of the above primitives I am not outlining here and will come to it as we work through the book.
\item Authors advise to read this book slowly. Very slowly and delibrately. Re-read it multiple times. Every concept
should be clear before going onto the next page. It is better to keep going back and working through a chapter again than to
continue forward without a 100\% clarity.
\item In the preface we hit the first difference between Scheme and Common Lisp. \texttt{()} in Scheme is actually different
from that in Common Lisp. Scheme considers \texttt{()} as \emph{only} a list and \emph{not} an atom. While in Common Lisp \texttt{()} is
considered both an atom and a list. \texttt{ATOM} is defined as per the Lisp Hyperspec as well as Common Lisp The
Language (2nd ed.) by Guy Steele as `The predicate \texttt{ATOM} is true if its argument is not a \texttt{CONS}, and otherwise
is false. In SBCL, a Common Lisp implementation \texttt{ATOM} will give \texttt{T}.

\begin{verbatim}
(atom '())
» T

\end{verbatim}

We define our own predicate \texttt{atom?} in Scheme. 

\begin{verbatim}
(define atom?
  (lambda (x)
    (and (not (pair? x)) (not (null? x)))))

\end{verbatim}

Some tests for checking \texttt{atom?} in Scheme below:

\begin{verbatim}
> (atom? 'a)
#t
> (atom? (quote ()))
#f
> (atom? '(a b c))
#f
> (atom? 42)
#t

\end{verbatim}
\end{itemize}


\textbf{Core Terms/Concepts Learnt}
\begin{itemize}
\item In Scheme \texttt{()} is only a list and not an atom.
\end{itemize}


\newpage
\section{The Five Rules}
\label{sec:orgd79b28b}

\begin{enumerate}
\item The Law of \texttt{car} : The primitive \texttt{car} is defined only for non-empty lists.

\item The Law of \texttt{cdr}: The primitive \texttt{cdr} is defined only for non-empty lists. The \texttt{cdr} of any non-empty list is always another list.

\item The Law of \texttt{cons}: The primitive \texttt{cons} takes two arguments. The second argument to \texttt{cons} must be a list. The result is a list.

\item The Law of \texttt{null?}: The primitive \texttt{null?} is defined only for lists.

\item The Law of \texttt{eq?}: The primitive \texttt{eq?} in takes two arguments. Each must be a non numeric atom.
\end{enumerate}


\newpage

\section{The Ten Commandments}
\label{sec:org88bd4e6}

The First Commandment
\begin{itemize}
\item When recurring on a list of atoms, \texttt{lat}, ask two questions about it: \texttt{(null? lat)} and \texttt{else}. When recurring on a number, \texttt{n}, ask two
questions about it: \texttt{(zero? n)} and \texttt{else}. When recurring on a list of S-expressions, \texttt{l} ask three questions about it: \texttt{(null? l)},
\texttt{(atom? (car l))}, and \texttt{else}.
\end{itemize}

The Second Commandment
\begin{itemize}
\item Use \texttt{cons} to build lists.
\end{itemize}

The Third Commandment
\begin{itemize}
\item When building a list, describe the first typical element, and then \texttt{cons} it onto the natural recursion.
\end{itemize}

The Fourth Commandment
\begin{itemize}
\item Always change at least one argument while recurring. When recurring on a list of atoms, \texttt{lat}, use \texttt{(cdr lat)}. When recurring on a number, \texttt{n}, use \texttt{(sub1 n)}.
And when recurring on a list of S-expressions, \texttt{l}, use \texttt{(car l)} and \texttt{(cdr l)} if neither \texttt{(null? l)} nor \texttt{(atom? (car l))} are true. It must be changed to be closer to
termination. The changing argument must be tested in the termination condition: When using \texttt{cdr}, test termination with \texttt{null?} and when using \texttt{sub1}, test termination with \texttt{zero?}.
\end{itemize}

The Fifth Commandment
\begin{itemize}
\item When building a value with \texttt{+}, always use 0 for the value of the terminating line, for adding \texttt{0} does not change the value of an addition.
When building a value with \texttt{x}, always use 1 for the value of the terminating line, for adding \texttt{1} does not change the value of a multiplication.
When building a value with \texttt{cons}, always consider \texttt{()} for the value of the terminating line.
\end{itemize}

The Sixth Commandment
\begin{itemize}
\item Simplify only after the function is correct.
\end{itemize}

The Seventh Commandment
\begin{itemize}
\item Recur on the \emph{subparts} that are of the same nature
\begin{itemize}
\item On the sublists of a list.
\item On the sub-expression of an arithmetic expression.
\end{itemize}
\end{itemize}

The Eight Commandment
\begin{itemize}
\item Use help functions to abstract from representations.
\end{itemize}

The Ninth Commandment
\begin{itemize}
\item Abstract common patterns with a new function.
\end{itemize}

The Tenth Commandment
\begin{itemize}
\item Build functions to collect more than one value at a time
\end{itemize}

\newpage
\section{Toys}
\label{sec:org51e09fe}

This chapter introduces the primitives of Scheme. These are the basic building blocks.

\bigskip

\subsection{The Law of \texttt{car}}
\label{sec:org814ba1c}
Key Takeaway:
\emph{The primitive \texttt{car} is defined only for non-empty lists. The \texttt{car} is the first atom (element) of that list.}

\vspace{1em}

\begin{itemize}
\item An atom is indivisible - number, strings.
\item Anything enclosed in parenthesis/brackets \texttt{()} is a list.
\item We can have nested lists which are also called improper lists and non-nested lists which are proper lists.
\item An S-expression which stands for Symbolic Expression is any Lisp object that can be read and evaluated by the
Lisp reader.
\item Q. How many S-expressions are in the list \texttt{(how are you doing so far)} and what are they? The book answers 6 and
those are the elements in the lists, basically the 6 atoms inside the list.
\item A question asks how many S-expressions are in the list \texttt{(((how) are) ((you) (doing so)) far)} and gives the
answer as 3. It refers to the 3 lists inside the outermost list.
\item The difference of \texttt{()} again comes up since it is both a list and an atom in Common Lisp unlike Scheme. The \texttt{car}
of \texttt{()} will be \texttt{NIL} in Common Lisp unlike Scheme. In Common Lisp as per the standards and empty list's \texttt{car} and
\texttt{cdr} are both \texttt{NIL} (shown below).
\begin{verbatim}
(car ())
» NIL

\end{verbatim}
\item \texttt{car} is the first atom/element of a list. If we try to find the \texttt{car} of a string of character or numbers we will
get an error like below.
\begin{verbatim}
  > (car 'a)
. . car: contract violation
  expected: pair?
  given: 'a
> (car 42)
. . car: contract violation
  expected: pair?
  given: 42

\end{verbatim}
\end{itemize}
