schemer-notes.org
** The Law of ~cdr~
Key Takeaway:
/The primitive ~cdr~ is defined only for non-empty lists. The ~cdr~ of any non-empty list is always another list./

#+LATEX: \vspace{1em}

+ The book says ~car~ of /l/ is same as ~(car l)~. Similarly for ~cdr~.
+ ~cdr~ of a single atom/element list is ~()~.
+ In Prof Tourtezky's book there is a tool called SDRAW. It allows us to do draw ~cons~ cell structures with the ~car~ &
  ~cdr~ pointers. I have uploaded the code for this tool on Github [[https://github.com/PeepalCapital/sdraw][here]]. For ~(car a)~ and ~(cdr a)~ where ~a~ is
  ~samosa~ will be represented as below (doesn't render well in markdown file on github):

  ~[*|*]---> NIL~ $\newline$
  ~|~ $\newline$
  ~|~ $\newline$
  ~V~ $\newline$
  ~SAMOSA~

+ ~cdr~ of an empty list will be ~()~ as per Common Lisp standards but in Scheme it is an error.


** The Law of ~cons~
Key Takeaway:
/The primitive ~cons~ takes two arguments. The second argument to ~cons~ must be a list. The result is a list./

#+LATEX: \vspace{1em}

+ ~cons~ actually creates a ~cons~ cell. The ~car~ of which is the first input to ~cons~ and the ~cdr~ is pointed to
  the second input. The return value of the ~cons~ is a pointer to it. Refer Prof Touretzky's Chapter 2, clearly explained.
+ Q. What is ~(cons s l)~ where ~s~ is ~((a b c))~ and ~l~ is ~b~? This brings in the topic of Dotted Lists. In a
  proper list the chain of ~cons~ cells ends with ~()~ as the atom, meaning the last cell points to a ~NIL~ but in a
  dotted list the last atom points to a non ~NIL~ atom. In the above case we will get the following:
  #+begin_src scheme
    > (cons 'a '(b c))
    '(a b c)
    > (cons 'a 'b)
    '(a . b)
    
  #+end_src


** The Law of ~null?~
Key Takeaway:
/The primitive ~null?~ is defined only for lists./

#+LATEX: \vspace{1em}

+ Q. Is it true that the list ~l~ is the null list where ~l~ is ~()~? Yes, because it is  composed of
  zero S-expressions.
+ Another difference in Common Lisp and Scheme is how they refer to False. In scheme it is explicitly ~#t~ or ~#f~ but
  in Common Lisp it is ~T~ for True or else it is ~NIL~ which means False.
+ ~null?~ of an atom should throw an error for a string or a number but actually it gives ~#f~ since in Scheme ~null?~
  for ~()~ is ~#t~ and for everything else it is ~#f~. See code below.
  #+begin_src scheme
      > (null? 'a)
    #f
    > (null? (quote ()))
    #t
    
#+end_src

** The Law of ~eq?~
Key Takeaway:
/The primitive ~eq?~ in takes two arguments and compares them. Each must be a non numeric atom./

#+LATEX: \vspace{1em}

+ In ~eq?~ the address of the Lisp object is compared. For instance if we create two cons cells with same elements
  ~eq?~ will give ~#f~
  #+begin_src scheme
    > (eq? (cons 'a 'b) (cons 'a 'b))
    #f
    
#+end_src

*Core Terms/Concepts Learnt*
+ ~car~, ~cdr~, ~cons~, ~eq?~, ~null?~, ~quote~, ~#t~, ~#f~
+ Atoms, S-Expressions, Lists, Dotted Lists


#+LATEX: \newpage
* Do It, Do It Again, and Again, and Again ...

This chapter explains recursion. The best introductory material for recursion in my opinion is Chapter 8 in Prof Touretzky's book.

#+LATEX: \vspace{1em}

Key Takeaway:
/The First Commandment (preliminary): Always ask ~null?~ as the first question in expressing a function/

#+LATEX: \vspace{1em}

** Basics of Recursion

+ After reading Prof Touretzky's chapter on recursion this chapter will feel very easy. Also the first commandment is not
  really true always. Sometimes in recursion the first question is not necessarily ~null?~. Later in the book the
  authors do add in this nuance.
+ The chapter introduces a function named ~lat?~. It stands for a list of atoms. This means every element of the
  list is an atom. It can be written as below.
  #+begin_src scheme
    (define lat?
      (lambda (l)
	(cond
	  ((null? l) #t)
	  ((atom? (car l)) (lat? (cdr l)))
	  (else #f))))

  #+end_src

*** The important ~cond~

+ It is important to understand how ~cond~ functions. Well ~cond~ is actually a macro. This macro has a series of
  tests and results. The macro goes from top to bottom. The cases are processed from left to right under each test.
  Technically we can have more than one result per test for evaluation. As a Lisp `trick' the last test is
  usually an ~else~ which evaluates to ~#t~ always and hence the last result is returned. ~cond~ is a very nice way to
  implement ~If..then..Else~. I have never seen such seamless conditional in any language yet.
+ ~lat?~ basically is a ~cond~ which keeps checking through all the elements of a list to test for ~atom?~ till the
  list ends. It checks ~car~ one by one for each subsequent ~cdr~ for ~atom?~.
+ I would study Chapter 8 of Touretzky for getting the intuition on recursion right. The author has done a great job.

