schemer-notes.tex

\subsection{The Law of \texttt{cdr}}
\label{sec:orgbc2d30a}
Key Takeaway:
\emph{The primitive \texttt{cdr} is defined only for non-empty lists. The \texttt{cdr} of any non-empty list is always another list.}

\vspace{1em}

\begin{itemize}
\item The book says \texttt{car} of \emph{l} is same as \texttt{(car l)}. Similarly for \texttt{cdr}.
\item \texttt{cdr} of a single atom/element list is \texttt{()}.
\item In Prof Tourtezky's book there is a tool called SDRAW. It allows us to do draw \texttt{cons} cell structures with the \texttt{car} \&
\texttt{cdr} pointers. I have uploaded the code for this tool on Github \href{https://github.com/PeepalCapital/sdraw}{here}. For \texttt{(car a)} and \texttt{(cdr a)} where \texttt{a} is
\texttt{samosa} will be represented as below (doesn't render well in markdown file on github):

\texttt{[*|*]-{}-{}-> NIL} \(\newline\)
\texttt{|} \(\newline\)
\texttt{|} \(\newline\)
\texttt{V} \(\newline\)
\texttt{SAMOSA}

\item \texttt{cdr} of an empty list will be \texttt{()} as per Common Lisp standards but in Scheme it is an error.
\end{itemize}


\subsection{The Law of \texttt{cons}}
\label{sec:org00f9011}
Key Takeaway:
\emph{The primitive \texttt{cons} takes two arguments. The second argument to \texttt{cons} must be a list. The result is a list.}

\vspace{1em}

\begin{itemize}
\item \texttt{cons} actually creates a \texttt{cons} cell. The \texttt{car} of which is the first input to \texttt{cons} and the \texttt{cdr} is pointed to
the second input. The return value of the \texttt{cons} is a pointer to it. Refer Prof Touretzky's Chapter 2, clearly explained.
\item Q. What is \texttt{(cons s l)} where \texttt{s} is \texttt{((a b c))} and \texttt{l} is \texttt{b}? This brings in the topic of Dotted Lists. In a
proper list the chain of \texttt{cons} cells ends with \texttt{()} as the atom, meaning the last cell points to a \texttt{NIL} but in a
dotted list the last atom points to a non \texttt{NIL} atom. In the above case we will get the following:
\begin{verbatim}
> (cons 'a '(b c))
'(a b c)
> (cons 'a 'b)
'(a . b)

\end{verbatim}
\end{itemize}


\subsection{The Law of \texttt{null?}}
\label{sec:org42d74ea}
Key Takeaway:
\emph{The primitive \texttt{null?} is defined only for lists.}

\vspace{1em}

\begin{itemize}
\item Q. Is it true that the list \texttt{l} is the null list where \texttt{l} is \texttt{()}? Yes, because it is  composed of
zero S-expressions.
\item Another difference in Common Lisp and Scheme is how they refer to False. In scheme it is explicitly \texttt{\#t} or \texttt{\#f} but
in Common Lisp it is \texttt{T} for True or else it is \texttt{NIL} which means False.
\item \texttt{null?} of an atom should throw an error for a string or a number but actually it gives \texttt{\#f} since in Scheme \texttt{null?}
for \texttt{()} is \texttt{\#t} and for everything else it is \texttt{\#f}. See code below.
\begin{verbatim}
  > (null? 'a)
#f
> (null? (quote ()))
#t

\end{verbatim}
\end{itemize}

\subsection{The Law of \texttt{eq?}}
\label{sec:org98b649e}
Key Takeaway:
\emph{The primitive \texttt{eq?} in takes two arguments and compares them. Each must be a non numeric atom.}

\vspace{1em}

\begin{itemize}
\item In \texttt{eq?} the address of the Lisp object is compared. For instance if we create two cons cells with same elements
\texttt{eq?} will give \texttt{\#f}
\begin{verbatim}
> (eq? (cons 'a 'b) (cons 'a 'b))
#f

\end{verbatim}
\end{itemize}

\textbf{Core Terms/Concepts Learnt}
\begin{itemize}
\item \texttt{car}, \texttt{cdr}, \texttt{cons}, \texttt{eq?}, \texttt{null?}, \texttt{quote}, \texttt{\#t}, \texttt{\#f}
\item Atoms, S-Expressions, Lists, Dotted Lists
\end{itemize}


\newpage
\section{Do It, Do It Again, and Again, and Again \ldots{}}
\label{sec:org692baac}

This chapter explains recursion. The best introductory material for recursion in my opinion is Chapter 8 in Prof Touretzky's book.

\vspace{1em}

Key Takeaway:
\emph{The First Commandment (preliminary): Always ask \texttt{null?} as the first question in expressing a function}

\vspace{1em}

\subsection{Basics of Recursion}
\label{sec:org77a9085}

\begin{itemize}
\item After reading Prof Touretzky's chapter on recursion this chapter will feel very easy. Also the first commandment is not
really true always. Sometimes in recursion the first question is not necessarily \texttt{null?}. Later in the book the
authors do add in this nuance.
\item The chapter introduces a function named \texttt{lat?}. It stands for a list of atoms. This means every element of the
list is an atom. It can be written as below.
\begin{verbatim}
(define lat?
  (lambda (l)
    (cond
      ((null? l) #t)
      ((atom? (car l)) (lat? (cdr l)))
      (else #f))))

\end{verbatim}
\end{itemize}

\subsubsection{The important \texttt{cond}}
\label{sec:org80bf508}

\begin{itemize}
\item It is important to understand how \texttt{cond} functions. Well \texttt{cond} is actually a macro. This macro has a series of
tests and results. The macro goes from top to bottom. The cases are processed from left to right under each test.
Technically we can have more than one result per test for evaluation. As a Lisp `trick' the last test is
usually an \texttt{else} which evaluates to \texttt{\#t} always and hence the last result is returned. \texttt{cond} is a very nice way to
implement \texttt{If..then..Else}. I have never seen such seamless conditional in any language yet.
\item \texttt{lat?} basically is a \texttt{cond} which keeps checking through all the elements of a list to test for \texttt{atom?} till the
list ends. It checks \texttt{car} one by one for each subsequent \texttt{cdr} for \texttt{atom?}.
\item I would study Chapter 8 of Touretzky for getting the intuition on recursion right. The author has done a great job.
\end{itemize}
