schemer-notes.org
*** Trace tool in Dr Racket

+ Dr Racket comes with an inbuilt tool called ~trace~ in the library package called ~(racket/trace) which lets us see
  the actual function calls. So lets trace all the recursive examples in this chapter.
  #+begin_src scheme   
    > (lat? '(Jack Sprat could eat no chicken fat))
    >(lat? '(Jack Sprat could eat no chicken fat))
    >(lat? '(Sprat could eat no chicken fat))
    >(lat? '(could eat no chicken fat))
    >(lat? '(eat no chicken fat))
    >(lat? '(no chicken fat))
    >(lat? '(chicken fat))
    >(lat? '(fat))
    >(lat? '())
    <#t
    #t

  #+end_src
  
+ Another example which has a nested list.
  #+begin_src scheme
    > (lat? '(Jack (Sprat could) eat no chicken fat))
    >(lat? '(Jack (Sprat could) eat no chicken fat))
    >(lat? '((Sprat could) eat no chicken fat))
    <#f
    #f
    
  #+end_src
+ Few more examples from the chapter using ~trace~
  #+begin_src scheme
    > (lat? '(bacon and eggs))
    >(lat? '(bacon and eggs))
    >(lat? '(and eggs))
    >(lat? '(eggs))
    >(lat? '())
    <#t
    #t

  #+end_src

  #+begin_src scheme
    > (lat? '(bacon (and eggs)))
    >(lat? '(bacon (and eggs)))
    >(lat? '((and eggs)))
    <#f
    #f

  #+end_src
+ ~or~ is introduced as a logical operator. ~or~ asks two questions, one at a time. If the first one is true it stops
  answers true. Otherwise it asks the second question and answers with whatever the second question answers.
+ ~member?~ is a function which returns a ~#t~ if the input is one of the elements in a list else ~#f~. The book
  defines this function using ~or~ whereas it is actually not necessary.
  #+begin_src scheme
	(define member?
	  (lambda (a lat)
	    (cond
	      ((null? lat) #f)
	      (else (or (eq? (car lat) a)
			 (member? a (cdr lat)))))))

    (define my-member?
      (lambda (a lat)
	(cond
	  ((null? lat) #f)
	  ((eq? (car lat) a) #t)
	  (else (member? a (cdr lat))))))
    
  #+end_src
+ The application of ~member?~ to find out whether /meat/ is in the list /(mashed potatoes and meat gravy)/ would
  generate this recursive call.
  #+begin_src scheme
    > (member? 'meat '(mashed potatoes and meat gravy))
    >(member? 'meat '(mashed potatoes and meat gravy))
    >(member? 'meat '(potatoes and meat gravy))
    >(member? 'meat '(and meat gravy))
    >(member? 'meat '(meat gravy))
    <#t
    #t

  #+end_src
+ Another example.
  #+begin_src scheme
    > (member? 'liver '(bagels and lox))
    >(member? 'liver '(bagels and lox))
    >(member? 'liver '(and lox))
    >(member? 'liver '(lox))
    >(member? 'liver '())
    <#f
    #f

  #+end_src

*Core Terms/Concepts Learnt*
+ ~or~
+ Basic template of recursion. Chapter 8 of Prof Touretzky is great for a deeper dive into ways to construct recursion. Also
  tail optimized recursion is to be studied from the book `Sketchy Scheme' by Nils M Holm.

#+LATEX: \newpage

* Cons the Magnificent

This chapter explains the methods to build lists using ~cons~ recursively.

#+LATEX: \vspace{1em}

Key Takeaway: /The Second Commandment: Use ~cons~ to build lists/

#+LATEX: \bigskip

/The Third Commandment: When building a list, describe the first typical element, and then ~cons~ it onto the natural recursion/

#+LATEX: \bigskip

/The Fourth Commandement: Always change at lest one argument while recurring. It must be changed to be closer to termination.
The changing argument must be tested in the termination condition: when using ~cdr~, test termination with ~null?~./

#+LATEX: \vspace{1em}

** List Surgery

*** Removing elements

+ In last chapter we made a ~member?~ function and in this chapter we will be making a function which will /remove/
  a member.
+ The first attempt to build the ~rember~ function fails since it removes all the initial elements before finding the
  one it wants to remove. The authors have nicely demonstrated why ~cons~ is required to define this function.
+ The way to write ~rember~ is as below. Also note as per Scheme semantics there is no ~?~ at the end
  of ~rember~ because it is actually not a predicate.
  #+begin_src scheme
    (define rember
      (lambda (a lat)
	(cond
	  ((null? lat) (quote ()))
	  ((eq? (car lat) a) (cdr lat))
	  (else (cons (car lat)
		      (rember a (cdr lat)))))))

  #+end_src
+ There is a way to contrast the incorrect ~rember~ with the correct ~cons~ ~rember~ by looking at the recursive
  trace calls. The incorrect ~rember-wrong~ is below with its trace and return.
  #+begin_src scheme
    (define rember-wrong
      (lambda (a lat)
	(cond
	  ((null? lat) #f)
	  ((eq? (car lat) a) #t)
	  (else (rember-wrong a (cdr lat))))))

    > (rember-wrong 'and '(bacon lettuce and tomato))
    >(rember-wrong 'and '(bacon lettuce and tomato))
    >(rember-wrong 'and '(lettuce and tomato))
    >(rember-wrong 'and '(and tomato))
    <'(tomato)
    '(tomato)

  #+end_src
  Whereas the correct trace and output is as below:
  #+begin_src scheme
    > (rember 'and '(bacon lettuce and tomato))
    >(rember 'and '(bacon lettuce and tomato))
    > (rember 'and '(lettuce and tomato))
    > >(rember 'and '(and tomato))
    < <'(tomato)
    < '(lettuce tomato)
    <'(bacon lettuce tomato)
    '(bacon lettuce tomato)

  #+end_src
  Another example.
  #+begin_src scheme
    > (rember 'sauce '(soy sauce and tomato sauce))
    >(rember 'sauce '(soy sauce and tomato sauce))
    > (rember 'sauce '(sauce and tomato sauce))
    < '(and tomato sauce)
    <'(soy and tomato sauce)
    '(soy and tomato sauce)

  #+end_src

*** Finding elements

+ Next function is ~firsts~ to build a list of the first S-expressions in nested lists. The code and trace is:
  #+begin_src scheme
	(define firsts
	  (lambda (l)
	    (cond
	      ((null? l) (quote ()))
	      (else (cons (car (car l))
			  (firsts (cdr l)))))))

    >(firsts
      '((apple peach pumpkin)
	(plum pear cherry)
	(grape raisin pea)
	(bean carrot eggplant)))
    > (firsts '((plum pear cherry) (grape raisin pea) (bean carrot eggplant)))
    > >(firsts '((grape raisin pea) (bean carrot eggplant)))
    > > (firsts '((bean carrot eggplant)))
    > > >(firsts '())
    < < <'()
    < < '(bean)
    < <'(grape bean)
    < '(plum grape bean)
    <'(apple plum grape bean)
    '(apple plum grape bean)
    
  #+end_src
+ The book refers to ~seconds~ but doesn't provide code for it. But I will try it out anyways.
  #+begin_src scheme
	(define seconds
	  (lambda (l)
	    (cond ((null? l) (quote ()))
		  (else (cons (car (cdr (car l)))
			      (seconds (cdr l)))))))

    >(seconds '((a b) (c d) (e f)))
    > (seconds '((c d) (e f)))
    > >(seconds '((e f)))
    > > (seconds '())
    < < '()
    < <'(f)
    < '(d f)
    <'(b d f)
    '(b d f)
    
  #+end_src
+ In the recursion technique of ~cons~-ing cells the last ~cons~ cells' ~cdr~ pointer will point to a ~nil~ or an
  empty list ~()~. Therefore, the usual terminal or base condition is to check for ~null?~ then ~cons~ a ~()~.
+ Although the book alludes to the fact that the ~cons~-ing can be in any direction the trace in Dr Racket actually
  shows the  ~cons~-ing with a ~<~ or a ~>~. So a ~()~ gets ~cons~-ed with the last recurring item and goes back to the
  first item. In the above example ~()~ is ~cons~-ed to ~f~ to make a list ~(f)~. This ~(f)~ is then ~cons~-ed to ~d~
  to make the list ~(d f)~. This ~(d f)~ is then ~cons~-ed to ~b~ to finally get ~(b d f)~.

