schemer-notes.tex

\subsubsection{Trace tool in Dr Racket}
\label{sec:org3163f57}

\begin{itemize}
\item Dr Racket comes with an inbuilt tool called \texttt{trace} in the library package called \textasciitilde{}(racket/trace) which lets us see
the actual function calls. So lets trace all the recursive examples in this chapter.
\begin{verbatim}
> (lat? '(Jack Sprat could eat no chicken fat))
>(lat? '(Jack Sprat could eat no chicken fat))
>(lat? '(Sprat could eat no chicken fat))
>(lat? '(could eat no chicken fat))
>(lat? '(eat no chicken fat))
>(lat? '(no chicken fat))
>(lat? '(chicken fat))
>(lat? '(fat))
>(lat? '())
<#t
#t

\end{verbatim}

\item Another example which has a nested list.
\begin{verbatim}
> (lat? '(Jack (Sprat could) eat no chicken fat))
>(lat? '(Jack (Sprat could) eat no chicken fat))
>(lat? '((Sprat could) eat no chicken fat))
<#f
#f

\end{verbatim}
\item Few more examples from the chapter using \texttt{trace}
\begin{verbatim}
> (lat? '(bacon and eggs))
>(lat? '(bacon and eggs))
>(lat? '(and eggs))
>(lat? '(eggs))
>(lat? '())
<#t
#t

\end{verbatim}

\begin{verbatim}
> (lat? '(bacon (and eggs)))
>(lat? '(bacon (and eggs)))
>(lat? '((and eggs)))
<#f
#f

\end{verbatim}
\item \texttt{or} is introduced as a logical operator. \texttt{or} asks two questions, one at a time. If the first one is true it stops
answers true. Otherwise it asks the second question and answers with whatever the second question answers.
\item \texttt{member?} is a function which returns a \texttt{\#t} if the input is one of the elements in a list else \texttt{\#f}. The book
defines this function using \texttt{or} whereas it is actually not necessary.
\begin{verbatim}
    (define member?
      (lambda (a lat)
        (cond
          ((null? lat) #f)
          (else (or (eq? (car lat) a)
                     (member? a (cdr lat)))))))

(define my-member?
  (lambda (a lat)
    (cond
      ((null? lat) #f)
      ((eq? (car lat) a) #t)
      (else (member? a (cdr lat))))))

\end{verbatim}
\item The application of \texttt{member?} to find out whether \emph{meat} is in the list \emph{(mashed potatoes and meat gravy)} would
generate this recursive call.
\begin{verbatim}
> (member? 'meat '(mashed potatoes and meat gravy))
>(member? 'meat '(mashed potatoes and meat gravy))
>(member? 'meat '(potatoes and meat gravy))
>(member? 'meat '(and meat gravy))
>(member? 'meat '(meat gravy))
<#t
#t

\end{verbatim}
\item Another example.
\begin{verbatim}
> (member? 'liver '(bagels and lox))
>(member? 'liver '(bagels and lox))
>(member? 'liver '(and lox))
>(member? 'liver '(lox))
>(member? 'liver '())
<#f
#f

\end{verbatim}
\end{itemize}

\textbf{Core Terms/Concepts Learnt}
\begin{itemize}
\item \texttt{or}
\item Basic template of recursion. Chapter 8 of Prof Touretzky is great for a deeper dive into ways to construct recursion. Also
tail optimized recursion is to be studied from the book `Sketchy Scheme' by Nils M Holm.
\end{itemize}

\newpage

\section{Cons the Magnificent}
\label{sec:orgd223d1e}

This chapter explains the methods to build lists using \texttt{cons} recursively.

\vspace{1em}

Key Takeaway: \emph{The Second Commandment: Use \texttt{cons} to build lists}

\bigskip

\emph{The Third Commandment: When building a list, describe the first typical element, and then \texttt{cons} it onto the natural recursion}

\bigskip

\emph{The Fourth Commandement: Always change at lest one argument while recurring. It must be changed to be closer to termination.
The changing argument must be tested in the termination condition: when using \texttt{cdr}, test termination with \texttt{null?}.}

\vspace{1em}

\subsection{List Surgery}
\label{sec:org263a92c}

\subsubsection{Removing elements}
\label{sec:orgbd4b659}

\begin{itemize}
\item In last chapter we made a \texttt{member?} function and in this chapter we will be making a function which will \emph{remove}
a member.
\item The first attempt to build the \texttt{rember} function fails since it removes all the initial elements before finding the
one it wants to remove. The authors have nicely demonstrated why \texttt{cons} is required to define this function.
\item The way to write \texttt{rember} is as below. Also note as per Scheme semantics there is no \texttt{?} at the end
of \texttt{rember} because it is actually not a predicate.
\begin{verbatim}
(define rember
  (lambda (a lat)
    (cond
      ((null? lat) (quote ()))
      ((eq? (car lat) a) (cdr lat))
      (else (cons (car lat)
                  (rember a (cdr lat)))))))

\end{verbatim}
\item There is a way to contrast the incorrect \texttt{rember} with the correct \texttt{cons} \texttt{rember} by looking at the recursive
trace calls. The incorrect \texttt{rember-wrong} is below with its trace and return.
\begin{verbatim}
(define rember-wrong
  (lambda (a lat)
    (cond
      ((null? lat) #f)
      ((eq? (car lat) a) #t)
      (else (rember-wrong a (cdr lat))))))

> (rember-wrong 'and '(bacon lettuce and tomato))
>(rember-wrong 'and '(bacon lettuce and tomato))
>(rember-wrong 'and '(lettuce and tomato))
>(rember-wrong 'and '(and tomato))
<'(tomato)
'(tomato)

\end{verbatim}
Whereas the correct trace and output is as below:
\begin{verbatim}
> (rember 'and '(bacon lettuce and tomato))
>(rember 'and '(bacon lettuce and tomato))
> (rember 'and '(lettuce and tomato))
> >(rember 'and '(and tomato))
< <'(tomato)
< '(lettuce tomato)
<'(bacon lettuce tomato)
'(bacon lettuce tomato)

\end{verbatim}
Another example.
\begin{verbatim}
> (rember 'sauce '(soy sauce and tomato sauce))
>(rember 'sauce '(soy sauce and tomato sauce))
> (rember 'sauce '(sauce and tomato sauce))
< '(and tomato sauce)
<'(soy and tomato sauce)
'(soy and tomato sauce)

\end{verbatim}
\end{itemize}

\subsubsection{Finding elements}
\label{sec:org2bf279a}

\begin{itemize}
\item Next function is \texttt{firsts} to build a list of the first S-expressions in nested lists. The code and trace is:
\begin{verbatim}
    (define firsts
      (lambda (l)
        (cond
          ((null? l) (quote ()))
          (else (cons (car (car l))
                      (firsts (cdr l)))))))

>(firsts
  '((apple peach pumpkin)
    (plum pear cherry)
    (grape raisin pea)
    (bean carrot eggplant)))
> (firsts '((plum pear cherry) (grape raisin pea) (bean carrot eggplant)))
> >(firsts '((grape raisin pea) (bean carrot eggplant)))
> > (firsts '((bean carrot eggplant)))
> > >(firsts '())
< < <'()
< < '(bean)
< <'(grape bean)
< '(plum grape bean)
<'(apple plum grape bean)
'(apple plum grape bean)

\end{verbatim}
\item The book refers to \texttt{seconds} but doesn't provide code for it. But I will try it out anyways.
\begin{verbatim}
    (define seconds
      (lambda (l)
        (cond ((null? l) (quote ()))
              (else (cons (car (cdr (car l)))
                          (seconds (cdr l)))))))

>(seconds '((a b) (c d) (e f)))
> (seconds '((c d) (e f)))
> >(seconds '((e f)))
> > (seconds '())
< < '()
< <'(f)
< '(d f)
<'(b d f)
'(b d f)

\end{verbatim}
\item In the recursion technique of \texttt{cons}-ing cells the last \texttt{cons} cells' \texttt{cdr} pointer will point to a \texttt{nil} or an
empty list \texttt{()}. Therefore, the usual terminal or base condition is to check for \texttt{null?} then \texttt{cons} a \texttt{()}.
\item Although the book alludes to the fact that the \texttt{cons}-ing can be in any direction the trace in Dr Racket actually
shows the  \texttt{cons}-ing with a \texttt{<} or a \texttt{>}. So a \texttt{()} gets \texttt{cons}-ed with the last recurring item and goes back to the
first item. In the above example \texttt{()} is \texttt{cons}-ed to \texttt{f} to make a list \texttt{(f)}. This \texttt{(f)} is then \texttt{cons}-ed to \texttt{d}
to make the list \texttt{(d f)}. This \texttt{(d f)} is then \texttt{cons}-ed to \texttt{b} to finally get \texttt{(b d f)}.
\end{itemize}
