schemer-notes.org
*** Inserting and substituting elements

+ Without looking into the questions was able to build these ~cons~-es for ~insertR~, ~insertL~, and ~subst~.
  #+begin_src scheme
    (define insertR
      (lambda (new old lat)
	(cond ((null? lat) (quote ()))
	      ((eq? old (car lat)) (cons (car lat) (cons new (cdr lat))))
	      (else (cons (car lat) (insertR new old (cdr lat)))))))

    (define insertL
      (lambda (new old lat)
	(cond ((null? lat) (quote ()))
	      ((eq? old (car lat)) (cons new (cons (car lat) (cdr lat))))
	      (else (cons (car lat) (insertL new old (cdr lat)))))))

    (define subst
      (lambda (new old lat)
	(cond ((null? lat) (quote ()))
	      ((eq? old (car lat)) (cons new (cdr lat)))
	      (else (cons (car lat) (subst new old (cdr lat)))))))

  #+end_src
+ ~subst2~ is another function defined in the book, it substitutes either the first occurrence of one thing or another.
  #+begin_src scheme
    (define subst2
      (lambda (new o1 o2 lat)
	(cond ((null? lat) (quote ()))
	      ((or (eq? (car lat) o1) (eq? (car lat) o2)) (cons new (cdr lat)))
	      (else (cons (car lat) (subst2 new o1 o2 (cdr lat)))))))

  #+end_src
+ ~subst2~ involves an ~or~ but a better example could be used such as below. Since trace will give a better view.
  #+begin_src scheme
	(define subst2
	  (lambda (new o1 o2 lat)
	    (cond ((null? lat) (quote ()))
		  ((or (eq? (car lat) o1) (eq? (car lat) o2)) (cons new (cdr lat)))
		  (else (cons (car lat) (subst2 new o1 o2 (cdr lat)))))))

    > (subst2 'vanilla 'chocolate 'banana
	      '(caramel raspberry ice cream with
			chocolate topping with some bananas))
    >(subst2
      'vanilla
      'chocolate
      'banana
      '(caramel raspberry ice cream with chocolate topping with some bananas))
    > (subst2
       'vanilla
       'chocolate
       'banana
       '(raspberry ice cream with chocolate topping with some bananas))
    > >(subst2
	'vanilla
	'chocolate
	'banana
	'(ice cream with chocolate topping with some bananas))
    > > (subst2
	 'vanilla
	 'chocolate
	 'banana
	 '(cream with chocolate topping with some bananas))
    > > >(subst2
	  'vanilla
	  'chocolate
	  'banana
	  '(with chocolate topping with some bananas))
    > > > (subst2
	   'vanilla
	   'chocolate
	   'banana
	   '(chocolate topping with some bananas))
    < < < '(vanilla topping with some bananas)
    < < <'(with vanilla topping with some bananas)
    < < '(cream with vanilla topping with some bananas)
    < <'(ice cream with vanilla topping with some bananas)
    < '(raspberry ice cream with vanilla topping with some bananas)
    <'(caramel raspberry ice cream with vanilla topping with some bananas)
    '(caramel raspberry ice cream with vanilla topping with some bananas)

  #+end_src
+ ~multirember~ is below. I am unsure why two ~else~ is used by the author. Probably I will learn it down the line. But the
  ~trace~ captures the series of recursive steps beautifully. Note the ~>~ and ~<~ they capture the stack trace nicely.
  #+begin_src scheme
	(define multirember
	  (lambda (a lat)
	    (cond ((null? lat) (quote ()))
		  ((eq? (car lat) a) (multirember a (cdr lat)))
		  (else (cons (car lat) (multirember a (cdr lat)))))))

    > (multirember 'cup '(coffee cup tea cup and hick cup))
    >(multirember 'cup '(coffee cup tea cup and hick cup))
    > (multirember 'cup '(cup tea cup and hick cup))
    > (multirember 'cup '(tea cup and hick cup))
    > >(multirember 'cup '(cup and hick cup))
    > >(multirember 'cup '(and hick cup))
    > > (multirember 'cup '(hick cup))
    > > >(multirember 'cup '(cup))
    > > >(multirember 'cup '())
    < < <'()
    < < '(hick)
    < <'(and hick)
    < '(tea and hick)
    <'(coffee tea and hick)
    '(coffee tea and hick)
    
  #+end_src

*** Multiple surgeries on lists

+ Function definition for other `multi' variants below: ~multiinsertR~, ~multiinsertL~, and ~multisubst~.
  #+begin_src scheme
	(define multiinsertR
	  (lambda (new old lat)
	    (cond ((null? lat) (quote ()))
		  ((eq? old (car lat))
		   (cons (car lat)(cons new (multiinsertR new old (cdr lat)))))
		  (else (cons (car lat) (multiinsertR new old (cdr lat)))))))

    > (multiinsertR 'bag 'cup '(coffee cup tea cup and hick cup))
    >(multiinsertR 'bag 'cup '(coffee cup tea cup and hick cup))
    > (multiinsertR 'bag 'cup '(cup tea cup and hick cup))
    > >(multiinsertR 'bag 'cup '(tea cup and hick cup))
    > > (multiinsertR 'bag 'cup '(cup and hick cup))
    > > >(multiinsertR 'bag 'cup '(and hick cup))
    > > > (multiinsertR 'bag 'cup '(hick cup))
    > > > >(multiinsertR 'bag 'cup '(cup))
    > > > > (multiinsertR 'bag 'cup '())
    < < < < '()
    < < < <'(cup bag)
    < < < '(hick cup bag)
    < < <'(and hick cup bag)
    < < '(cup bag and hick cup bag)
    < <'(tea cup bag and hick cup bag)
    < '(cup bag tea cup bag and hick cup bag)
    <'(coffee cup bag tea cup bag and hick cup bag)
    '(coffee cup bag tea cup bag and hick cup bag)

  #+end_src

  #+begin_src scheme
	(define multiinsertL
	  (lambda (new old lat)
	    (cond ((null? lat) (quote ()))
		  ((eq? old (car lat))
		   (cons new (cons (car lat) (multiinsertL new old (cdr lat)))))
		  (else (cons (car lat) (multiinsertL new old (cdr lat)))))))

	> (multiinsertL 'bag 'cup '(coffee cup tea cup and hick cup))
    >(multiinsertL 'bag 'cup '(coffee cup tea cup and hick cup))
    > (multiinsertL 'bag 'cup '(cup tea cup and hick cup))
    > >(multiinsertL 'bag 'cup '(tea cup and hick cup))
    > > (multiinsertL 'bag 'cup '(cup and hick cup))
    > > >(multiinsertL 'bag 'cup '(and hick cup))
    > > > (multiinsertL 'bag 'cup '(hick cup))
    > > > >(multiinsertL 'bag 'cup '(cup))
    > > > > (multiinsertL 'bag 'cup '())
    < < < < '()
    < < < <'(bag cup)
    < < < '(hick bag cup)
    < < <'(and hick bag cup)
    < < '(bag cup and hick bag cup)
    < <'(tea bag cup and hick bag cup)
    < '(bag cup tea bag cup and hick bag cup)
    <'(coffee bag cup tea bag cup and hick bag cup)
    '(coffee bag cup tea bag cup and hick bag cup)

  #+end_src

  #+begin_src scheme
	(define multisubst
	  (lambda (new old lat)
	    (cond ((null? lat) (quote ()))
		  ((eq? (car lat) old) (cons new (multisubst new old (cdr lat))))
		  (else (cons (car lat) (multisubst new old (cdr lat)))))))

    > (multisubst 'bag 'cup '(coffee cup tea cup and hick cup))
    >(multisubst 'bag 'cup '(coffee cup tea cup and hick cup))
    > (multisubst 'bag 'cup '(cup tea cup and hick cup))
    > >(multisubst 'bag 'cup '(tea cup and hick cup))
    > > (multisubst 'bag 'cup '(cup and hick cup))
    > > >(multisubst 'bag 'cup '(and hick cup))
    > > > (multisubst 'bag 'cup '(hick cup))
    > > > >(multisubst 'bag 'cup '(cup))
    > > > > (multisubst 'bag 'cup '())
    < < < < '()
    < < < <'(bag)
    < < < '(hick bag)
    < < <'(and hick bag)
    < < '(bag and hick bag)
    < <'(tea bag and hick bag)
    < '(bag tea bag and hick bag)
    <'(coffee bag tea bag and hick bag)
    '(coffee bag tea bag and hick bag)
    
  #+end_src
  
*Core Terms/Concepts Learnt*
+ Method to generate lists by using ~cons~ in recursions.

#+LATEX: \newpage

