schemer-notes.org
* Numbers Games

This chapter explains how numbers can be built with recursion.

#+LATEX: \vspace{1em}

Key Takeaway:

/The First Commandment (first revision): When recurring on a list of atoms, ~lat~, asks two questions about it: ~(null? lat)~ and ~else~. When recurring on a number, ~n~, ask two questions about it: ~(zero? n)~ and ~else~./

#+LATEX: \bigskip

/The Fourth Commandment (first revision): Always change one argument while recurring. It must be changed closer to termination. The changing argument must be tested in the termination condition: when using ~cdr~ test termination with null? and when using ~sub1~, test termination with ~zero?~./

#+LATEX: \bigskip

/The Fifth Commandment: When building a value with ~+~, always use 0 for the value of the terminating line, for adding 0 does not change the value of an addition. When building a value with ~x~, always use 1 for the value of the terminating line, for multiplying by 1 does not change the value of a multiplication. When building a value with ~cons~, always consider ~()~ for the value of the terminating line./

#+LATEX: \vspace{1em}

** Addition and Subtraction

+ In this chapter we are focusing on only the elements in the set of whole numbers.
+ We define the basic primitive functions to add 1 or subtract 1. Using this increment or decrement my assumption is we will create the Whole
  number set.
  #+begin_src scheme
    (define add1
      (lambda (n)
	(+ n 1)))

    (define sub1
      (lambda (n)
	(- n 1)))

  #+end_src
  If we do ~(sub1 0)~ we will actually get ~-1~ but for the sake of the book we will deal only with non-negative integers.
+ ~zero?~ is an inbuilt predicate just like ~ZEROP~ in Common Lisp.
+ We define addition of two numbers by making a decrementing counter of one of the numbers till it reaches zero. For every decrement we ~add1~
  to the other number. So for instance we need to add 3 to 2 then the 3 goes to 2 then 1 then 0. So there are three steps 3 to 2, 2 to 1 and 1
  to 0. So these three steps gets added to 2. Thus we get 5. Better to look at the stack trace for the example below. We are using the letter ~o~
  to denote that its our `own' definition.
  #+begin_src scheme
    (define o+
      (lambda (n m)
	(cond ((zero? m) n)
	      (else (add1 (o+ n (sub1 m)))))))
    
  #+end_src
  
    #+begin_src scheme
      > (o+ 2 3)
      >(o+ 2 3)
      > (o+ 2 2)
      > >(o+ 2 1)
      > > (o+ 2 0)
      < < 2
      < <3
      < 4
      <5
      5

  #+end_src

+ In the earlier chapter the authors had referred to using ~(null?)~ as the first test and now they correctly say that for numbers we can
  use ~zero?~ as the test.
+ ~zero?~ is like ~null?~ and ~add1~ is like ~cons~.
+ Exactly like ~o+~ we can build ~o-~ . The only difference is that we do not ~add1~ on every decrement but rather subtract using ~sub1~. Looking
  at the stack trace below.
  #+begin_src scheme
    (define o-
      (lambda (n m)
	(cond ((zero? m) n)
	      (else (sub1 (o- n (sub1 m)))))))
    
    > (o- 5 3)
    >(o- 5 3)
    > (o- 5 2)
    > >(o- 5 1)
    > > (o- 5 0)
    < < 5
    < <4
    < 3
    <2
    2

  #+end_src

** Tuples
  
+ Tuple is defined as a list of numbers. In this case I am assuming non negative numbers and also the book say an empty list will be also a
  tuple. I don't think tuple is defined formally in the R^{5}RS standard.
+ ~()~ is also a tuple as it is a list of zero numbers.
+ ~addtup~ is essentially a function which does digit-sum (sums the numbers in the tuple).
+ We will use ~o+~ to build numbers just like ~cons~ is used to build lists.
+ Writing ~addtup~ seems easy given the exercises prior to this and reading Pof Touretzky. Side comment: This book is actually really fun!
  #+begin_src scheme
	(define addtup
	  (lambda (tup)
	    (cond ((null? tup) 0)
		  (else (o+ (car tup) (addtup (cdr tup)))))))
    
    > (addtup '(1 2 3 4 5 6 7 8 9 10))
    >(addtup '(1 2 3 4 5 6 7 8 9 10))
    > (addtup '(2 3 4 5 6 7 8 9 10))
    > >(addtup '(3 4 5 6 7 8 9 10))
    > > (addtup '(4 5 6 7 8 9 10))
    > > >(addtup '(5 6 7 8 9 10))
    > > > (addtup '(6 7 8 9 10))
    > > > >(addtup '(7 8 9 10))
    > > > > (addtup '(8 9 10))
    > > > > >(addtup '(9 10))
    > > > > > (addtup '(10))
    > > > >[10] (addtup '())
    < < < <[10] 0
    < < < < < 10
    < < < < <19
    < < < < 27
    < < < <34
    < < < 40
    < < <45
    < < 49
    < <52
    < 54
    <55
    55

  #+end_src

** Multiplication  
  
+ Multiplication is repetitive addition. So to build ~x~ we have to decrement one number and for every decrement add the other number to itself.
  #+begin_src scheme
	(define x
	  (lambda (n m)
	    (cond ((zero? m) 0)
		  (else (o+ n (x n (sub1 m)))))))

    > (x 4 3)
    >(x 4 3)
    > (x 4 2)
    > >(x 4 1)
    > > (x 4 0)
    < < 0
    < <4
    < 8
    <12
    12
    
  #+end_src
  
+ A nice expansion in the book is for ~(x 12 3)~ fairly similar to the ~trace~ Dr Racket generates.
  #+begin_src scheme
    (x 12 3)
    = 12 + (x 12 2)
    = 12 + 12 + (x 12 1)
    = 12 + 12 + 12 + (x 12 0)
    = 12 + 12 + 12 + 0
    = 12 + 24
    = 36
    
  #+end_src

