schemer-notes.tex

\section{Numbers Games}
\label{sec:org2dfc475}

This chapter explains how numbers can be built with recursion.

\vspace{1em}

Key Takeaway:

\emph{The First Commandment (first revision): When recurring on a list of atoms, \texttt{lat}, asks two questions about it: \texttt{(null? lat)} and \texttt{else}. When recurring on a number, \texttt{n}, ask two questions about it: \texttt{(zero? n)} and \texttt{else}.}

\bigskip

\emph{The Fourth Commandment (first revision): Always change one argument while recurring. It must be changed closer to termination. The changing argument must be tested in the termination condition: when using \texttt{cdr} test termination with null? and when using \texttt{sub1}, test termination with \texttt{zero?}.}

\bigskip

\emph{The Fifth Commandment: When building a value with \texttt{+}, always use 0 for the value of the terminating line, for adding 0 does not change the value of an addition. When building a value with \texttt{x}, always use 1 for the value of the terminating line, for multiplying by 1 does not change the value of a multiplication. When building a value with \texttt{cons}, always consider \texttt{()} for the value of the terminating line.}

\vspace{1em}

\subsection{Addition and Subtraction}
\label{sec:org66f9abd}

\begin{itemize}
\item In this chapter we are focusing on only the elements in the set of whole numbers.
\item We define the basic primitive functions to add 1 or subtract 1. Using this increment or decrement my assumption is we will create the Whole
number set.
\begin{verbatim}
(define add1
  (lambda (n)
    (+ n 1)))

(define sub1
  (lambda (n)
    (- n 1)))

\end{verbatim}
If we do \texttt{(sub1 0)} we will actually get \texttt{-1} but for the sake of the book we will deal only with non-negative integers.
\item \texttt{zero?} is an inbuilt predicate just like \texttt{ZEROP} in Common Lisp.
\item We define addition of two numbers by making a decrementing counter of one of the numbers till it reaches zero. For every decrement we \texttt{add1}
to the other number. So for instance we need to add 3 to 2 then the 3 goes to 2 then 1 then 0. So there are three steps 3 to 2, 2 to 1 and 1
to 0. So these three steps gets added to 2. Thus we get 5. Better to look at the stack trace for the example below. We are using the letter \texttt{o}
to denote that its our `own' definition.
\begin{verbatim}
(define o+
  (lambda (n m)
    (cond ((zero? m) n)
          (else (add1 (o+ n (sub1 m)))))))

\end{verbatim}

\begin{verbatim}
> (o+ 2 3)
>(o+ 2 3)
> (o+ 2 2)
> >(o+ 2 1)
> > (o+ 2 0)
< < 2
< <3
< 4
<5
5

\end{verbatim}

\item In the earlier chapter the authors had referred to using \texttt{(null?)} as the first test and now they correctly say that for numbers we can
use \texttt{zero?} as the test.
\item \texttt{zero?} is like \texttt{null?} and \texttt{add1} is like \texttt{cons}.
\item Exactly like \texttt{o+} we can build \texttt{o-} . The only difference is that we do not \texttt{add1} on every decrement but rather subtract using \texttt{sub1}. Looking
at the stack trace below.
\begin{verbatim}
(define o-
  (lambda (n m)
    (cond ((zero? m) n)
          (else (sub1 (o- n (sub1 m)))))))

> (o- 5 3)
>(o- 5 3)
> (o- 5 2)
> >(o- 5 1)
> > (o- 5 0)
< < 5
< <4
< 3
<2
2

\end{verbatim}
\end{itemize}

\subsection{Tuples}
\label{sec:org7cc3c18}

\begin{itemize}
\item Tuple is defined as a list of numbers. In this case I am assuming non negative numbers and also the book say an empty list will be also a
tuple. I don't think tuple is defined formally in the R\textsuperscript{5}RS standard.
\item \texttt{()} is also a tuple as it is a list of zero numbers.
\item \texttt{addtup} is essentially a function which does digit-sum (sums the numbers in the tuple).
\item We will use \texttt{o+} to build numbers just like \texttt{cons} is used to build lists.
\item Writing \texttt{addtup} seems easy given the exercises prior to this and reading Pof Touretzky. Side comment: This book is actually really fun!
\begin{verbatim}
    (define addtup
      (lambda (tup)
        (cond ((null? tup) 0)
              (else (o+ (car tup) (addtup (cdr tup)))))))

> (addtup '(1 2 3 4 5 6 7 8 9 10))
>(addtup '(1 2 3 4 5 6 7 8 9 10))
> (addtup '(2 3 4 5 6 7 8 9 10))
> >(addtup '(3 4 5 6 7 8 9 10))
> > (addtup '(4 5 6 7 8 9 10))
> > >(addtup '(5 6 7 8 9 10))
> > > (addtup '(6 7 8 9 10))
> > > >(addtup '(7 8 9 10))
> > > > (addtup '(8 9 10))
> > > > >(addtup '(9 10))
> > > > > (addtup '(10))
> > > >[10] (addtup '())
< < < <[10] 0
< < < < < 10
< < < < <19
< < < < 27
< < < <34
< < < 40
< < <45
< < 49
< <52
< 54
<55
55

\end{verbatim}
\end{itemize}

\subsection{Multiplication}
\label{sec:orge4a5c58}

\begin{itemize}
\item Multiplication is repetitive addition. So to build \texttt{x} we have to decrement one number and for every decrement add the other number to itself.
\begin{verbatim}
    (define x
      (lambda (n m)
        (cond ((zero? m) 0)
              (else (o+ n (x n (sub1 m)))))))

> (x 4 3)
>(x 4 3)
> (x 4 2)
> >(x 4 1)
> > (x 4 0)
< < 0
< <4
< 8
<12
12

\end{verbatim}

\item A nice expansion in the book is for \texttt{(x 12 3)} fairly similar to the \texttt{trace} Dr Racket generates.
\begin{verbatim}
(x 12 3)
= 12 + (x 12 2)
= 12 + 12 + (x 12 1)
= 12 + 12 + 12 + (x 12 0)
= 12 + 12 + 12 + 0
= 12 + 24
= 36

\end{verbatim}
\end{itemize}
