schemer-notes.org
*** Digression to Abstract Algebra  
  
+ A question is asked why is 0 the value for the terminal condition line in ~x~ and the answer to this is because 0 will not affect ~+~. That
  is ~n + 0 = n~. The actual math behind lies in abstract algebra. In an operation such as ~+~ there is a concept of identity and inverse. The
  ~identity~ or ~neutral~ element in the set of this operation does not affect the value of other elements when the operation is applied between
  an element and this identity. For example, in the operation of ~+~ the ~identity~ element is ~0~. The operation ~+~ say is applied to the set
  of non-negative numbers (as done in this book). So ~+~ 2 and the ~identity~ should yield 2 itself. Thus the identity in this set of whole
  numbers for this specific ~+~ operation is 0. Similarly for the operation of ~x~ in the set of natural numbers the identity is 1. 2 multiplied
  by 1 yields 2 again. Now we get back to scheme and away from abstract algebra.
  
+ The next function we write is addition of two tuples. In this all elements in the tuple at their respective positions are added. The first version
  of the code adds two tuples of the same length (code is below). When we supply it with varying length tuples we get an error because it tries to
  add a number to an empty list. The trace diagram shows the error. Now we will write a cleaner function which will take varying length tuples.
  #+begin_src scheme
    ; this v1 version will work only if length of tup1 and tup2 is same
	(define tup+v1       
	  (lambda (tup1 tup2)
	    (cond ((and (null? tup1) (null? tup2)) (quote ()))
		  (else (cons (o+ (car tup1) (car tup2))
			      (tup+v1 (cdr tup1) (cdr tup2)))))))

    > (tup+v1 '(1 2 3 4) '(4 3 2 1))
    >(tup+v1 '(1 2 3 4) '(4 3 2 1))
    > (tup+v1 '(2 3 4) '(3 2 1))
    > >(tup+v1 '(3 4) '(2 1))
    > > (tup+v1 '(4) '(1))
    > > >(tup+v1 '() '())
    < < <'()
    < < '(5)
    < <'(5 5)
    < '(5 5 5)
    <'(5 5 5 5)
    '(5 5 5 5)

    > (tup+v1 '(1 2 3 4) '(4 3 2))
    >(tup+v1 '(1 2 3 4) '(4 3 2))
    > (tup+v1 '(2 3 4) '(3 2))
    > >(tup+v1 '(3 4) '(2))
    > > (tup+v1 '(4) '())
    . . car: contract violation
      expected: pair?
      given: '()

  #+end_src
  
+ ~tup+~ below is the correct way to define addition of the elements of two tuples. The trace diagram helps understand why. When one of the tuples
  runs out of elements i.e. it is an empty tuple, then at that time whatever the present recurring state of the other tuple is that is used for
  ~cons~-ing when the stack frames start returning values.
  #+begin_src scheme
	(define tup+
	  (lambda (tup1 tup2)
	    (cond ((null? tup1) tup2)
		  ((null? tup2) tup1)
		  (else (cons (o+ (car tup1) (car tup2))
			      (tup+ (cdr tup1) (cdr tup2)))))))

    > (tup+ '(1 2 3 4) '(4 3 2 1))
    >(tup+ '(1 2 3 4) '(4 3 2 1))
    > (tup+ '(2 3 4) '(3 2 1))
    > >(tup+ '(3 4) '(2 1))
    > > (tup+ '(4) '(1))
    > > >(tup+ '() '())
    < < <'()
    < < '(5)
    < <'(5 5)
    < '(5 5 5)
    <'(5 5 5 5)
    '(5 5 5 5)

    > (tup+ '(1 2 3 ) '(4 3 2 1))
    >(tup+ '(1 2 3) '(4 3 2 1))
    > (tup+ '(2 3) '(3 2 1))
    > >(tup+ '(3) '(2 1))
    > > (tup+ '() '(1))
    < < '(1)
    < <'(5 1)
    < '(5 5 1)
    <'(5 5 5 1)
    '(5 5 5 1)

    > (tup+ '(1 2 3 4) '(4 3 2))
    >(tup+ '(1 2 3 4) '(4 3 2))
    > (tup+ '(2 3 4) '(3 2))
    > >(tup+ '(3 4) '(2))
    > > (tup+ '(4) '())
    < < '(4)
    < <'(5 4)
    < '(5 5 4)
    <'(5 5 5 4)
    '(5 5 5 4)

  #+end_src

** Comparison operators

+ Definitions of greater than and smaller than ~>~ and ~<~ is tricky. For greater than ~>~ the order of tests  matter. The ~#f~ needs to
  be tested first for the base condition. This is so because when ~n~ reaches zero we know for sure that ~n~ is ~<= m~ thus the overall test
  is ~#f~. But if we had tested ~m~ as zero which would return ~#t~ even if the condition ~=~ is satisfied. Similarly we can compose a function
  for lesser than ~<~.
  #+begin_src scheme
	(define >
	  (lambda (n m)
	    (cond ((zero? n) #f)
		  ((zero? m) #t)
		  (else (> (sub1 n) (sub1 m))))))
    > (> 3 1)
    >(> 3 1)
    >(> 2 0)
    <#t
    #t

    > (> 1 4)
    >(> 1 4)
    >(> 0 3)
    <#f
    #f
    
    > (> 4 4)
    >(> 4 4)
    >(> 3 3)
    >(> 2 2)
    >(> 1 1)
    >(> 0 0)
    <#f
    #f

  #+end_src

  #+begin_src scheme
	(define <
	  (lambda (n m)
	    (cond ((zero? m) #f)
		  ((zero? n) #t)
		  (else (< (sub1 n) (sub1 m))))))

    > (< 1 4)
    >(< 1 4)
    >(< 0 3)
    <#t
    #t
    > (< 4 1)
    >(< 4 1)
    >(< 3 0)
    <#f
    #f
    > (< 4 4)
    >(< 4 4)
    >(< 3 3)
    >(< 2 2)
    >(< 1 1)
    >(< 0 0)
    <#f
    #f
    
  #+end_src

** Equality  
  
+ Next we compose the equality function ~=~ for numbers. The plain vanilla method is to check if one is zero and whether at the same time the
  other is zero too. If not then it is false. Also if one reaches zero while decrementing and the other is still not zero then it is not equal.
  The code is simple below. The other way which build up on ~>~ and ~<~ is to check if these two are false then ~=~ will be true.
  #+begin_src scheme
    (define o=
      (lambda (n m)
	(cond ((zero? m) (zero? n))
	      ((zero? n) #f)
	      (else (= (sub1 n) (sub1 m))))))

    (define =
      (lambda (n m)
	(cond ((> n m) #f)
	      ((< n m) #f)
	      (else #t))))

  #+end_src
  
+ Exponents (or raising to power) is also simple.
  #+begin_src scheme
	(define o^
	  (lambda (n m)
	    (cond ((zero? m) 1)
		  (else (x n (o^ n (sub1 m)))))))

    > (o-exp 2 4)
    >(o-exp 2 4)
    > (o-exp 2 3)
    > >(o-exp 2 2)
    > > (o-exp 2 1)
    > > >(o-exp 2 0)
    < < <1
    < < 2
    < <4
    < 8
    <16
    16
        
  #+end_src

** Division

+ Integer division is implemented smartly by basically figuring out the how many wholes of a number fits into another. Thus discarding any of the
  remainder. Wonder how remainder can be obtained via recursion especially for recurring decimals or if I throw an irrational number.
  #+begin_src scheme
	(define o-div
	  (lambda (n m)
	    (cond ((< n m) 0)
		  (else (add1 (o-div (o- n m) m))))))
    > (o-div 16 3)
    >(o-div 16 3)
    > (o-div 13 3)
    > >(o-div 10 3)
    > > (o-div 7 3)
    > > >(o-div 4 3)
    > > > (o-div 1 3)
    < < < 0
    < < <1
    < < 2
    < <3
    < 4
    <5
    5
    
  #+end_src

+ In Common Lisp ~LENGTH~ is provided in the common user package as a function but here in Scheme we have to build it ourselves. Its quite easy.
  #+begin_src scheme
	(define length
	  (lambda (lat)
	    (cond ((null? lat) 0)
		  (else (add1 (length (cdr lat)))))))

    > (length '(gulab jamun ladoo jalebi))
    >(length '(gulab jamun ladoo jalebi))
    > (length '(jamun ladoo jalebi))
    > >(length '(ladoo jalebi))
    > > (length '(jalebi))
    > > >(length '())
    < < <0
    < < 1
    < <2
    < 3
    <4
    4
    
  #+end_src

