schemer-notes.org
** Indexing
  
+ Indexing a list or like in Python we refer to elements of a list starting with 0. In this example the book starts indexing with 1. Here I show
  both indexes one starting with 0 and the other as in the book starting with 1.
  #+begin_src scheme
    (define pick-zero
      (lambda (n lat)
	(cond ((zero? n) (car lat))
	      (else (pick-zero (sub1 n) (cdr lat))))))

    (define pick
      (lambda (n lat)
	(cond ((zero? (sub1 n)) (car lat))
	      (else (pick (sub1 n) (cdr lat))))))
    
	> (pick-zero 2 '(paneer butter masala curry))
	>(pick-zero 2 '(paneer butter masala curry))
	>(pick-zero 1 '(butter masala curry))
	>(pick-zero 0 '(masala curry))
	<'masala
	'masala
    
	> (pick 2 '(paneer butter masala curry))
	>(pick 2 '(paneer butter masala curry))
	>(pick 1 '(butter masala curry))
	<'butter
	'butter
  #+end_src
  
+ Removing an element in the list is consing like we did before.
  #+begin_src scheme
    (define rempick
      (lambda (n lat)
	(cond
	  ((zero? (sub1 n)) (cdr lat))
	  (else (cons (car lat)
		      (rempick (sub1 n) (cdr lat)))))))

  #+end_src
  
+ ~number?~ is a primitive in Scheme just like ~NUMERBP~ in Common Lisp.
  #+begin_src scheme
    > (number? 5)
    #t
    > (number? 'dosa)
    #f
    
  #+end_src
  
+ Removing all numbers from a given list is a combination of using ~number?~ and a ~cons~ recursion. Unsure why the authors use two ~else~'s. It makes
  the function long and a tad bit complicated.
  #+begin_src scheme
    (define no-nums
      (lambda (lat)
	(cond
	  ((null? lat) (quote ()))
	  ((number? (car lat)) (no-nums (cdr lat)))
	  (else (cons (car lat) (no-nums (cdr lat)))))))

    (define no-nums-else
      (lambda (lat)
	(cond
	  ((null? lat) (quote ()))
	  (else (cond
		  ((number? (car lat))
		   (no-nums-else (cdr lat)))
		  (else (cons (car lat)
			      (no-nums-else (cdr lat)))))))))

  #+end_src
  
+ The next function is inverse of the former ~no-nums~. In this ~all-nums~ we keep only the numbers and do away with everything else. This is also simple.
  #+begin_src scheme
    (define all-nums
      (lambda (lat)
	(cond
	  ((null? lat) (quote ()))
	  ((number? (car lat)) (cons
				(car lat) (all-nums (cdr lat))))
	  (else (all-nums (cdr lat))))))

  #+end_src

** Equality tests in Scheme
  
+ In Prof Touretzky's book on Common Lisp there is a very nice explanation of equality tests such as ~EQUAL~, ~=~, ~EQ~ etc. Similarly in Scheme there are differences
  in the way equality tests are done. The table below captures the notes on this topic.

 | Predicate  | Meaning                                                    | Works On              |
 |------------+------------------------------------------------------------+-----------------------|
 | ~eq?~      | Object identity - Are these the same objects?              | symbols, booleans     |
 | ~eqv?~     | Value identity (atomic) - Do these denote the same values? | numbers, chars        | 
 | ~equal?~   | Structural equality - Are these structurally the same?     | lists, strings, etc.  |
 | ~=~        | Numeric equality - Are these numbers same?                 | numbers               | 

 #+LATEX: \bigskip

 | Predicate   | Example                       |
 |-------------+-------------------------------|
 | ~eq?~       | (eq? 'a 'a) → #t              |
 | ~eqv?~      | (eqv? 3 3) → #t               | 
 | ~equal?~    | (equal? '(a b) '(a b)) → #t   |
 | ~=~         | (= 3 3.0) → #t                | 

 My assumption is that the /object/ refers to the Lisp object therefore it is that specific location in memory which is being compared. Essentially are these two
 things in the same memory location? I will need to confirm this. Rest of the equality predicates are straightforward. Test to check the Lisp Object hypothesis:
 #+begin_src scheme
   > (eq? '(a b) '(a b))
   #f
   > (equal? '(a b) '(a b))
   #t

 #+end_src
 
+ Next we write a function to check if the atoms are same. Here we use ~=~ for comparing numbers, and rightly so.
  #+begin_src scheme
    (define eqan?
      (lambda (a1 a2)
	(cond
	  ((and (number? a1) (number? a2))
	   (= a1 a2))
	  ((or (number? a1) (number? a2)) #f)
	  (else (eq? a1 a2)))))

  #+end_src

+ Not sure of the answer to the question "Can we assume that all functions written using ~eq?~ can be generalized by replacing ~eq?~ by ~eqan?~". The answer
  given is "Yes" except for ~equan?~ itself. Is it because we can't write ~equan?~ without ~eq?~. Not sure if I understood this correctly.

+ ~occur~ is defined which basically counts the frequency of occurrence in a list.
  #+begin_src scheme
    (define occur
      (lambda (a lat)
	(cond
	  ((null? lat) 0)
	  ((eq? a (car lat)) (add1 (occur a (cdr lat))))
	  (else (occur a (cdr lat))))))

  #+end_src

+ The chapter suddenly jumps to defining ~one?~ predicate which essentially checks if a number is ~1~ or not. We do it in multiple ways but we learn that ~cond~
  is not necessary to construct this predicate.
  #+begin_src scheme
    (define one-zero?
      (lambda (n)
	(cond
	  ((zero? n) #f)
	  (else (zero? (sub1 n))))))

    (define one-equal?
      (lambda (n)
	(cond
	  (else (= n 1)))))

    (define one?
      (lambda (n)
	(= n 1)))

  #+end_src

+ The last function of the chapter is ~rempick~ using ~one?~. This is just a small change to our original ~rempick~ function.
  #+begin_src scheme
    (define rempick-one
      (lambda (n lat)
	(cond
	  ((one? n) (cdr lat))
	  (else (cons (car lat)
		      (rempick-one (sub1 n) (cdr lat)))))))

  #+end_src

*Core Terms/Concepts Learnt*
+ Building numbers by adding or subtracting 1
+ Building primitive arithmetic operations of ~+~, ~-~, ~x~ and ~/~ (integer)
+ Operations on tuples
+ Different  ways to do equality testing and counting frequency of occurrence
  

#+LATEX: \newpage

* * Oh My Gawd *: It's Full of Stars

This chapter we start looking at nested lists.

#+LATEX: \vspace{1em}

Key Takeaway:

/The First Commandment (final version): When recurring on a list of atoms, ~lat~ ask two questions about it ~(null? lat)~ and ~else~./
/When recurring on a number, ~n~ ask two questions about it: ~(zero? n)~ and ~else~./
/When recurring on a list of S-expressions, ~l~, ask three questions about it: ~(null? l)~, ~(atom? (car l))~, and ~else~./

#+LATEX: \bigskip

/The Fourth Commandment (final version): Always change at least one argument while recurring. When recurring on a list of atoms, ~lat~, use ~(cdr lat)~. When recurring on a number, ~n~, use ~(sub1 n)~. And when recurring on a list of S-expressions, ~l~, use ~(car l)~ and ~(cdr l)~ if/
/neither ~(null? l)~ nor ~(atom? (car l))~ are true. It must be changed to be closer to termination. The changing argument must be tested in the/
/termination condition: When using ~cdr~, test termination with ~null?~ and when using ~sub1~, test termination with ~zero?~./

#+LATEX: \bigskip

/The Sixth Commandment: Simplify only after the function is correct./

#+LATEX: \vspace{1em}

** Surgery on nested lists

