schemer-notes.tex

\subsection{Indexing}
\label{sec:org81e6a6e}

\begin{itemize}
\item Indexing a list or like in Python we refer to elements of a list starting with 0. In this example the book starts indexing with 1. Here I show
both indexes one starting with 0 and the other as in the book starting with 1.
\begin{verbatim}
(define pick-zero
  (lambda (n lat)
    (cond ((zero? n) (car lat))
          (else (pick-zero (sub1 n) (cdr lat))))))

(define pick
  (lambda (n lat)
    (cond ((zero? (sub1 n)) (car lat))
          (else (pick (sub1 n) (cdr lat))))))

    > (pick-zero 2 '(paneer butter masala curry))
    >(pick-zero 2 '(paneer butter masala curry))
    >(pick-zero 1 '(butter masala curry))
    >(pick-zero 0 '(masala curry))
    <'masala
    'masala

    > (pick 2 '(paneer butter masala curry))
    >(pick 2 '(paneer butter masala curry))
    >(pick 1 '(butter masala curry))
    <'butter
    'butter
\end{verbatim}

\item Removing an element in the list is consing like we did before.
\begin{verbatim}
(define rempick
  (lambda (n lat)
    (cond
      ((zero? (sub1 n)) (cdr lat))
      (else (cons (car lat)
                  (rempick (sub1 n) (cdr lat)))))))

\end{verbatim}

\item \texttt{number?} is a primitive in Scheme just like \texttt{NUMERBP} in Common Lisp.
\begin{verbatim}
> (number? 5)
#t
> (number? 'dosa)
#f

\end{verbatim}

\item Removing all numbers from a given list is a combination of using \texttt{number?} and a \texttt{cons} recursion. Unsure why the authors use two \texttt{else}'s. It makes
the function long and a tad bit complicated.
\begin{verbatim}
(define no-nums
  (lambda (lat)
    (cond
      ((null? lat) (quote ()))
      ((number? (car lat)) (no-nums (cdr lat)))
      (else (cons (car lat) (no-nums (cdr lat)))))))

(define no-nums-else
  (lambda (lat)
    (cond
      ((null? lat) (quote ()))
      (else (cond
              ((number? (car lat))
               (no-nums-else (cdr lat)))
              (else (cons (car lat)
                          (no-nums-else (cdr lat)))))))))

\end{verbatim}

\item The next function is inverse of the former \texttt{no-nums}. In this \texttt{all-nums} we keep only the numbers and do away with everything else. This is also simple.
\begin{verbatim}
(define all-nums
  (lambda (lat)
    (cond
      ((null? lat) (quote ()))
      ((number? (car lat)) (cons
                            (car lat) (all-nums (cdr lat))))
      (else (all-nums (cdr lat))))))

\end{verbatim}
\end{itemize}

\subsection{Equality tests in Scheme}
\label{sec:orgd5ffa8b}

\begin{itemize}
\item In Prof Touretzky's book on Common Lisp there is a very nice explanation of equality tests such as \texttt{EQUAL}, \texttt{=}, \texttt{EQ} etc. Similarly in Scheme there are differences
in the way equality tests are done. The table below captures the notes on this topic.

\begin{center}
\begin{tabular}{lll}
Predicate & Meaning & Works On\\[0pt]
\hline
\texttt{eq?} & Object identity - Are these the same objects? & symbols, booleans\\[0pt]
\texttt{eqv?} & Value identity (atomic) - Do these denote the same values? & numbers, chars\\[0pt]
\texttt{equal?} & Structural equality - Are these structurally the same? & lists, strings, etc.\\[0pt]
\texttt{=} & Numeric equality - Are these numbers same? & numbers\\[0pt]
\end{tabular}
\end{center}

\bigskip

\begin{center}
\begin{tabular}{ll}
Predicate & Example\\[0pt]
\hline
\texttt{eq?} & (eq? 'a 'a) → \#t\\[0pt]
\texttt{eqv?} & (eqv? 3 3) → \#t\\[0pt]
\texttt{equal?} & (equal? '(a b) '(a b)) → \#t\\[0pt]
\texttt{=} & (= 3 3.0) → \#t\\[0pt]
\end{tabular}
\end{center}

My assumption is that the \emph{object} refers to the Lisp object therefore it is that specific location in memory which is being compared. Essentially are these two
things in the same memory location? I will need to confirm this. Rest of the equality predicates are straightforward. Test to check the Lisp Object hypothesis:
\begin{verbatim}
> (eq? '(a b) '(a b))
#f
> (equal? '(a b) '(a b))
#t

\end{verbatim}

\item Next we write a function to check if the atoms are same. Here we use \texttt{=} for comparing numbers, and rightly so.
\begin{verbatim}
(define eqan?
  (lambda (a1 a2)
    (cond
      ((and (number? a1) (number? a2))
       (= a1 a2))
      ((or (number? a1) (number? a2)) #f)
      (else (eq? a1 a2)))))

\end{verbatim}

\item Not sure of the answer to the question "Can we assume that all functions written using \texttt{eq?} can be generalized by replacing \texttt{eq?} by \texttt{eqan?}". The answer
given is "Yes" except for \texttt{equan?} itself. Is it because we can't write \texttt{equan?} without \texttt{eq?}. Not sure if I understood this correctly.

\item \texttt{occur} is defined which basically counts the frequency of occurrence in a list.
\begin{verbatim}
(define occur
  (lambda (a lat)
    (cond
      ((null? lat) 0)
      ((eq? a (car lat)) (add1 (occur a (cdr lat))))
      (else (occur a (cdr lat))))))

\end{verbatim}

\item The chapter suddenly jumps to defining \texttt{one?} predicate which essentially checks if a number is \texttt{1} or not. We do it in multiple ways but we learn that \texttt{cond}
is not necessary to construct this predicate.
\begin{verbatim}
(define one-zero?
  (lambda (n)
    (cond
      ((zero? n) #f)
      (else (zero? (sub1 n))))))

(define one-equal?
  (lambda (n)
    (cond
      (else (= n 1)))))

(define one?
  (lambda (n)
    (= n 1)))

\end{verbatim}

\item The last function of the chapter is \texttt{rempick} using \texttt{one?}. This is just a small change to our original \texttt{rempick} function.
\begin{verbatim}
(define rempick-one
  (lambda (n lat)
    (cond
      ((one? n) (cdr lat))
      (else (cons (car lat)
                  (rempick-one (sub1 n) (cdr lat)))))))

\end{verbatim}
\end{itemize}

\textbf{Core Terms/Concepts Learnt}
\begin{itemize}
\item Building numbers by adding or subtracting 1
\item Building primitive arithmetic operations of \texttt{+}, \texttt{-}, \texttt{x} and \texttt{/} (integer)
\item Operations on tuples
\item Different  ways to do equality testing and counting frequency of occurrence
\end{itemize}


\newpage

\section{* Oh My Gawd *: It's Full of Stars}
\label{sec:org9f0243a}

This chapter we start looking at nested lists.

\vspace{1em}

Key Takeaway:

\emph{The First Commandment (final version): When recurring on a list of atoms, \texttt{lat} ask two questions about it \texttt{(null? lat)} and \texttt{else}.}
\emph{When recurring on a number, \texttt{n} ask two questions about it: \texttt{(zero? n)} and \texttt{else}.}
\emph{When recurring on a list of S-expressions, \texttt{l}, ask three questions about it: \texttt{(null? l)}, \texttt{(atom? (car l))}, and \texttt{else}.}

\bigskip

\emph{The Fourth Commandment (final version): Always change at least one argument while recurring. When recurring on a list of atoms, \texttt{lat}, use \texttt{(cdr lat)}. When recurring on a number, \texttt{n}, use \texttt{(sub1 n)}. And when recurring on a list of S-expressions, \texttt{l}, use \texttt{(car l)} and \texttt{(cdr l)} if}
\emph{neither \texttt{(null? l)} nor \texttt{(atom? (car l))} are true. It must be changed to be closer to termination. The changing argument must be tested in the}
\emph{termination condition: When using \texttt{cdr}, test termination with \texttt{null?} and when using \texttt{sub1}, test termination with \texttt{zero?}.}

\bigskip

\emph{The Sixth Commandment: Simplify only after the function is correct.}

\vspace{1em}

\subsection{Surgery on nested lists}
\label{sec:org586359c}
