schemer-notes.org
*** Removing a member

+ Removing a member in a nested list. In earlier chapters we only focused on proper non-nested lists but in this we will look at lists within lists. There could
  be any level of nesting theoretically speaking.
+ Any function name with a ~*~ at the end basically means application on the entire list. We write ~rember*~ which removes a specific element from even nested lists.
  The logic is to simply check if the element in the list is an atom and equal to the removable element, if it is then we just do a recursive ~rember*~ on the ~cdr~ of the list. If it is not equal
  then we ~cons~ that to the recursive call of the ~cdr~ of the list. In the case where the element is a list itself we keep calling the list recursively that is the ~car~ and applying the ~rember*~.
  It is fairly logical. The ~trace~ on the stack actually shows the entire process nicely.
  #+begin_src scheme
	(define rember*
	  (lambda (a l)
	    (cond ((null? l) (quote ()))
		  ((atom? (car l))
		   (cond ((eq? a (car l)) (rember* a (cdr l)))
			 (else (cons (car l) (rember* a (cdr l))))))
		  (else (cons (rember* a (car l))
			      (rember* a (cdr l)))))))

    > (rember* 'cup '((coffee) cup ((tea) cup)
			       (and (hick)) cup))
    >(rember* 'cup '((coffee) cup ((tea) cup) (and (hick)) cup))
    > (rember* 'cup '(coffee))
    > >(rember* 'cup '())
    < <'()
    < '(coffee)
    > (rember* 'cup '(cup ((tea) cup) (and (hick)) cup))
    > (rember* 'cup '(((tea) cup) (and (hick)) cup))
    > >(rember* 'cup '((tea) cup))
    > > (rember* 'cup '(tea))
    > > >(rember* 'cup '())
    < < <'()
    < < '(tea)
    > > (rember* 'cup '(cup))
    > > (rember* 'cup '())
    < < '()
    < <'((tea))
    > >(rember* 'cup '((and (hick)) cup))
    > > (rember* 'cup '(and (hick)))
    > > >(rember* 'cup '((hick)))
    > > > (rember* 'cup '(hick))
    > > > >(rember* 'cup '())
    < < < <'()
    < < < '(hick)
    > > > (rember* 'cup '())
    < < < '()
    < < <'((hick))
    < < '(and (hick))
    > > (rember* 'cup '(cup))
    > > (rember* 'cup '())
    < < '()
    < <'((and (hick)))
    < '(((tea)) (and (hick)))
    <'((coffee) ((tea)) (and (hick)))
    '((coffee) ((tea)) (and (hick)))
    
  #+end_src

*** Inserting a member

+ ~insertR*~ is also easy to write but the ~trace~ for the example shows detailed stack calls for recursion and the true depth can be gauged as to what is happening in the machine.
  #+begin_src scheme
	(define insertR*
	  (lambda (new old l)
	    (cond ((null? l) (quote ()))
		  ((atom? (car l))
		   (cond ((eq? old (car l))
			  (cons old (cons new (insertR* new old (cdr l)))))
			 (else (cons (car l) (insertR* new old (cdr l))))))
		  (else (cons (insertR* new old (car l))
			      (insertR* new old (cdr l)))))))
    
    > (insertR* 'roast 'chuck
		'((how much (wood))
		  could
		  ((a (wood) chuck))
		  (((chuck)))
		  (if (a) ((wood chuck)))
		  could chuck wood))
    >(insertR*
      'roast
      'chuck
      '((how much (wood))
	could
	((a (wood) chuck))
	(((chuck)))
	(if (a) ((wood chuck)))
	could
	chuck
	wood))
    > (insertR* 'roast 'chuck '(how much (wood)))
    > >(insertR* 'roast 'chuck '(much (wood)))
    > > (insertR* 'roast 'chuck '((wood)))
    > > >(insertR* 'roast 'chuck '(wood))
    > > > (insertR* 'roast 'chuck '())
    < < < '()
    < < <'(wood)
    > > >(insertR* 'roast 'chuck '())
    < < <'()
    < < '((wood))
    < <'(much (wood))
    < '(how much (wood))
    > (insertR*
       'roast
       'chuck
       '(could
	 ((a (wood) chuck))
	 (((chuck)))
	 (if (a) ((wood chuck)))
	 could
	 chuck
	 wood))
    > >(insertR*
	'roast
	'chuck
	'(((a (wood) chuck)) (((chuck))) (if (a) ((wood chuck))) could chuck wood))
    > > (insertR* 'roast 'chuck '((a (wood) chuck)))
    > > >(insertR* 'roast 'chuck '(a (wood) chuck))
    > > > (insertR* 'roast 'chuck '((wood) chuck))
    > > > >(insertR* 'roast 'chuck '(wood))
    > > > > (insertR* 'roast 'chuck '())
    < < < < '()
    < < < <'(wood)
    > > > >(insertR* 'roast 'chuck '(chuck))
    > > > > (insertR* 'roast 'chuck '())
    < < < < '()
    < < < <'(chuck roast)
    < < < '((wood) chuck roast)
    < < <'(a (wood) chuck roast)
    > > >(insertR* 'roast 'chuck '())
    < < <'()
    < < '((a (wood) chuck roast))
    > > (insertR*
	 'roast
	 'chuck
	 '((((chuck))) (if (a) ((wood chuck))) could chuck wood))
    > > >(insertR* 'roast 'chuck '(((chuck))))
    > > > (insertR* 'roast 'chuck '((chuck)))
    > > > >(insertR* 'roast 'chuck '(chuck))
    > > > > (insertR* 'roast 'chuck '())
    < < < < '()
    < < < <'(chuck roast)
    > > > >(insertR* 'roast 'chuck '())
    < < < <'()
    < < < '((chuck roast))
    > > > (insertR* 'roast 'chuck '())
    < < < '()
    < < <'(((chuck roast)))
    > > >(insertR* 'roast 'chuck '((if (a) ((wood chuck))) could chuck wood))
    > > > (insertR* 'roast 'chuck '(if (a) ((wood chuck))))
    > > > >(insertR* 'roast 'chuck '((a) ((wood chuck))))
    > > > > (insertR* 'roast 'chuck '(a))
    > > > > >(insertR* 'roast 'chuck '())
    < < < < <'()
    < < < < '(a)
    > > > > (insertR* 'roast 'chuck '(((wood chuck))))
    > > > > >(insertR* 'roast 'chuck '((wood chuck)))
    > > > > > (insertR* 'roast 'chuck '(wood chuck))
    > > > >[10] (insertR* 'roast 'chuck '(chuck))
    > > > >[11] (insertR* 'roast 'chuck '())
    < < < <[11] '()
    < < < <[10] '(chuck roast)
    < < < < < '(wood chuck roast)
    > > > > > (insertR* 'roast 'chuck '())
    < < < < < '()
    < < < < <'((wood chuck roast))
    > > > > >(insertR* 'roast 'chuck '())
    < < < < <'()
    < < < < '(((wood chuck roast)))
    < < < <'((a) ((wood chuck roast)))
    < < < '(if (a) ((wood chuck roast)))
    > > > (insertR* 'roast 'chuck '(could chuck wood))
    > > > >(insertR* 'roast 'chuck '(chuck wood))
    > > > > (insertR* 'roast 'chuck '(wood))
    > > > > >(insertR* 'roast 'chuck '())
    < < < < <'()
    < < < < '(wood)
    < < < <'(chuck roast wood)
    < < < '(could chuck roast wood)
    < < <'((if (a) ((wood chuck roast))) could chuck roast wood)
    < < '((((chuck roast))) (if (a) ((wood chuck roast))) could chuck roast wood)
    < <'(((a (wood) chuck roast))
	 (((chuck roast)))
	 (if (a) ((wood chuck roast)))
	 could
	 chuck
	 roast
	 wood)
    < '(could
	((a (wood) chuck roast))
	(((chuck roast)))
	(if (a) ((wood chuck roast)))
	could
	chuck
	roast
	wood)
    <'((how much (wood))
       could
       ((a (wood) chuck roast))
       (((chuck roast)))
       (if (a) ((wood chuck roast)))
       could
       chuck
       roast
       wood)
    '((how much (wood)) could ((a (wood) chuck roast)) (((chuck roast)))
      (if (a) ((wood chuck roast))) could chuck roast wood)

  #+end_src
+ All ~*~ functions  work on empty lists, at atom consed onto a list, or a list consed onto a list.  ~*~ functions' additional activity is to
  recur into the ~car~ if required.

