schemer-notes.tex

\subsubsection{Frequency counting}
\label{sec:org591c073}

\begin{itemize}
\item Next we do a frequency counter across a nested list  and write a function called \texttt{occur*}.
\begin{verbatim}
    (define occur*
      (lambda (a l)
      (cond ((null? l) 0)
            ((atom? (car l))
             (cond ((eq? a (car l)) (add1 (occur* a (cdr l))))
                   (else (occur* a (cdr l)))))
            (else (o+ (occur* a (car l)) (occur* a (cdr l)))))))

> (occur* 'banana '((banana)
                    (split ((((banana ice)))
                            (cream (banana))
                            sherbet))
                    (banana)
                    (bread)
                    (banana brandy)))
>(occur*
  'banana
  '((banana)
    (split ((((banana ice))) (cream (banana)) sherbet))
    (banana)
    (bread)
    (banana brandy)))
> (occur* 'banana '(banana))
> >(occur* 'banana '())
< <0
< 1
> (occur*
   'banana
   '((split ((((banana ice))) (cream (banana)) sherbet))
     (banana)
     (bread)
     (banana brandy)))
> >(occur* 'banana '(split ((((banana ice))) (cream (banana)) sherbet)))
> >(occur* 'banana '(((((banana ice))) (cream (banana)) sherbet)))
> > (occur* 'banana '((((banana ice))) (cream (banana)) sherbet))
> > >(occur* 'banana '(((banana ice))))
> > > (occur* 'banana '((banana ice)))
> > > >(occur* 'banana '(banana ice))
> > > > (occur* 'banana '(ice))
> > > > (occur* 'banana '())
< < < < 0
< < < <1
> > > >(occur* 'banana '())
< < < <0
< < < 1
> > > (occur* 'banana '())
< < < 0
< < <1
> > >(occur* 'banana '((cream (banana)) sherbet))
> > > (occur* 'banana '(cream (banana)))
> > > (occur* 'banana '((banana)))
> > > >(occur* 'banana '(banana))
> > > > (occur* 'banana '())
< < < < 0
< < < <1
> > > >(occur* 'banana '())
< < < <0
< < < 1
> > > (occur* 'banana '(sherbet))
> > > (occur* 'banana '())
< < < 0
< < <1
< < 2
> > (occur* 'banana '())
< < 0
< <2
> >(occur* 'banana '((banana) (bread) (banana brandy)))
> > (occur* 'banana '(banana))
> > >(occur* 'banana '())
< < <0
< < 1
> > (occur* 'banana '((bread) (banana brandy)))
> > >(occur* 'banana '(bread))
> > >(occur* 'banana '())
< < <0
> > >(occur* 'banana '((banana brandy)))
> > > (occur* 'banana '(banana brandy))
> > > >(occur* 'banana '(brandy))
> > > >(occur* 'banana '())
< < < <0
< < < 1
> > > (occur* 'banana '())
< < < 0
< < <1
< < 1
< <2
< 4
<5
5

\end{verbatim}
\end{itemize}
