schemer-notes.org
*** Substituting  
  
+ Similarly we write the ~*~ function for ~subst*~. Nothing additional other than keeping in mind that we have to recur inside ~car~ of ~l~ also.
  #+begin_src scheme
	(define subst*
	  (lambda (new old l)
	    (cond ((null? l) (quote ()))
		  ((atom? (car l))
		   (cond ((eq? (car l) old)
			  (cons new (subst* new old (cdr l))))
			 (else (cons (car l)
				     (subst* new old (cdr l))))))
		  (else (cons (subst* new old (car l))
			      (subst* new old (cdr l)))))))
    
    > (subst* 'orange 'banana
	      '((banana)
		(split ((((banana ice)))
			(cream (banana))
			sherbet))
		(banana)
		(bread)
		(banana brandy)))
    >(subst*
      'orange
      'banana
      '((banana)
	(split ((((banana ice))) (cream (banana)) sherbet))
	(banana)
	(bread)
	(banana brandy)))
    > (subst* 'orange 'banana '(banana))
    > >(subst* 'orange 'banana '())
    < <'()
    < '(orange)
    > (subst*
       'orange
       'banana
       '((split ((((banana ice))) (cream (banana)) sherbet))
	 (banana)
	 (bread)
	 (banana brandy)))
    > >(subst*
	'orange
	'banana
	'(split ((((banana ice))) (cream (banana)) sherbet)))
    > > (subst* 'orange 'banana '(((((banana ice))) (cream (banana)) sherbet)))
    > > >(subst* 'orange 'banana '((((banana ice))) (cream (banana)) sherbet))
    > > > (subst* 'orange 'banana '(((banana ice))))
    > > > >(subst* 'orange 'banana '((banana ice)))
    > > > > (subst* 'orange 'banana '(banana ice))
    > > > > >(subst* 'orange 'banana '(ice))
    > > > > > (subst* 'orange 'banana '())
    < < < < < '()
    < < < < <'(ice)
    < < < < '(orange ice)
    > > > > (subst* 'orange 'banana '())
    < < < < '()
    < < < <'((orange ice))
    > > > >(subst* 'orange 'banana '())
    < < < <'()
    < < < '(((orange ice)))
    > > > (subst* 'orange 'banana '((cream (banana)) sherbet))
    > > > >(subst* 'orange 'banana '(cream (banana)))
    > > > > (subst* 'orange 'banana '((banana)))
    > > > > >(subst* 'orange 'banana '(banana))
    > > > > > (subst* 'orange 'banana '())
    < < < < < '()
    < < < < <'(orange)
    > > > > >(subst* 'orange 'banana '())
    < < < < <'()
    < < < < '((orange))
    < < < <'(cream (orange))
    > > > >(subst* 'orange 'banana '(sherbet))
    > > > > (subst* 'orange 'banana '())
    < < < < '()
    < < < <'(sherbet)
    < < < '((cream (orange)) sherbet)
    < < <'((((orange ice))) (cream (orange)) sherbet)
    > > >(subst* 'orange 'banana '())
    < < <'()
    < < '(((((orange ice))) (cream (orange)) sherbet))
    < <'(split ((((orange ice))) (cream (orange)) sherbet))
    > >(subst* 'orange 'banana '((banana) (bread) (banana brandy)))
    > > (subst* 'orange 'banana '(banana))
    > > >(subst* 'orange 'banana '())
    < < <'()
    < < '(orange)
    > > (subst* 'orange 'banana '((bread) (banana brandy)))
    > > >(subst* 'orange 'banana '(bread))
    > > > (subst* 'orange 'banana '())
    < < < '()
    < < <'(bread)
    > > >(subst* 'orange 'banana '((banana brandy)))
    > > > (subst* 'orange 'banana '(banana brandy))
    > > > >(subst* 'orange 'banana '(brandy))
    > > > > (subst* 'orange 'banana '())
    < < < < '()
    < < < <'(brandy)
    < < < '(orange brandy)
    > > > (subst* 'orange 'banana '())
    < < < '()
    < < <'((orange brandy))
    < < '((bread) (orange brandy))
    < <'((orange) (bread) (orange brandy))
    < '((split ((((orange ice))) (cream (orange)) sherbet))
	(orange)
	(bread)
	(orange brandy))
    <'((orange)
       (split ((((orange ice))) (cream (orange)) sherbet))
       (orange)
       (bread)
       (orange brandy))
    '((orange)
      (split
       ((((orange ice)))
	(cream (orange))
	sherbet))
      (orange)
      (bread)
      (orange brandy))

  #+end_src

+ The ~insertL*~ is again on the same lines as before. Planning to omit trace flows now since it will take multiple pages.
  #+begin_src scheme
	(define insertL*
	  (lambda (new old l)
	    (cond ((null? l) (quote ()))
		  ((atom? (car l))
		   (cond ((eq? (car l) old)
			  (cons new (cons old (insertL* new old (cdr l)))))
			 (else (cons (car l) (insertL* new old (cdr l))))))
		  (else (cons (insertL* new old (car l))
			      (insertL* new old (cdr l)))))))
    
    > (insertL* 'pecker 'chuck
		'((how much (wood))
		  could
		  ((a (wood) chuck))
		  (((chuck)))
		  (if (a) ((would chuck)))
		  could chuck wood))
    >(insertL*
      'pecker
      'chuck
      '((how much (wood))
	could
	((a (wood) chuck))
	(((chuck)))
	(if (a) ((would chuck)))
	could
	chuck
	wood))
    > (insertL* 'pecker 'chuck '(how much (wood)))
    > >(insertL* 'pecker 'chuck '(much (wood)))
    > > (insertL* 'pecker 'chuck '((wood)))
    > > >(insertL* 'pecker 'chuck '(wood))
    > > > (insertL* 'pecker 'chuck '())
    < < < '()
    < < <'(wood)
    > > >(insertL* 'pecker 'chuck '())
    < < <'()
    < < '((wood))
    < <'(much (wood))
    < '(how much (wood))
    > (insertL*
       'pecker
       'chuck
       '(could
	 ((a (wood) chuck))
	 (((chuck)))
	 (if (a) ((would chuck)))
	 could
	 chuck
	 wood))
    > >(insertL*
	'pecker
	'chuck
	'(((a (wood) chuck))
	  (((chuck)))
	  (if (a) ((would chuck)))
	  could
	  chuck
	  wood))
    > > (insertL* 'pecker 'chuck '((a (wood) chuck)))
    > > >(insertL* 'pecker 'chuck '(a (wood) chuck))
    > > > (insertL* 'pecker 'chuck '((wood) chuck))
    > > > >(insertL* 'pecker 'chuck '(wood))
    > > > > (insertL* 'pecker 'chuck '())
    < < < < '()
    < < < <'(wood)
    > > > >(insertL* 'pecker 'chuck '(chuck))
    > > > > (insertL* 'pecker 'chuck '())
    < < < < '()
    < < < <'(pecker chuck)
    < < < '((wood) pecker chuck)
    < < <'(a (wood) pecker chuck)
    > > >(insertL* 'pecker 'chuck '())
    < < <'()
    < < '((a (wood) pecker chuck))
    > > (insertL*
	 'pecker
	 'chuck
	 '((((chuck))) (if (a) ((would chuck))) could chuck wood))
    > > >(insertL* 'pecker 'chuck '(((chuck))))
    > > > (insertL* 'pecker 'chuck '((chuck)))
    > > > >(insertL* 'pecker 'chuck '(chuck))
    > > > > (insertL* 'pecker 'chuck '())
    < < < < '()
    < < < <'(pecker chuck)
    > > > >(insertL* 'pecker 'chuck '())
    < < < <'()
    < < < '((pecker chuck))
    > > > (insertL* 'pecker 'chuck '())
    < < < '()
    < < <'(((pecker chuck)))
    > > >(insertL* 'pecker 'chuck '((if (a) ((would chuck))) could chuck wood))
    > > > (insertL* 'pecker 'chuck '(if (a) ((would chuck))))
    > > > >(insertL* 'pecker 'chuck '((a) ((would chuck))))
    > > > > (insertL* 'pecker 'chuck '(a))
    > > > > >(insertL* 'pecker 'chuck '())
    < < < < <'()
    < < < < '(a)
    > > > > (insertL* 'pecker 'chuck '(((would chuck))))
    > > > > >(insertL* 'pecker 'chuck '((would chuck)))
    > > > > > (insertL* 'pecker 'chuck '(would chuck))
    > > > >[10] (insertL* 'pecker 'chuck '(chuck))
    > > > >[11] (insertL* 'pecker 'chuck '())
    < < < <[11] '()
    < < < <[10] '(pecker chuck)
    < < < < < '(would pecker chuck)
    > > > > > (insertL* 'pecker 'chuck '())
    < < < < < '()
    < < < < <'((would pecker chuck))
    > > > > >(insertL* 'pecker 'chuck '())
    < < < < <'()
    < < < < '(((would pecker chuck)))
    < < < <'((a) ((would pecker chuck)))
    < < < '(if (a) ((would pecker chuck)))
    > > > (insertL* 'pecker 'chuck '(could chuck wood))
    > > > >(insertL* 'pecker 'chuck '(chuck wood))
    > > > > (insertL* 'pecker 'chuck '(wood))
    > > > > >(insertL* 'pecker 'chuck '())
    < < < < <'()
    < < < < '(wood)
    < < < <'(pecker chuck wood)
    < < < '(could pecker chuck wood)
    < < <'((if (a) ((would pecker chuck))) could pecker chuck wood)
    < < '((((pecker chuck)))
	  (if (a) ((would pecker chuck)))
	  could
	  pecker
	  chuck
	  wood)
    < <'(((a (wood) pecker chuck))
	 (((pecker chuck)))
	 (if (a) ((would pecker chuck)))
	 could
	 pecker
	 chuck
	 wood)
    < '(could
	((a (wood) pecker chuck))
	(((pecker chuck)))
	(if (a) ((would pecker chuck)))
	could
	pecker
	chuck
	wood)
    <'((how much (wood))
       could
       ((a (wood) pecker chuck))
       (((pecker chuck)))
       (if (a) ((would pecker chuck)))
       could
       pecker
       chuck
       wood)
    '((how much (wood))
      could
      ((a (wood) pecker chuck))
      (((pecker chuck)))
      (if (a) ((would pecker chuck)))
      could
      pecker
      chuck
      wood)

  #+end_src
+ Writing a ~member*~ is also fairly simple. I think so far recursion has been ingrained into this book solvers mind!
  The trace diagram shows which ~chips~ the function found. That is important.
  #+begin_src scheme
	(define member*
	 (lambda (a l)
	   (cond ((null? l) #f)
		 ((atom? (car l))
		  (or (eq? (car l) a)
		      (member* a (cdr l))))
		 (else (or (member* a (car l))
			   (member* a (cdr l)))))))
    
    > (member* 'chips '((potato) (chips ((with) fish) (chips))))
    >(member* 'chips '((potato) (chips ((with) fish) (chips))))
    > (member* 'chips '(potato))
    > (member* 'chips '())
    < #f
    >(member* 'chips '((chips ((with) fish) (chips))))
    > (member* 'chips '(chips ((with) fish) (chips)))
    < #t
    <#t
    #t

  #+end_src

+ ~leftmost~ recurs only on the ~car~ looking for the atom in a non-empty list.
  #+begin_src scheme
    (define leftmost
      (lambda (l)
	(cond ((atom? (car l)) (car l))
	      (else (leftmost (car l))))))

  > (leftmost '((potato) (chips ((with) fish) (chips))))
  >(leftmost '((potato) (chips ((with) fish) (chips))))
  >(leftmost '(potato))
  <'potato
  'potato
  
  #+end_src

