schemer-notes.tex

\subsection{\texttt{and} vs \texttt{or}}
\label{sec:org06de401}

\begin{itemize}
\item Again the distinction between \texttt{and} and \texttt{or} is made. For \texttt{and} if the any of the expressions evaluates to \texttt{\#f} then further evaluation
stops. In \texttt{or} the evaluation stops the moment we find a \texttt{\#t}.
\item In a footnote a very important property of \texttt{cond} is highlighted (mentioned earlier in this booklet also). \texttt{cond} does not consider all of its arguments. It essentially
goes through a sequence from top to bottom. Prof Touretzky's book has a crystal clear explanation on this. In this book the authors state that neither \texttt{and} nor \texttt{or} can
be stated as functions using \texttt{cond} though both can be expressed as abbreviations of \texttt{cond}.
\begin{verbatim}
(and a b) = (cond (a b) else #f)
(or a b) = (cond (a #t) (else b))
\end{verbatim}

\item The function \texttt{eqlist?} is written to compare the elements of two lists. The first attempt is rather elaborate building from first logical principles.
But the second is concise. Here I write the second version.
\begin{verbatim}
    (define eqlist?
      (lambda (l1 l2)
        (cond ((and (null? l1) (null? l2)) #t)
              ((or (null? l1) (null? l2)) #f)
              ((and (atom? (car l1)) (atom? (car l2)))
               (and (eqan? (car l1) (car l2))
                    (eqlist? (cdr l1) (cdr l2))))
              ((or (atom? (car l1)) (atom? (car l2))) #f)
              (else (eqlist? (car l1) (car l2))
                    (eqlist? (cdr l1) (cdr l2))))))

> (eqlist? '(aloo ((matar)) (and (gobhi)))
           '(aloo ((matar)) and (gobhi)))
>(eqlist? '(aloo ((matar)) (and (gobhi))) '(aloo ((matar)) and (gobhi)))
>(eqlist? '(((matar)) (and (gobhi))) '(((matar)) and (gobhi)))
> (eqlist? '((matar)) '((matar)))
> >(eqlist? '(matar) '(matar))
> >(eqlist? '() '())
< <#t
> (eqlist? '() '())
< #t
>(eqlist? '((and (gobhi))) '(and (gobhi)))
<#f
#f

> (eqlist? '(aloo ((matar)) (and (gobhi)))
           '(aloo ((gajar)) and (gobhi)))
>(eqlist? '(aloo ((matar)) (and (gobhi))) '(aloo ((gajar)) and (gobhi)))
>(eqlist? '(((matar)) (and (gobhi))) '(((gajar)) and (gobhi)))
> (eqlist? '((matar)) '((gajar)))
> >(eqlist? '(matar) '(gajar))
< <#f
> (eqlist? '() '())
< #t
>(eqlist? '((and (gobhi))) '(and (gobhi)))
<#f
#f

\end{verbatim}
\item The book reiterates the definition of S-expression again: It is an atom or a (possibly empty) list of S-expressions.
\item Here I think is the turning point of the book. I think the basics are behind us now.
\item The function \texttt{equal?} is written using \texttt{eqlist?}. I am calling it \texttt{my-equal?} since \texttt{equal?} is built in to the language. The catch is now
\texttt{my-equal?} is comparing two S-expressions and not just atoms. 
\begin{verbatim}
(define my-equal?
  (lambda (s1 s2)
    (cond ((and (atom? s1) (atom? s2)) (eqan? s1 s2))
          ((or (atom? s1) (atom? s2)) #f)
          (else (eqlist? s1 s2)))))

(define eqlist-equal?
  (lambda (l1 l2)
    (cond ((and (null? l1) (null? l2)) #t)
          ((or (null? l1) (null? l2)) #f)
          (else (and (my-equal? (car l1) (car l2)))
                (eqlist-equal? (cdr l1) (cdr l2))))))

\end{verbatim}

\item \texttt{rember} is written so that it operates on an S-expression. The original function on a list of atoms was elegant itself.
 But the good part is we are now operating on S-expressions rather than atoms.
Anyways here is the function
\begin{verbatim}
(define rember-equal
  (lambda (s l)
    (cond
      ((null? l) (quote ()))
      ((equal? (car l) s) (cdr l))
      (else (cons (car l)
                  (rember-equal s (cdr l)))))))

\end{verbatim}

\item We cannot simplify \texttt{insertL*} because this function actually needs to look at atoms specifically.
\item The last question in the chapter is important. We should know which comparison predicate we need to use when. The table which I have in the previous chapter is good for that.
\end{itemize}

\textbf{Core Terms/Concepts Learnt}
\begin{itemize}
\item Able to recur in the \texttt{car}.
\item All comparison operators in the language (sort of)
\texttt{eq?}, \texttt{=}, \texttt{equal} primarily.
\item Recurring over a list of atoms vs S-expressions.
\end{itemize}


\newpage

\section{Shadows}
\label{sec:org5aa612a}

Names can hide other names. Environments matter.

\vspace{1em}

Key Takeaway:

\emph{The Seventh Commandment: Recur on the sub-parts that are of the same nature: 1) On the sub-lists of a list, 2) On the sub-expressions of an arithmetic expression.}

\bigskip

\emph{The Eight Commandment: Use help functions to abstract from representations.}

\vspace{1em}
