schemer-notes.org
** Symbols and Environments

+ We enter the realm of what symbols actually mean. A ~+~ may mean just a symbol and not an operation of addition. So we may have a traditional arithmetic operation of ~2 + 4 x 5~ which is
  an arithmetic expression. But this expression ~2 + 4 x 5~ can be bound to a symbol ~cookie~. Thus ~cookie~ is also an arithmetic expression.
  #+begin_src scheme
   (define cookie 12)
  #+end_src
  
+ The context or the environment matters.
+ A traditional ~(n + 5)~ is not considered an arithmetic expression since the parenthesis is not included in the definition of arithmetic expressions.
+ But ~(n + 5)~ is an S-expression. Therefore we can use it as an argument to a function. So how do we represent ~3 + 4 x 5~? By ~(3 + ( 4 x 5))~.
+ ~numbered?~ is a function that determines if a representation of an arithmetic expressions contains only numbers apart from +, x, exponential (~o^~).
  It is not actually evaluating the arithmetic expression.
+ The function ~numbered?~ is basically checking for the structural object of an arithmetic expression. I believe this is the early part of an interpreter.
+ The authors explicitly call out that ~(1 + 4)~ is not a list but in a list form.
+ I have not yet come across the reason why subtraction or division are not included in this basic interpretation of arithmetic expressions. Perhaps going into
  negative integers and for division going into the realm of decimals (floating points).
+ The first question asked in ~numbered?~ is whether all arithmetic expressions that are atoms are numbers or not. But why could not we only ask if it is a number only?
+ Now we can take a first stab at writing the ~numbered?~ function
  #+begin_src scheme
    (define numbered-long?
      (lambda (aexp)
	(cond ((atom? aexp) (number? aexp))
	      ((eq? (car (cdr aexp)) (quote o+))
	       (and (numbered-long? (car aexp))
		    (numbered-long? (car (cdr (cdr aexp))))))
	      ((eq? (car (cdr aexp)) (quote o*))
	       (and (numbered-long? (car aexp))
		    (numbered-long? (car (cdr (cdr aexp))))))
	      ((eq? (car (cdr aexp)) (quote o^))
	       (and (numbered-long? (car aexp))
		    (numbered-long? (car (cdr (cdr aexp)))))))))

    (define numbered?
      (lambda (aexp)
	(cond ((atom? aexp) (number? aexp))
	      (else (and (numbered? (car aexp))
			 (numbered? (car (cdr (cdr aexp)))))))))

  #+end_src
+ ~value~ is a function which returns the natural value of a numbered arithmetic expression. In the book the operations are limited to addition, multiplication and exponents. No error handling or any
  other arithmetic operation. It is fine since the intent is to get conceptual clarity and not go for a full blown interpreter.
  #+begin_src scheme
	(define value
	  (lambda (nexp)
	    (cond ((atom? nexp) nexp)
		  ((eq? (car (cdr nexp)) (quote +))
		   (o+ (value (car nexp))
		       (value (car (cdr (cdr nexp))))))
		  ((eq? (car (cdr nexp)) (quote x))
		   (o* (value (car nexp))
		       (value (car (cdr (cdr nexp))))))
		  (else
		   (o^ (value (car nexp))
		       (value (car (cdr (cdr nexp)))))))))

    > (value '((2 + 5) x (4 x 2)))
    >(value '((2 + 5) x (4 x 2)))
    > (value '(2 + 5))
    > >(value 2)
    < <2
    > >(value 5)
    < <5
    < 7
    > (value '(4 x 2))
    > >(value 4)
    < <4
    > >(value 2)
    < <2
    < 8
    <56
    56
    
  #+end_src
+ A wrong version of ~value~ for a prefix notation syntax is written and the concept of helper functions is introduced. The helper functions will pick the sub expressions.
  This is so because in the incorrect value function for prefix notation is wrong because it ends up with a subpart which is not an arithmetic expression. Even the operator
  can be got with a helper function easily. For the normal notation also these helper functions can be changed (earlier code on this).
  #+begin_src scheme
    (define 1st-sub-exp
      (lambda (aexp)
	(car (cdr aexp))))

    (define 2nd-sub-exp
      (lambda (aexp)
	(car (cdr (cdr aexp)))))

    (define operator
      (lambda (aexp)
	(car aexp)))

  #+end_src
+ Finally writing the function ~value~ with help of helper functions.
  #+begin_src scheme
	(define value-help
	  (lambda (nexp)
	    (cond ((atom? nexp) nexp)
		  ((eq? (operator nexp) (quote +))
		   (o+ (value-help (1st-sub-exp nexp))
		       (value-help (2nd-sub-exp nexp))))
		  ((eq? (operator nexp) (quote x))
		   (o* (value-help (1st-sub-exp nexp))
		       (value-help (2nd-sub-exp nexp))))
		  (else
		   (o^ (value (1st-sub-exp nexp))
		       (value (2nd-sub-exp nexp)))))))

    > (value-help '(+ 24 25))
    49
    
  #+end_src

*** Representations

+ The idea of representations is explicitly stated. ~4~ can be stated as say for instance ~(() () () ())~ or even ~(I V)~. The book extends
  the same representations for a few natural numbers. It is self explanatory.
+ We write a function called ~sero?~ for the representation of numbers in terms of ~()~ (same example as above). We also write ~edd1~ and ~zub1~.
  The authors have given such an elegant example of representation here.
  #+begin_src scheme
    (define sero?
      (lambda (n)
	(null? n)))

    (define edd1
      (lambda (n)
	(cons (quote ()) n)))

    (define zub1
      (lambda (n)
	(cdr n)))

  #+end_src
+ A ~(zub1 n)~ on ~()~ as ~n~ will give no answer as per the book. Theoretically speaking (negative numbers we would not be able to reproduce).
+ Let us write ~o+rep~.
  #+begin_src scheme
    (define o+rep
      (lambda n m
	(cond ((sero? m) n)
	      (else (edd1 (o+rep n (zub1 m)))))))

  #+end_src
+ The last two questions for the checking whether the new representation of ~4~ in parenthesis terms is a ~lat?~ or not. We must be aware of shadows because
  new binding of a variable hides the old binding.The interpreter looks for the nearest binding first.
  #+begin_src scheme
    > (lat? '((()) (()()) (()()()())))
    #f> (lat? '((()) (()()) (()()()())))
    #f

  #+end_src

*Core Terms/Concepts Learnt*
+ Names are not their values, the environment determines the meaning. Meaning of symbol depends on the current context/environment.
+ Expressions can represent numbers. Representation and value of an arithmetic expression is showing what it is and what value it evaluates to.
+ Recurring over a list of atoms vs S-expressions.
+ Rebinding names hides or shadows previous meanings. /You must be aware of shadows./


#+LATEX: \newpage

* Friends and Relations

Working with relations and symbolic computation. Manipulate lists of symbols and represent structured data.

#+LATEX: \vspace{1em}

Key Takeaway:

/Sets and set operations: Building and testing them./

#+LATEX: \bigskip

/Relations, Pairs and One-to-One Functions: Defining them./

#+LATEX: \vspace{1em}

** Sets and Operations

+ ~set?~ is exactly like the mathematical set in set theory. The book at the end also recommends Naive Set Theory as an interesting read by the great Paul Halmos.
  I own a copy but I am yet to read. The other book I like is Book of Proof by Richard Hammack.
+ A set has unique elements. No element in the set repeats.
+ An empty list ~()~ has no atoms. Thus nothing repeats and therefore this is a set too.

