schemer-notes.tex

\subsection{Symbols and Environments}
\label{sec:org3f708ba}

\begin{itemize}
\item We enter the realm of what symbols actually mean. A \texttt{+} may mean just a symbol and not an operation of addition. So we may have a traditional arithmetic operation of \texttt{2 + 4 x 5} which is
an arithmetic expression. But this expression \texttt{2 + 4 x 5} can be bound to a symbol \texttt{cookie}. Thus \texttt{cookie} is also an arithmetic expression.
\begin{verbatim}
(define cookie 12)
\end{verbatim}

\item The context or the environment matters.
\item A traditional \texttt{(n + 5)} is not considered an arithmetic expression since the parenthesis is not included in the definition of arithmetic expressions.
\item But \texttt{(n + 5)} is an S-expression. Therefore we can use it as an argument to a function. So how do we represent \texttt{3 + 4 x 5}? By \texttt{(3 + ( 4 x 5))}.
\item \texttt{numbered?} is a function that determines if a representation of an arithmetic expressions contains only numbers apart from +, x, exponential (\texttt{o\textasciicircum{}}).
It is not actually evaluating the arithmetic expression.
\item The function \texttt{numbered?} is basically checking for the structural object of an arithmetic expression. I believe this is the early part of an interpreter.
\item The authors explicitly call out that \texttt{(1 + 4)} is not a list but in a list form.
\item I have not yet come across the reason why subtraction or division are not included in this basic interpretation of arithmetic expressions. Perhaps going into
negative integers and for division going into the realm of decimals (floating points).
\item The first question asked in \texttt{numbered?} is whether all arithmetic expressions that are atoms are numbers or not. But why could not we only ask if it is a number only?
\item Now we can take a first stab at writing the \texttt{numbered?} function
\begin{verbatim}
(define numbered-long?
  (lambda (aexp)
    (cond ((atom? aexp) (number? aexp))
          ((eq? (car (cdr aexp)) (quote o+))
           (and (numbered-long? (car aexp))
                (numbered-long? (car (cdr (cdr aexp))))))
          ((eq? (car (cdr aexp)) (quote o*))
           (and (numbered-long? (car aexp))
                (numbered-long? (car (cdr (cdr aexp))))))
          ((eq? (car (cdr aexp)) (quote o^))
           (and (numbered-long? (car aexp))
                (numbered-long? (car (cdr (cdr aexp)))))))))

(define numbered?
  (lambda (aexp)
    (cond ((atom? aexp) (number? aexp))
          (else (and (numbered? (car aexp))
                     (numbered? (car (cdr (cdr aexp)))))))))

\end{verbatim}
\item \texttt{value} is a function which returns the natural value of a numbered arithmetic expression. In the book the operations are limited to addition, multiplication and exponents. No error handling or any
other arithmetic operation. It is fine since the intent is to get conceptual clarity and not go for a full blown interpreter.
\begin{verbatim}
    (define value
      (lambda (nexp)
        (cond ((atom? nexp) nexp)
              ((eq? (car (cdr nexp)) (quote +))
               (o+ (value (car nexp))
                   (value (car (cdr (cdr nexp))))))
              ((eq? (car (cdr nexp)) (quote x))
               (o* (value (car nexp))
                   (value (car (cdr (cdr nexp))))))
              (else
               (o^ (value (car nexp))
                   (value (car (cdr (cdr nexp)))))))))

> (value '((2 + 5) x (4 x 2)))
>(value '((2 + 5) x (4 x 2)))
> (value '(2 + 5))
> >(value 2)
< <2
> >(value 5)
< <5
< 7
> (value '(4 x 2))
> >(value 4)
< <4
> >(value 2)
< <2
< 8
<56
56

\end{verbatim}
\item A wrong version of \texttt{value} for a prefix notation syntax is written and the concept of helper functions is introduced. The helper functions will pick the sub expressions.
This is so because in the incorrect value function for prefix notation is wrong because it ends up with a subpart which is not an arithmetic expression. Even the operator
can be got with a helper function easily. For the normal notation also these helper functions can be changed (earlier code on this).
\begin{verbatim}
(define 1st-sub-exp
  (lambda (aexp)
    (car (cdr aexp))))

(define 2nd-sub-exp
  (lambda (aexp)
    (car (cdr (cdr aexp)))))

(define operator
  (lambda (aexp)
    (car aexp)))

\end{verbatim}
\item Finally writing the function \texttt{value} with help of helper functions.
\begin{verbatim}
    (define value-help
      (lambda (nexp)
        (cond ((atom? nexp) nexp)
              ((eq? (operator nexp) (quote +))
               (o+ (value-help (1st-sub-exp nexp))
                   (value-help (2nd-sub-exp nexp))))
              ((eq? (operator nexp) (quote x))
               (o* (value-help (1st-sub-exp nexp))
                   (value-help (2nd-sub-exp nexp))))
              (else
               (o^ (value (1st-sub-exp nexp))
                   (value (2nd-sub-exp nexp)))))))

> (value-help '(+ 24 25))
49

\end{verbatim}
\end{itemize}

\subsubsection{Representations}
\label{sec:org2516f6f}

\begin{itemize}
\item The idea of representations is explicitly stated. \texttt{4} can be stated as say for instance \texttt{(() () () ())} or even \texttt{(I V)}. The book extends
the same representations for a few natural numbers. It is self explanatory.
\item We write a function called \texttt{sero?} for the representation of numbers in terms of \texttt{()} (same example as above). We also write \texttt{edd1} and \texttt{zub1}.
The authors have given such an elegant example of representation here.
\begin{verbatim}
(define sero?
  (lambda (n)
    (null? n)))

(define edd1
  (lambda (n)
    (cons (quote ()) n)))

(define zub1
  (lambda (n)
    (cdr n)))

\end{verbatim}
\item A \texttt{(zub1 n)} on \texttt{()} as \texttt{n} will give no answer as per the book. Theoretically speaking (negative numbers we would not be able to reproduce).
\item Let us write \texttt{o+rep}.
\begin{verbatim}
(define o+rep
  (lambda n m
    (cond ((sero? m) n)
          (else (edd1 (o+rep n (zub1 m)))))))

\end{verbatim}
\item The last two questions for the checking whether the new representation of \texttt{4} in parenthesis terms is a \texttt{lat?} or not. We must be aware of shadows because
new binding of a variable hides the old binding.The interpreter looks for the nearest binding first.
\begin{verbatim}
> (lat? '((()) (()()) (()()()())))
#f> (lat? '((()) (()()) (()()()())))
#f

\end{verbatim}
\end{itemize}

\textbf{Core Terms/Concepts Learnt}
\begin{itemize}
\item Names are not their values, the environment determines the meaning. Meaning of symbol depends on the current context/environment.
\item Expressions can represent numbers. Representation and value of an arithmetic expression is showing what it is and what value it evaluates to.
\item Recurring over a list of atoms vs S-expressions.
\item Rebinding names hides or shadows previous meanings. \emph{You must be aware of shadows.}
\end{itemize}


\newpage

\section{Friends and Relations}
\label{sec:orgd7a7497}

Working with relations and symbolic computation. Manipulate lists of symbols and represent structured data.

\vspace{1em}

Key Takeaway:

\emph{Sets and set operations: Building and testing them.}

\bigskip

\emph{Relations, Pairs and One-to-One Functions: Defining them.}

\vspace{1em}

\subsection{Sets and Operations}
\label{sec:org5b4d089}

\begin{itemize}
\item \texttt{set?} is exactly like the mathematical set in set theory. The book at the end also recommends Naive Set Theory as an interesting read by the great Paul Halmos.
I own a copy but I am yet to read. The other book I like is Book of Proof by Richard Hammack.
\item A set has unique elements. No element in the set repeats.
\item An empty list \texttt{()} has no atoms. Thus nothing repeats and therefore this is a set too.
\end{itemize}
