schemer-notes.tex

\subsubsection{Set test}
\label{sec:org4a259ac}

\begin{itemize}
\item Writing \texttt{set?} is fairly easy
\begin{verbatim}
    (define set?
      (lambda (lat)
        (cond ((null? lat) #t)
              ((member? (car lat) (cdr lat)) #f)
              (else (set? (cdr lat))))))

> (set? '(pani puri gol guppa phucka pani))
>(set? '(pani puri gol guppa phucka pani))
<#f
#f
> (set? '(pani puri gol guppa phucka))
>(set? '(pani puri gol guppa phucka))
>(set? '(puri gol guppa phucka))
>(set? '(gol guppa phucka))
>(set? '(guppa phucka))
>(set? '(phucka))
>(set? '())
<#t
#t

\end{verbatim}
\end{itemize}

\subsubsection{Build a set}
\label{sec:org5414f5f}

\begin{itemize}
\item Next we build sets. First we write \texttt{makeset} using \texttt{member?} and then with \texttt{multirember}. There is a difference between the two methods.
In using \texttt{member?} we go through each atom on the list one by one and only consing that when it is not in the rest of the list. It is
building using a predicate test actually.  While using \texttt{multirember} we first build a list and that list is build by removing the elements
given to the \texttt{makeset} function. Trace should show the flow cleanly.
\begin{verbatim}
    (define makeset
      (lambda (lat)
        (cond ((null? lat) (quote ()))
              ((member? (car lat) (cdr lat))
               (makeset (cdr lat)))
              (else (cons (car lat) (makeset (cdr lat)))))))

> (makeset '(apple peach pear peach
                   plum apple lemon peach))
>(makeset '(apple peach pear peach plum apple lemon peach))
>(makeset '(peach pear peach plum apple lemon peach))
>(makeset '(pear peach plum apple lemon peach))
> (makeset '(peach plum apple lemon peach))
> (makeset '(plum apple lemon peach))
> >(makeset '(apple lemon peach))
> > (makeset '(lemon peach))
> > >(makeset '(peach))
> > > (makeset '())
< < < '()
< < <'(peach)
< < '(lemon peach)
< <'(apple lemon peach)
< '(plum apple lemon peach)
<'(pear plum apple lemon peach)
'(pear plum apple lemon peach)

\end{verbatim}

\begin{verbatim}
    (define makeset-multirember
      (lambda (lat)
        (cond ((null? lat) (quote ()))
              (else
               (cons (car lat)
                     (makeset-multirember
                      (multirember (car lat) (cdr lat))))))))

> (makeset-multirember '(apple peach pear peach
                               plum apple lemon peach))
>(makeset-multirember '(apple peach pear peach plum apple lemon peach))
> (makeset-multirember '(peach pear peach plum lemon peach))
> >(makeset-multirember '(pear plum lemon))
> > (makeset-multirember '(plum lemon))
> > >(makeset-multirember '(lemon))
> > > (makeset-multirember '())
< < < '()
< < <'(lemon)
< < '(plum lemon)
< <'(pear plum lemon)
< '(peach pear plum lemon)
<'(apple peach pear plum lemon)
'(apple peach pear plum lemon)

\end{verbatim}

\item Additionally testing \texttt{makeset} on data which has numbers.
\begin{verbatim}
> (makeset '(apple 3 pear 4 9 apple 3 4))
'(pear 9 apple 3 4)

> (makeset-multirember '(apple 3 pear 4 9 apple 3 4))
>(makeset-multirember '(apple 3 pear 4 9 apple 3 4))
> (makeset-multirember '(3 pear 4 9 3 4))
> >(makeset-multirember '(pear 4 9 4))
> > (makeset-multirember '(4 9 4))
> > >(makeset-multirember '(9))
> > > (makeset-multirember '())
< < < '()
< < <'(9)
< < '(4 9)
< <'(pear 4 9)
< '(3 pear 4 9)
<'(apple 3 pear 4 9)
'(apple 3 pear 4 9)

\end{verbatim}
\end{itemize}

\subsubsection{Subsets}
\label{sec:org59e0caa}

\begin{itemize}
\item \texttt{subset?} is a test to check if one set is a part of the other set. Each element of the first set should be present in the other
set for it to be called a subset. This is elementary set theory.
\begin{verbatim}
(define subset?
  (lambda (set1 set2)
    (cond ((null? set1) #t)
          ((member? (car set1) set2)
           (subset? (cdr set1) set2))
          (else #f))))

\end{verbatim}
The book asks us to write \texttt{subset?} with an \texttt{and} also. At first we might think why but I am guessing the authors will drive home the
point at a later point in time.
\begin{verbatim}
(define subset-and?
  (lambda (set1 set2)
    (cond ((null? set1) #t)
          (else (and (member? (car set1) set2)
                     (subset-and? (cdr set1) set2))))))

\end{verbatim}
\end{itemize}


\subsubsection{Equality of sets}
\label{sec:orgd6a2ad4}

\begin{itemize}
\item Next is the test to see if the sets are exactly the same. We can actually just check is the first set is the subset of the second one
and the second set is also the subset of the first one. If both are true then we can say they are equal sets. Also we truly just need
one \texttt{and} test that is all. No \texttt{cond} or anything in this case. I guess this is like anonymous functions perhaps. This is probably the
first function we have written without \texttt{cond} so far.
\begin{verbatim}
(define eqset?
  (lambda (set1 set2)
    (and (subset? set1 set2)
         (subset? set2 set1))))

\end{verbatim}
\end{itemize}


\subsubsection{Intersection of sets}
\label{sec:org33b80cf}

\begin{itemize}
\item The predicate \texttt{intersect?} simply checks if the any of the elements in the first set is present in the other set or not. The book asks us
to simplify and also use \texttt{or} but to me without the \texttt{or} looks more clean and elegant. With \texttt{or} we simply push the last two tests of the cond
with an \texttt{or} in the else leg.
\begin{verbatim}
(define intersect?
  (lambda (set1 set2)
    (cond ((null? set1) #f)
          ((member? (car set1) set2) #t)
          (else (intersect? (cdr set1) set2)))))

\end{verbatim}

\item \texttt{intersect} basically returns the elements which are common in the two sets.
\begin{verbatim}
(define intersect
  (lambda (set1 set2)
    (cond ((null? set1) (quote ()))
          ((member? (car set1) set2)
           (cons (car set1) (intersect (cdr set1) set2)))
          (else (intersect (cdr set1) set2)))))

\end{verbatim}
\end{itemize}

\subsubsection{Union of sets}
\label{sec:org4a79fda}

\begin{itemize}
\item \texttt{union} picks all the elements across the two sets without repeating the intersect elements. It is exactly the same as union in set theory.
\begin{verbatim}
(define union
  (lambda (set1 set2)
    (cond ((null? set1) set2)
          ((member? (car set1) set2)
           (union (cdr set1) set2))
          (else (cons (car set1)
                      (union (cdr set1) set2))))))

> (union '(a b) '(a c d))
>(union '(a b) '(a c d))
>(union '(b) '(a c d))
> (union '() '(a c d))
< '(a c d)
<'(b a c d)
'(b a c d)

\end{verbatim}
\end{itemize}

\subsubsection{Difference of sets}
\label{sec:org614b988}

\begin{itemize}
\item This function is the difference in the two sets. Compared to \texttt{union} the only change is that when the first set is null then we return an empty list
rather than the second list.
\begin{verbatim}
(define set-difference
  (lambda (set1 set2)
    (cond ((null? set1) (quote ()))
          ((member? (car set1) set2)
           (set-difference (cdr set1) set2))
          (else (cons (car set1)
                      (set-difference (cdr set1) set2))))))

\end{verbatim}

\item This section of the chapter is interesting as we will get introduced to the concepts of pairs, relations, functions, one to one relationships. The authors say
so much with so little. This is indeed a deep book and requires multiple readings. I am certain if I start reading from the beginning again I will learn even more things.
Additionally, we need to keep referencing other material at the same time.

\item The function \texttt{intersectall} is written very smartly! It looks at a list of lists and finds common intersection across all the lists.
\begin{verbatim}
    (define intersectall ;;smart function!
      (lambda (l-set)
        (cond ((null? (cdr l-set)) (car l-set))
              (else (intersect (car l-set)
                               (intersectall (cdr l-set)))))))

> (intersectall '((a b c) (c a d e) (e f g h a b)))
>(intersectall '((a b c) (c a d e) (e f g h a b)))
> (intersectall '((c a d e) (e f g h a b)))
> >(intersectall '((e f g h a b)))
< <'(e f g h a b)
< '(a e)
<'(a)
'(a)

\end{verbatim}
\end{itemize}
