schemer-notes.org
** ~pairs~

+ Now we come to one of the most important things in Lisp in general - a pair. In Lisp a pair is the most fundamental data structure. It is created with the function ~cons~,
  which stands for /construct/.
  #+begin_src scheme
    > (cons 'a 'b)
    '(a . b)

  #+end_src

  The `a' is the ~car~ and `b' is ~cdr~. When the ~cdr~ is the null list ~()~ then we get the list data structure. The book says a list with two atoms is a pair. That is correct
  but in this case the it is a special form of the pair as mentioned in the previous statement. Even a list of two S-expressions is a pair.

+ The code definition of a ~pair?~ is quite good.
  #+begin_src scheme
    (define a-pair?  ;;reason out each line of cond
      (lambda (x)
	(cond
	  ((atom? x) #f) ;; there is not a single element
	  ((null? x) #f) ;; the list is not empty
	  ((null? (cdr x)) #f) ;; the list does not have only one element
	  ((null? (cdr (cdr x))) #t) ;; there is no third or more element
				     ;;i.e. now we have exactly 2 elements
	  (else #f)))) ;; everything else is not a pair

  #+end_src

+ The book talks about how to build a pair exactly like I mentioned earlier. Also how to get the first and second element. In Common Lisp (Prof Touretzky's book) it
  was also demonstrated exactly in this manner but right at the start of the book essentially. These functions are used to make representations of pairs and to get
  parts of representations of pairs. They will improve readability.
  #+begin_src scheme
    (define my-first
      (lambda (p)
	(cond
	  (else (car p)))))

    (define my-second
      (lambda (p)
	(cond
	  (else (car (cdr p))))))

    (define my-third ;; not applicable to pairs but in general for a list
      (lambda (p)
	(cond
	  (else (car (cdr (cdr p)))))))

    (define build
      (lambda (s1 s2)
	(cond
	  (else (cons s1 (cons s2 (quote ())))))))

  #+end_src

+ We truly do not need ~cond~ in the definition of ~first~, ~second~ or ~third~. For instance
  #+begin_src scheme
    (define my-third-nocond
      (lambda (p)
	(car (cdr (cdr p)))))

  #+end_src

** Relations

+ ~rel~ is a relation. Relations are between a set of pairs. This again originates from the concept of relations in set theory. A pair can be
  ordered or unordered. In unordered pairs ~(a b)~ is same as ~(b a)~. But in ordered pair these two are different. A relation from one set to another
  is a forming of a pair where one element from the first element is taken and the second element of the pair is got from the second set. This is what
  we call a relationship. Now if that relation has a constraint that the first element is mapped to exactly one element in the second set then we say it
  is a function. So function is a one to one relationship pair between two sets.

+ The book smartly defines functions as a special case of relations by saying that the first element of the pairs should be a set essentially meaning that
  there is one to element in first set which maps uniquely to a second element in the second set. A first element mapping to two elements in second set is not
  a function.
  #+begin_src scheme
    (define fun?
      (lambda (rel)
	(set? (firsts rel))))

  #+end_src

+ The next function is reversing the elements within a relation. Here we see the usefulness of ~build~, ~first~,and  ~second~. Helper functions make code look clean
  and flow logically.
  #+begin_src scheme
    (define revrel
      (lambda (rel)
	(cond ((null? rel) (quote ()))
	      (else (cons (build
			   (second (car rel))
			   (first (car rel)))
			  (revrel (cdr rel)))))))
    
  #+end_src

*** Reversing a ~pair~

+ Another helper function can be written which simply reverses a pair.
  #+begin_src scheme
    (define revpair
      (lambda (pair)
	(build (second pair) (first pair))))

    (define revrel-revpair
      (lambda (rel)
	(cond ((null? rel) (quote ()))
	      (else (cons (revpair (car rel))
			  (revrel-revpair (cdr rel)))))))

  #+end_src

*** One to One relations

+ Finally we reach the one-to-one function. In set theory this is a function (meaning that each of the element from first set i.e. the domain uniquely maps to an element in the second set i.e. the co-domain) which is one-to-one.
  By this we mean that each element in the second set i.e. the co-domain maps to exactly one element in the first set i.e. the domain. Therefore there is a one-to-one mapping from domain to co-domain and vice versa.
  #+begin_src scheme
    (define fullfun?
      (lambda (fun)
	(set? (seconds fun))))

    (define one-to-one?
      (lambda (fun)
	(fun? (revrel fun))))

  #+end_src

+ The last page of this chapter looks like a fun thing but there is probably a lesson or two in this. First the lambda does not take any arguments so this is a procedure when called will execute a certain steps without any external
  influence in terms of arguments. Next we can see the sequence of multiple mixes and cream. So we actually know from the various indentations when that specific mix is done. So in a Lisp program we can communicate ideas in sequences
  and not be worried about instructing the computer but rather use it as a medium to communicate ideas.

*Core Terms/Concepts Learnt*
+ Sets, Relations, Pairs, Functions, One-to-one functions
+ Set operations such as intersection, union, difference, subset
+ Use of helper functions

#+LATEX: \newpage

* Lambda the Ultimate

Introduce anonymous functions and higher order design. ~lambdas~ encapsulate behavior and enable abstraction without naming.

#+LATEX: \bigskip

Key Takeaway:

/The Ninth Commandment: Abstract common patterns with a new function./

#+LATEX: \bigskip

/The Tenth Commandment: Build functions to collect more than one value at a time./

#+LATEX: \vspace{1em}

+ This is an important chapter and I will try and make the notes as detailed as possible and have subsections for each concepts covered.

** Higher Order Functions

*** Passing a Function as an Argument

+ We re-look at the function to remove a member ~rember~ with the test being executed by ~equal~. The learning is that we can create another function ~rember-f~ which takes in a function additionally
  as an argument and applies it to the ~rember~ function. We are learning to pass functions to functions perhaps here.
+ We have 4 functions now which do similar things now ~rember~ with ~=~, ~eq?~, and ~equal?~, and the one which we write now ~rember-f~.
  #+begin_src scheme
    (define rember-f1
      (lambda (test? a l)
	(cond
	  ((null? l) (quote ()))
	  ((test? a (car l)) (cdr l))
	  (else (cons (car l) (rember-f1 test? a (cdr l)))))))

  #+end_src

+ In the above version of ~rember-f~ we are passing a `test function' such as ~eq?~ and this ~eq?~ gets applied within the function ~rember-f~.
+ When ~=~ passed we compare numbers, when ~eq?~ is passed we compare objects such as symbols or strings and when ~equal?~ is passed we compare structures like a list.

