schemer-notes.tex

\subsection{\texttt{pairs}}
\label{sec:orgdbfdcd0}

\begin{itemize}
\item Now we come to one of the most important things in Lisp in general - a pair. In Lisp a pair is the most fundamental data structure. It is created with the function \texttt{cons},
which stands for \emph{construct}.
\begin{verbatim}
> (cons 'a 'b)
'(a . b)

\end{verbatim}

The `a' is the \texttt{car} and `b' is \texttt{cdr}. When the \texttt{cdr} is the null list \texttt{()} then we get the list data structure. The book says a list with two atoms is a pair. That is correct
but in this case the it is a special form of the pair as mentioned in the previous statement. Even a list of two S-expressions is a pair.

\item The code definition of a \texttt{pair?} is quite good.
\begin{verbatim}
(define a-pair?  ;;reason out each line of cond
  (lambda (x)
    (cond
      ((atom? x) #f) ;; there is not a single element
      ((null? x) #f) ;; the list is not empty
      ((null? (cdr x)) #f) ;; the list does not have only one element
      ((null? (cdr (cdr x))) #t) ;; there is no third or more element
                                 ;;i.e. now we have exactly 2 elements
      (else #f)))) ;; everything else is not a pair

\end{verbatim}

\item The book talks about how to build a pair exactly like I mentioned earlier. Also how to get the first and second element. In Common Lisp (Prof Touretzky's book) it
was also demonstrated exactly in this manner but right at the start of the book essentially. These functions are used to make representations of pairs and to get
parts of representations of pairs. They will improve readability.
\begin{verbatim}
(define my-first
  (lambda (p)
    (cond
      (else (car p)))))

(define my-second
  (lambda (p)
    (cond
      (else (car (cdr p))))))

(define my-third ;; not applicable to pairs but in general for a list
  (lambda (p)
    (cond
      (else (car (cdr (cdr p)))))))

(define build
  (lambda (s1 s2)
    (cond
      (else (cons s1 (cons s2 (quote ())))))))

\end{verbatim}

\item We truly do not need \texttt{cond} in the definition of \texttt{first}, \texttt{second} or \texttt{third}. For instance
\begin{verbatim}
(define my-third-nocond
  (lambda (p)
    (car (cdr (cdr p)))))

\end{verbatim}
\end{itemize}

\subsection{Relations}
\label{sec:orgdbc8dc4}

\begin{itemize}
\item \texttt{rel} is a relation. Relations are between a set of pairs. This again originates from the concept of relations in set theory. A pair can be
ordered or unordered. In unordered pairs \texttt{(a b)} is same as \texttt{(b a)}. But in ordered pair these two are different. A relation from one set to another
is a forming of a pair where one element from the first element is taken and the second element of the pair is got from the second set. This is what
we call a relationship. Now if that relation has a constraint that the first element is mapped to exactly one element in the second set then we say it
is a function. So function is a one to one relationship pair between two sets.

\item The book smartly defines functions as a special case of relations by saying that the first element of the pairs should be a set essentially meaning that
there is one to element in first set which maps uniquely to a second element in the second set. A first element mapping to two elements in second set is not
a function.
\begin{verbatim}
(define fun?
  (lambda (rel)
    (set? (firsts rel))))

\end{verbatim}

\item The next function is reversing the elements within a relation. Here we see the usefulness of \texttt{build}, \texttt{first},and  \texttt{second}. Helper functions make code look clean
and flow logically.
\begin{verbatim}
(define revrel
  (lambda (rel)
    (cond ((null? rel) (quote ()))
          (else (cons (build
                       (second (car rel))
                       (first (car rel)))
                      (revrel (cdr rel)))))))

\end{verbatim}
\end{itemize}

\subsubsection{Reversing a \texttt{pair}}
\label{sec:org57bb38e}

\begin{itemize}
\item Another helper function can be written which simply reverses a pair.
\begin{verbatim}
(define revpair
  (lambda (pair)
    (build (second pair) (first pair))))

(define revrel-revpair
  (lambda (rel)
    (cond ((null? rel) (quote ()))
          (else (cons (revpair (car rel))
                      (revrel-revpair (cdr rel)))))))

\end{verbatim}
\end{itemize}

\subsubsection{One to One relations}
\label{sec:org5305992}

\begin{itemize}
\item Finally we reach the one-to-one function. In set theory this is a function (meaning that each of the element from first set i.e. the domain uniquely maps to an element in the second set i.e. the co-domain) which is one-to-one.
By this we mean that each element in the second set i.e. the co-domain maps to exactly one element in the first set i.e. the domain. Therefore there is a one-to-one mapping from domain to co-domain and vice versa.
\begin{verbatim}
(define fullfun?
  (lambda (fun)
    (set? (seconds fun))))

(define one-to-one?
  (lambda (fun)
    (fun? (revrel fun))))

\end{verbatim}

\item The last page of this chapter looks like a fun thing but there is probably a lesson or two in this. First the lambda does not take any arguments so this is a procedure when called will execute a certain steps without any external
influence in terms of arguments. Next we can see the sequence of multiple mixes and cream. So we actually know from the various indentations when that specific mix is done. So in a Lisp program we can communicate ideas in sequences
and not be worried about instructing the computer but rather use it as a medium to communicate ideas.
\end{itemize}

\textbf{Core Terms/Concepts Learnt}
\begin{itemize}
\item Sets, Relations, Pairs, Functions, One-to-one functions
\item Set operations such as intersection, union, difference, subset
\item Use of helper functions
\end{itemize}

\newpage

\section{Lambda the Ultimate}
\label{sec:orgd220956}

Introduce anonymous functions and higher order design. \texttt{lambdas} encapsulate behavior and enable abstraction without naming.

\bigskip

Key Takeaway:

\emph{The Ninth Commandment: Abstract common patterns with a new function.}

\bigskip

\emph{The Tenth Commandment: Build functions to collect more than one value at a time.}

\vspace{1em}

\begin{itemize}
\item This is an important chapter and I will try and make the notes as detailed as possible and have subsections for each concepts covered.
\end{itemize}

\subsection{Higher Order Functions}
\label{sec:org5ad3a51}

\subsubsection{Passing a Function as an Argument}
\label{sec:org6cea3ca}

\begin{itemize}
\item We re-look at the function to remove a member \texttt{rember} with the test being executed by \texttt{equal}. The learning is that we can create another function \texttt{rember-f} which takes in a function additionally
as an argument and applies it to the \texttt{rember} function. We are learning to pass functions to functions perhaps here.
\item We have 4 functions now which do similar things now \texttt{rember} with \texttt{=}, \texttt{eq?}, and \texttt{equal?}, and the one which we write now \texttt{rember-f}.
\begin{verbatim}
(define rember-f1
  (lambda (test? a l)
    (cond
      ((null? l) (quote ()))
      ((test? a (car l)) (cdr l))
      (else (cons (car l) (rember-f1 test? a (cdr l)))))))

\end{verbatim}

\item In the above version of \texttt{rember-f} we are passing a `test function' such as \texttt{eq?} and this \texttt{eq?} gets applied within the function \texttt{rember-f}.
\item When \texttt{=} passed we compare numbers, when \texttt{eq?} is passed we compare objects such as symbols or strings and when \texttt{equal?} is passed we compare structures like a list.
\end{itemize}
