schemer-notes.org
*** Functions Returning a Function

+ So far we have seen functions returning lists and atoms.
+ We get to know in this section that functions can return functions too.
+ ~(lambda (a l)...)~ is a function which takes two arguments ~a~ and ~l~.
+ Moses Schönfinkel was a mathematician who was the inventor of combinatory logic. He was the first person to show that functions that take two or more arguments could be reduced to
  functions by taking only a single argument. Later the mathematician Haskell Curry after whom the programming language Haskell is named took this concept mainstream and it has been called
  Currying ever since. Unfortunately Schönfinkel spent his last days in poverty. After he was gone his papers were burnt down by neighbors in Moscow for heating! There are only two papers by
  him which remain. Everything else was lost. We do not know where those ideas could have led us to.
+ Using ~define~ we give the lambda function a name. For instance in the case below.
  #+begin_src scheme
    (define eq?-c
      (lambda (a)
	(lambda (x)
	  (eq? x a))))

  #+end_src
+ In the function above if we pass something as the argument the function returns a function object. For instance in my case Dr Racket mentions that it is returning a procedure.
  #+begin_src scheme
    > (eq?-c 'salad)
    #<procedure:...chemer-workbook.rkt:593:4>

  #+end_src
+ Without giving a name to this function we can still pass the two arguments to the function.
  #+begin_src scheme
    > (eq?-salad 'salad)
    >(eq?-salad 'salad)
    <#t
    #t
    > (eq?-salad 'tuna)
    >(eq?-salad 'tuna)
    <#f
    #f
    > ((eq?-c 'salad) 'salad)
    #t
    > ((eq?-c 'salad) 'tuna)
    #f

  #+end_src
+ Now we will curry the ~rember-f~ function (it is actually only partially curried). Now this function returns another function after taking only argument.
  #+begin_src scheme
	(define rember-f
	  (lambda (test?)
	    (lambda (a l)
	      (cond
		((null? l) (quote ()))
		((test? a (car l)) (cdr l))
		(else (cons (car l)
			    ((rember-f test?) a (cdr l))))))))
    > ((rember-f eq?) 'tuna '(shrimp salad and tuna salad))
    '(shrimp salad and salad)
    > ((rember-f eq?) 'eq? '(equal? eq? eqan? eqlist? eqpair?))
    '(equal? eqan? eqlist? eqpair?)
    
  #+end_src

*** Passing Anonymous Functions as Arguments

+ The insert left or right functions can also be partially curried. One question asked is what is the difference between these two. Its only the order of ~cons~ in
  the second test that is all.
  #+begin_src scheme
    (define insertL-f
      (lambda (test?)
	(lambda (new old l)
	  (cond
	    ((null? l) (quote ()))
	    ((test? (car l) old)
	     (cons new (cons old (cdr l))))
	    (else (cons (car l)
			((insertL-f test?) new old (cdr l))))))))

    (define insertR-f
      (lambda (test?)
	(lambda (new old l)
	  (cond
	    ((null? l) (quote ()))
	    ((test? (car l) old)
	     (cons old (cons new (cdr l))))
	    (else (cons (car l)
			((insertR-f test?) new old (cdr l))))))))

  #+end_src
+ The difference in the two can written separately as helper functions and then we can call a generic ~insert-g~ with these helper functions to get ~insertL-f~ or
  ~insertR-f~.
  #+begin_src scheme
    (define seqL
      (lambda (new old l)
	(cons new (cons old l))))

    (define seqR
      (lambda (new old l)
	(cons old (cons new l))))

  #+end_src

+ Time to write the left or write agnostic function which will take ~seqL~ or ~seqR~. Notice we remove the ~test?~ this is so because are sort of removing a degree of freedom.
  We are abstracting out the part that varies to make functions more general and in this case we are 'okay' with ~eq?~.
  #+begin_src scheme
    (define insert-g
      (lambda (seq)
	(lambda (new old l)
	  (cond
	    ((null? l) (quote ()))
	    ((eq? (car l) old)
	     (seq new old (cdr l)))
	    (else (cons (car l)
			((insert-g seq) new old (cdr l))))))))

  #+end_src
+ Now we can define the left and right functions by passing helper functions appropriately. But do we need to pass ~seqL~ and ~seqR~ and why not something generic as ~seq~?
  #+begin_src scheme
    (define insertL (insert-g seqL))
    (define insertR (insert-g seqR))
    
  #+end_src
+ Now comes the idea of passing anonymous or lambdas as the programming world calls it to functions. In Prof Touretzky's book also we have come across this.
  #+begin_src scheme
	(define insertL-anon
	  (insert-g
	   (lambda (new old l)
	    (cons new (cons old l)))))
    
    > (insertL-anon 'x 'a '(a b c d))
    '(x a b c d)

  #+end_src
+ Similarly for the ~subst~ substitute function we could create another helper function.
  #+begin_src scheme
    (define seqS
      (lambda (new old l)
	(cons new l)))

    (define subst-def2
      (insert-g seqS))

    (define subst-anon
      (insert-g
       (lambda (new old l)
	 (cons new l))))

  #+end_src

