schemer-notes.tex

\subsubsection{Functions Returning a Function}
\label{sec:org740b5a7}

\begin{itemize}
\item So far we have seen functions returning lists and atoms.
\item We get to know in this section that functions can return functions too.
\item \texttt{(lambda (a l)...)} is a function which takes two arguments \texttt{a} and \texttt{l}.
\item Moses Schönfinkel was a mathematician who was the inventor of combinatory logic. He was the first person to show that functions that take two or more arguments could be reduced to
functions by taking only a single argument. Later the mathematician Haskell Curry after whom the programming language Haskell is named took this concept mainstream and it has been called
Currying ever since. Unfortunately Schönfinkel spent his last days in poverty. After he was gone his papers were burnt down by neighbors in Moscow for heating! There are only two papers by
him which remain. Everything else was lost. We do not know where those ideas could have led us to.
\item Using \texttt{define} we give the lambda function a name. For instance in the case below.
\begin{verbatim}
(define eq?-c
  (lambda (a)
    (lambda (x)
      (eq? x a))))

\end{verbatim}
\item In the function above if we pass something as the argument the function returns a function object. For instance in my case Dr Racket mentions that it is returning a procedure.
\begin{verbatim}
> (eq?-c 'salad)
#<procedure:...chemer-workbook.rkt:593:4>

\end{verbatim}
\item Without giving a name to this function we can still pass the two arguments to the function.
\begin{verbatim}
> (eq?-salad 'salad)
>(eq?-salad 'salad)
<#t
#t
> (eq?-salad 'tuna)
>(eq?-salad 'tuna)
<#f
#f
> ((eq?-c 'salad) 'salad)
#t
> ((eq?-c 'salad) 'tuna)
#f

\end{verbatim}
\item Now we will curry the \texttt{rember-f} function (it is actually only partially curried). Now this function returns another function after taking only argument.
\begin{verbatim}
    (define rember-f
      (lambda (test?)
        (lambda (a l)
          (cond
            ((null? l) (quote ()))
            ((test? a (car l)) (cdr l))
            (else (cons (car l)
                        ((rember-f test?) a (cdr l))))))))
> ((rember-f eq?) 'tuna '(shrimp salad and tuna salad))
'(shrimp salad and salad)
> ((rember-f eq?) 'eq? '(equal? eq? eqan? eqlist? eqpair?))
'(equal? eqan? eqlist? eqpair?)

\end{verbatim}
\end{itemize}

\subsubsection{Passing Anonymous Functions as Arguments}
\label{sec:orgf209803}

\begin{itemize}
\item The insert left or right functions can also be partially curried. One question asked is what is the difference between these two. Its only the order of \texttt{cons} in
the second test that is all.
\begin{verbatim}
(define insertL-f
  (lambda (test?)
    (lambda (new old l)
      (cond
        ((null? l) (quote ()))
        ((test? (car l) old)
         (cons new (cons old (cdr l))))
        (else (cons (car l)
                    ((insertL-f test?) new old (cdr l))))))))

(define insertR-f
  (lambda (test?)
    (lambda (new old l)
      (cond
        ((null? l) (quote ()))
        ((test? (car l) old)
         (cons old (cons new (cdr l))))
        (else (cons (car l)
                    ((insertR-f test?) new old (cdr l))))))))

\end{verbatim}
\item The difference in the two can written separately as helper functions and then we can call a generic \texttt{insert-g} with these helper functions to get \texttt{insertL-f} or
\texttt{insertR-f}.
\begin{verbatim}
(define seqL
  (lambda (new old l)
    (cons new (cons old l))))

(define seqR
  (lambda (new old l)
    (cons old (cons new l))))

\end{verbatim}

\item Time to write the left or write agnostic function which will take \texttt{seqL} or \texttt{seqR}. Notice we remove the \texttt{test?} this is so because are sort of removing a degree of freedom.
We are abstracting out the part that varies to make functions more general and in this case we are 'okay' with \texttt{eq?}.
\begin{verbatim}
(define insert-g
  (lambda (seq)
    (lambda (new old l)
      (cond
        ((null? l) (quote ()))
        ((eq? (car l) old)
         (seq new old (cdr l)))
        (else (cons (car l)
                    ((insert-g seq) new old (cdr l))))))))

\end{verbatim}
\item Now we can define the left and right functions by passing helper functions appropriately. But do we need to pass \texttt{seqL} and \texttt{seqR} and why not something generic as \texttt{seq}?
\begin{verbatim}
(define insertL (insert-g seqL))
(define insertR (insert-g seqR))

\end{verbatim}
\item Now comes the idea of passing anonymous or lambdas as the programming world calls it to functions. In Prof Touretzky's book also we have come across this.
\begin{verbatim}
    (define insertL-anon
      (insert-g
       (lambda (new old l)
        (cons new (cons old l)))))

> (insertL-anon 'x 'a '(a b c d))
'(x a b c d)

\end{verbatim}
\item Similarly for the \texttt{subst} substitute function we could create another helper function.
\begin{verbatim}
(define seqS
  (lambda (new old l)
    (cons new l)))

(define subst-def2
  (insert-g seqS))

(define subst-anon
  (insert-g
   (lambda (new old l)
     (cons new l))))

\end{verbatim}
\end{itemize}
