schemer-notes.org
*** The Power of Functional Abstraction

+ Now we come across a really smart abstraction. The book builds the ~rember~ function using ~insert-g~ and a new helper function ~seqrem~. The catch is that the 'new' is simply ignored.
  The authors use ~#f~ in place of new and this is not for the lisp evaluator to look but we humans!
  #+begin_src scheme
	(define rember-helper
	  (lambda (a l)
	    ((insert-g seqrem) #f a l)))

	(define seqrem
	  (lambda (new old l)
	    l))
    
    > (rember-helper 'fries '(burger fries pizza chips))
    '(burger pizza chips)

  #+end_src
+ What we have just seen is the power of abstraction!
+ Another example is the erstwhile ~value~ function where again we have common ~cond~ lines in the function definition.
  #+begin_src scheme
    (define value-helper
      (lambda (nexp)
	(cond
	  ((atom? nexp) nexp)
	  ((eq? (operator nexp) (quote +))
	   (o+ (value-helper (1st-sub-exp nexp))
	       (value-helper (2nd-sub-exp nexp))))
	  ((eq? (operator nexp) (quote x))
	   (o* (value-helper (1st-sub-exp nexp))
	       (value-helper (2nd-sub-exp nexp))))
	  (else
	   (o^ (value-helper (1st-sub-exp nexp))
	       (value-helper (2nd-sub-exp nexp)))))))

  #+end_src
+ Here we can abstract away the common portions of the function by writing a helper function ~atom-to-function~.
  #+begin_src scheme
	(define atom-to-function
	  (lambda (x)
	    (cond
	      ((eq? x (quote +)) o+)
	      ((eq? x (quote x)) o*)
	      (else o^))))
    
    > (atom-to-function '+)
    #<procedure:o+>
    > ((atom-to-function '+) 5 3)
    8

  #+end_src

  Note that the ~1st-sub-exp~ and ~2nd-sub-exp~ are just names and need to be given definitions for these functions of ~value~ and its variants to run. The code shown in the book is to only
  illustrate abstraction and helper functions.
  
+ Here we should clarify some terms and reiterate them:
  - Accessor Functions are also called Helper Functions. These functions help access some part or element in a list.
  - Meta Functions are those functions which operate on functions themselves. Meta Functions take in functions and return functions.
  - We can have a combination of accessor functions in a meta function.

+ This chapter is taking us the readers through this cycle essentially:
  - Writing a `crude' or basic function which just gets the job done for instance the ~insertL~ function.
  - Then we go to a factored or parametrized version of the `crude' function now called `f' function such as ~insertL-f~.
  - From the factored version we go to a general version or the `g' version such as ~insert-g'.
  - And finally we will reach the evaluator example ~value-helper~ above.

+ We had written the ~multirember~ function earlier which was fairly easy.
  #+begin_src scheme
    (define multirember
      (lambda (a lat)
	(cond ((null? lat) (quote ()))
	      ((eq? (car lat) a) (multirember a (cdr lat)))
	      (else (cons (car lat) (multirember a (cdr lat)))))))

  #+end_src

+ Now the factorized version is below.
  #+begin_src scheme
	(define multirember-f
	  (lambda (test?)
	    (lambda (a lat)
	      (cond ((null? lat) (quote ()))
		    ((test? a (car lat))
		     ((multirember-f test?) a (cdr lat)))
		    (else (cons (car lat)
				((multirember-f test?) a (cdr lat))))))))

    > ((multirember-f eq?) 'samosa '(pakora samosa chaat jalebi samosa chutney))
    '(pakora chaat jalebi chutney)
    
  #+end_src

+ We can now make the test in ~multirember-f~ be only ~eq?~ by the following definition:
  #+begin_src scheme
	(define multirember-eq?
	  (multirember-f eq?))
    
    > (multirember-eq? 'tuna '(tuna fish is good for health but not fried tuna fish))
    '(fish is good for health but not fried fish)

  #+end_src

+ Next line of reasoning is that the ~multirember-f~ gos through the ~lat~ looking only for tuna and using ~eq?~ to test that. So we can probably merge this as one function.
  So let us write a generic function which uses ~eq?~ to test if it is tuna or not.
  #+begin_src scheme
	(define eq?-tuna
	  (eq?-c (quote tuna)))
    
    > (eq?-tuna 'fish)
    #f
    > (eq?-tuna 'tuna)
    #t

  #+end_src

+ Now we can write a function ~multiremberT~ which takes ~eq?-tuna~ as an input for the test and comparison to tuna and a list of atoms as the second argument. This
  makes our function compact and purposeful. Taking a step back ~multiremberT~ does the following:
  - Takes two arguments: one is a function and another is a list. We could perhaps curry this further and have just one argument (perhaps).
  - The functional argument is a combination of another function ~eq?-tuna~ which in turn calls ~eq?-c~ ()itself is a curried function) with the symbol tuna.
  - The basic recursion is fairly simple. If we see ~multiremberT~ takes a function calls another function which in turn calls another function. These are layers of abstractions
    for a higher order function.
  Let us write the function now.
  #+begin_src scheme
	(define multiremberT
	  (lambda (test? lat)
	    (cond ((null? lat) (quote ()))
		  ((test? (car lat))
		   (multiremberT test? (cdr lat)))
		  (else (cons (car lat)
			      (multiremberT test? (cdr lat)))))))
    
    > (multiremberT eq?-tuna '(shrimp salad tuna salad and tuna))
    '(shrimp salad salad and)

  #+end_src

*** Collector Functions or Continuations

+ This is the last commandment for the book and it gets fairly dense.
+ We write a function called ~multirember&co~. The book will now slowly step by step explain the definition of the function. But we will state it first and then work through it to
  understand what it really is doing.
  #+begin_src scheme
    (define multirember&co
      (lambda (a lat col)
	(cond ((null? lat) (col (quote ()) (quote ())))
	      ((eq? (car lat) a)
	       (multirember&co a (cdr lat)
			       (lambda (newlat seen)
				 (col newlat
				      (cons (car lat) seen)))))
	      (else
	       (multirember&co a (cdr lat)
			       (lambda (newlat seen)
				 (col (cons (car lat) newlat)
				      seen)))))))

  #+end_src

+ Another function is defined which will be used as the continuation or collectors as we progress. It is called right now ~a-friend~.
  #+begin_src scheme
    (define a-friend
      (lambda (x y)
	(null? y)))

  #+end_src

