schemer-notes.tex

\subsubsection{The Power of Functional Abstraction}
\label{sec:org7f39463}

\begin{itemize}
\item Now we come across a really smart abstraction. The book builds the \texttt{rember} function using \texttt{insert-g} and a new helper function \texttt{seqrem}. The catch is that the 'new' is simply ignored.
The authors use \texttt{\#f} in place of new and this is not for the lisp evaluator to look but we humans!
\begin{verbatim}
    (define rember-helper
      (lambda (a l)
        ((insert-g seqrem) #f a l)))

    (define seqrem
      (lambda (new old l)
        l))

> (rember-helper 'fries '(burger fries pizza chips))
'(burger pizza chips)

\end{verbatim}
\item What we have just seen is the power of abstraction!
\item Another example is the erstwhile \texttt{value} function where again we have common \texttt{cond} lines in the function definition.
\begin{verbatim}
(define value-helper
  (lambda (nexp)
    (cond
      ((atom? nexp) nexp)
      ((eq? (operator nexp) (quote +))
       (o+ (value-helper (1st-sub-exp nexp))
           (value-helper (2nd-sub-exp nexp))))
      ((eq? (operator nexp) (quote x))
       (o* (value-helper (1st-sub-exp nexp))
           (value-helper (2nd-sub-exp nexp))))
      (else
       (o^ (value-helper (1st-sub-exp nexp))
           (value-helper (2nd-sub-exp nexp)))))))

\end{verbatim}
\item Here we can abstract away the common portions of the function by writing a helper function \texttt{atom-to-function}.
\begin{verbatim}
    (define atom-to-function
      (lambda (x)
        (cond
          ((eq? x (quote +)) o+)
          ((eq? x (quote x)) o*)
          (else o^))))

> (atom-to-function '+)
#<procedure:o+>
> ((atom-to-function '+) 5 3)
8

\end{verbatim}

Note that the \texttt{1st-sub-exp} and \texttt{2nd-sub-exp} are just names and need to be given definitions for these functions of \texttt{value} and its variants to run. The code shown in the book is to only
illustrate abstraction and helper functions.

\item Here we should clarify some terms and reiterate them:
\begin{itemize}
\item Accessor Functions are also called Helper Functions. These functions help access some part or element in a list.
\item Meta Functions are those functions which operate on functions themselves. Meta Functions take in functions and return functions.
\item We can have a combination of accessor functions in a meta function.
\end{itemize}

\item This chapter is taking us the readers through this cycle essentially:
\begin{itemize}
\item Writing a `crude' or basic function which just gets the job done for instance the \texttt{insertL} function.
\item Then we go to a factored or parametrized version of the `crude' function now called `f' function such as \texttt{insertL-f}.
\item From the factored version we go to a general version or the `g' version such as \textasciitilde{}insert-g'.
\item And finally we will reach the evaluator example \texttt{value-helper} above.
\end{itemize}

\item We had written the \texttt{multirember} function earlier which was fairly easy.
\begin{verbatim}
(define multirember
  (lambda (a lat)
    (cond ((null? lat) (quote ()))
          ((eq? (car lat) a) (multirember a (cdr lat)))
          (else (cons (car lat) (multirember a (cdr lat)))))))

\end{verbatim}

\item Now the factorized version is below.
\begin{verbatim}
    (define multirember-f
      (lambda (test?)
        (lambda (a lat)
          (cond ((null? lat) (quote ()))
                ((test? a (car lat))
                 ((multirember-f test?) a (cdr lat)))
                (else (cons (car lat)
                            ((multirember-f test?) a (cdr lat))))))))

> ((multirember-f eq?) 'samosa '(pakora samosa chaat jalebi samosa chutney))
'(pakora chaat jalebi chutney)

\end{verbatim}

\item We can now make the test in \texttt{multirember-f} be only \texttt{eq?} by the following definition:
\begin{verbatim}
    (define multirember-eq?
      (multirember-f eq?))

> (multirember-eq? 'tuna '(tuna fish is good for health but not fried tuna fish))
'(fish is good for health but not fried fish)

\end{verbatim}

\item Next line of reasoning is that the \texttt{multirember-f} gos through the \texttt{lat} looking only for tuna and using \texttt{eq?} to test that. So we can probably merge this as one function.
So let us write a generic function which uses \texttt{eq?} to test if it is tuna or not.
\begin{verbatim}
    (define eq?-tuna
      (eq?-c (quote tuna)))

> (eq?-tuna 'fish)
#f
> (eq?-tuna 'tuna)
#t

\end{verbatim}

\item Now we can write a function \texttt{multiremberT} which takes \texttt{eq?-tuna} as an input for the test and comparison to tuna and a list of atoms as the second argument. This
makes our function compact and purposeful. Taking a step back \texttt{multiremberT} does the following:
\begin{itemize}
\item Takes two arguments: one is a function and another is a list. We could perhaps curry this further and have just one argument (perhaps).
\item The functional argument is a combination of another function \texttt{eq?-tuna} which in turn calls \texttt{eq?-c} ()itself is a curried function) with the symbol tuna.
\item The basic recursion is fairly simple. If we see \texttt{multiremberT} takes a function calls another function which in turn calls another function. These are layers of abstractions
for a higher order function.
\end{itemize}
Let us write the function now.
\begin{verbatim}
    (define multiremberT
      (lambda (test? lat)
        (cond ((null? lat) (quote ()))
              ((test? (car lat))
               (multiremberT test? (cdr lat)))
              (else (cons (car lat)
                          (multiremberT test? (cdr lat)))))))

> (multiremberT eq?-tuna '(shrimp salad tuna salad and tuna))
'(shrimp salad salad and)

\end{verbatim}
\end{itemize}

\subsubsection{Collector Functions or Continuations}
\label{sec:org7c1a579}

\begin{itemize}
\item This is the last commandment for the book and it gets fairly dense.
\item We write a function called \texttt{multirember\&co}. The book will now slowly step by step explain the definition of the function. But we will state it first and then work through it to
understand what it really is doing.
\begin{verbatim}
(define multirember&co
  (lambda (a lat col)
    (cond ((null? lat) (col (quote ()) (quote ())))
          ((eq? (car lat) a)
           (multirember&co a (cdr lat)
                           (lambda (newlat seen)
                             (col newlat
                                  (cons (car lat) seen)))))
          (else
           (multirember&co a (cdr lat)
                           (lambda (newlat seen)
                             (col (cons (car lat) newlat)
                                  seen)))))))

\end{verbatim}

\item Another function is defined which will be used as the continuation or collectors as we progress. It is called right now \texttt{a-friend}.
\begin{verbatim}
(define a-friend
  (lambda (x y)
    (null? y)))

\end{verbatim}
\end{itemize}
