schemer-notes.org
*** Continuation Passing Style

+ In this section we blow the lid off. Here we will learn a foundational concept for interpreters, compilers, lazy evaluation, backtracking etc.
+ Now let us get to work on ~multirember&co~ function with the null list ~()~ as ~lat~. We pass ~a~ as ~'tuna~, ~lat~ as ~()~ and the ~col~ that is the collector as ~a-friend~.
  Since the ~lat~ is empty it hits the first line of ~cond~ which is ~((null? lat) (col (quote ()) (quote ())))~. The collector takes the two ~quote()~ and since the second
  one is an empty list it returns a ~#t~. Thus this comibination of arguments when passed to ~multirember&co~ will return ~#t~.
  #+begin_src scheme
    (define multirember&co
      (lambda (a lat col)
	(cond ((null? lat) (col (quote ()) (quote ())))
	      ((eq? (car lat) a)
	       (multirember&co a (cdr lat)
			       (lambda (newlat seen)
				 (col newlat
				      (cons (car lat) seen)))))
	      (else
	       (multirember&co a (cdr lat)
			       (lambda (newlat seen)
				 (col (cons (car lat) newlat)
				      seen)))))))

    (define a-friend
      (lambda (x y)
	(null? y)))

  #+end_src

+ The question with the input of ~lat~ as ~(strawberries tuna and swordfish)~ should not even be attempted right now. After this section the answer will come in an instant. The authors perhaps
  should have simplified the whole section a little bit more.
+ When ~lat~ is ~(tuna)~ and the collector is ~a-friend~, we hit the second ~cond~ test. The recursive call to ~multirember&co~ is with ~('tuna '() col1)~. Here ~col1~ is the lambda function given as:
  #+begin_src scheme
    (lambda (newlat seen) (col newlat (cons (car lat) seen)))
    
  #+end_src
  
  But in ~col1~ the ~col~ refers to the original ~a-friend~. The book calls this ~col1~ as ~new-friend~.
  #+begin_src scheme
    (define new-friend
      (lambda (newlat seen)
	(a-friend newlat (cons (quote tuna) seen))))

  #+end_src

  When we recur on ~lat~ as ~()~ then the the first ~cond~ gets hit. Here the ~col~ is called the ~new-friend~. So we pass two blank lists to ~new-friend~. This in turn calls ~a-friend~ with a blank list and
  a ~(tuna)~. This returns ~#f~. In plain english what this whole mechanism is doing is "Remove all ~'tuna~ from ~(and tuna)~, and then ask: did we remove none? We did remove one, so the answer is ~#f~."
+ Now if we think of the first question where the lat is ~(strawberries tuna and swordfish)~ we know the answer will be ~#f~ but let us wait for the next example where ~lat~ is ~(and tuna)~.
+ Let us write down all the calls for ~(and tuna)~.
  
  /First Call/
  
  Arguments:
  
  ~a~ = ~'tuna~
  
  ~lat~ = ~'(and tuna)~
  
  ~col~ = ~a-friend~

  ~lat~ is not null, and ~(car lat)~ is ~'and~, which is not ~a~, so we go to the ~else~ branch:

  This collector is called ~latest-friend~ in the book.
  #+begin_src scheme
    (lambda (newlat seen) (a-friend (cons 'and newlat) seen))
    
  #+end_src

  /Second Call/
  
  Arguments:
  
  ~a~ = ~'tuna~
  
  ~lat~ = ~'(tuna)~
  
  ~col~ = ~latest-friend~

  ~lat~ is not null, and ~(car lat)~ is ~'tuna~,  so we go to the middle branch:

  This collector is our already described ~new-friend~ earlier but the ~col~ is actually the ~latest-friend~.
  #+begin_src scheme
    (lambda (newlat seen) (latest-friend newlat (cons 'tuna seen)))
    
  #+end_src

  /Third Call/
  
  Arguments:
  
  ~a~ = ~'tuna~
  
  ~lat~ = ~'()~
  
  ~col~ = ~new-friend~ from above where ~col~ is ~latest-friend~

  ~lat~ is null, we hit the first condition of the ~cond~:

  #+begin_src scheme
    (new-friend '() '())
    
  #+end_src

  /Unwinding Collectors/

  This is where we see the inte-relationships of the various collector functions.

  #+begin_src scheme
    (new-friend '() '())
    (latest-friend '() (cons 'tuna '()))
    (latest-friend '() '(tuna))
    (a-friend '(and) '(tuna))
    (null? '(tuna))
    > #f
    
  #+end_src
  We can see the book calls out the last step where they say the arguments to ~a-friend~ is ~'(and)~ and ~'(tuna)~ which is exactly what we got in out detailed flow above. What we notice is that
  the atoms which are not collected are in one list and the atoms which are collected are in the other list.
+ If we change the collector function to say return the length of the list where we have not collected then we will get the count of the list where the ~a~ is not present. The book gives this collector
  as an example.
  #+begin_src scheme
    (define last-friend
      (lambda (x y)
	(length x)))

  #+end_src

** Examples on Continuations

