schemer-notes.tex

\subsubsection{Continuation Passing Style}
\label{sec:org9d19bd3}

\begin{itemize}
\item In this section we blow the lid off. Here we will learn a foundational concept for interpreters, compilers, lazy evaluation, backtracking etc.
\item Now let us get to work on \texttt{multirember\&co} function with the null list \texttt{()} as \texttt{lat}. We pass \texttt{a} as \texttt{'tuna}, \texttt{lat} as \texttt{()} and the \texttt{col} that is the collector as \texttt{a-friend}.
Since the \texttt{lat} is empty it hits the first line of \texttt{cond} which is \texttt{((null? lat) (col (quote ()) (quote ())))}. The collector takes the two \texttt{quote()} and since the second
one is an empty list it returns a \texttt{\#t}. Thus this comibination of arguments when passed to \texttt{multirember\&co} will return \texttt{\#t}.
\begin{verbatim}
(define multirember&co
  (lambda (a lat col)
    (cond ((null? lat) (col (quote ()) (quote ())))
          ((eq? (car lat) a)
           (multirember&co a (cdr lat)
                           (lambda (newlat seen)
                             (col newlat
                                  (cons (car lat) seen)))))
          (else
           (multirember&co a (cdr lat)
                           (lambda (newlat seen)
                             (col (cons (car lat) newlat)
                                  seen)))))))

(define a-friend
  (lambda (x y)
    (null? y)))

\end{verbatim}

\item The question with the input of \texttt{lat} as \texttt{(strawberries tuna and swordfish)} should not even be attempted right now. After this section the answer will come in an instant. The authors perhaps
should have simplified the whole section a little bit more.
\item When \texttt{lat} is \texttt{(tuna)} and the collector is \texttt{a-friend}, we hit the second \texttt{cond} test. The recursive call to \texttt{multirember\&co} is with \texttt{('tuna '() col1)}. Here \texttt{col1} is the lambda function given as:
\begin{verbatim}
(lambda (newlat seen) (col newlat (cons (car lat) seen)))

\end{verbatim}

But in \texttt{col1} the \texttt{col} refers to the original \texttt{a-friend}. The book calls this \texttt{col1} as \texttt{new-friend}.
\begin{verbatim}
(define new-friend
  (lambda (newlat seen)
    (a-friend newlat (cons (quote tuna) seen))))

\end{verbatim}

When we recur on \texttt{lat} as \texttt{()} then the the first \texttt{cond} gets hit. Here the \texttt{col} is called the \texttt{new-friend}. So we pass two blank lists to \texttt{new-friend}. This in turn calls \texttt{a-friend} with a blank list and
a \texttt{(tuna)}. This returns \texttt{\#f}. In plain english what this whole mechanism is doing is "Remove all \texttt{'tuna} from \texttt{(and tuna)}, and then ask: did we remove none? We did remove one, so the answer is \texttt{\#f}."
\item Now if we think of the first question where the lat is \texttt{(strawberries tuna and swordfish)} we know the answer will be \texttt{\#f} but let us wait for the next example where \texttt{lat} is \texttt{(and tuna)}.
\item Let us write down all the calls for \texttt{(and tuna)}.

\emph{First Call}

Arguments:

\texttt{a} = \texttt{'tuna}

\texttt{lat} = \texttt{'(and tuna)}

\texttt{col} = \texttt{a-friend}

\texttt{lat} is not null, and \texttt{(car lat)} is \texttt{'and}, which is not \texttt{a}, so we go to the \texttt{else} branch:

This collector is called \texttt{latest-friend} in the book.
\begin{verbatim}
(lambda (newlat seen) (a-friend (cons 'and newlat) seen))

\end{verbatim}

\emph{Second Call}

Arguments:

\texttt{a} = \texttt{'tuna}

\texttt{lat} = \texttt{'(tuna)}

\texttt{col} = \texttt{latest-friend}

\texttt{lat} is not null, and \texttt{(car lat)} is \texttt{'tuna},  so we go to the middle branch:

This collector is our already described \texttt{new-friend} earlier but the \texttt{col} is actually the \texttt{latest-friend}.
\begin{verbatim}
(lambda (newlat seen) (latest-friend newlat (cons 'tuna seen)))

\end{verbatim}

\emph{Third Call}

Arguments:

\texttt{a} = \texttt{'tuna}

\texttt{lat} = \texttt{'()}

\texttt{col} = \texttt{new-friend} from above where \texttt{col} is \texttt{latest-friend}

\texttt{lat} is null, we hit the first condition of the \texttt{cond}:

\begin{verbatim}
(new-friend '() '())

\end{verbatim}

\emph{Unwinding Collectors}

This is where we see the inte-relationships of the various collector functions.

\begin{verbatim}
(new-friend '() '())
(latest-friend '() (cons 'tuna '()))
(latest-friend '() '(tuna))
(a-friend '(and) '(tuna))
(null? '(tuna))
> #f

\end{verbatim}
We can see the book calls out the last step where they say the arguments to \texttt{a-friend} is \texttt{'(and)} and \texttt{'(tuna)} which is exactly what we got in out detailed flow above. What we notice is that
the atoms which are not collected are in one list and the atoms which are collected are in the other list.
\item If we change the collector function to say return the length of the list where we have not collected then we will get the count of the list where the \texttt{a} is not present. The book gives this collector
as an example.
\begin{verbatim}
(define last-friend
  (lambda (x y)
    (length x)))

\end{verbatim}
\end{itemize}

\subsection{Examples on Continuations}
\label{sec:org098cf77}
