schemer-notes.org
*** Inserting and counting: ~multiinsertLR&co~
+ We revisit the functions ~multiinsertL~ and ~multiinsertR~ from chapter 3: Cons the magnificent.
+ We can combine the left and right functions as one below:
  #+begin_src scheme
    (define multiinsertLR
      (lambda (new oldL oldR lat)
	(cond
	  ((null? lat) (quote ()))
	  (eq? (car lat) oldL
	       (cons new
		     (cons oldL
			   (multiinsertLR new oldL oldR (cdr lat)))))
	  (eq? (car lat) oldR
	       (cons oldR
		     (cons new
			   (multiinsertLR new oldL oldR (cdr lat)))))
	  (else
	   (cons (car lat)
		 (multiinsertLR new oldL oldR (cdr lat)))))))

  #+end_src

+ Now we can write a ~multiinsertLR&co~ which will have a collector function. The collector will work on the new list of atoms and on the number of
  left and right insertions. The outline of the function looks something like this.
  #+begin_src scheme
    (define multiinsertLR&co
      (lambda (new oldL oldR lat col)
	(cond
	  ((null? lat) (col (quote ()) 0 0))
	  ((eq? (car lat) oldL)
	   (multiinsertLR&co new oldL oldR (cdr lat)
			     (lambda (newlat L R)
			       ...)))
	  ((eq? (car lat) oldR)
	   (multiinsertLR&co new oldL oldR (cdr lat)
			     (lambda (newlat L R)
			       ...)))
	  (else
	   (multiinsertLR&co new oldL oldR (cdr lat)
			     (lambda (newlat L R)
			       ...))))))


  #+end_src
+ The base collector in the ~(null? lat)~ test returns an empty list thus we return ~(quote ())~ and since there are no occurrences of ~oldL~ or ~oldR~
  the count remains 0 for both these.
+ The book now asks us exactly what I mention above that what happens in the case we pass an empty list as the ~lat~.
+ The ~else~ part of the ~cond~ gets triggered when ~(car lat)~ is neither equal to ~oldL~ or ~oldR~. The collector in the ~else~ part will take this ~newlat~ which
  is essentially produced by ~multiinsertLR&co~ on ~(cdr lat)~, ~oldL~, and ~oldR~. The second and third arguments are the left and right insertion counts.
+ This ~else~ collector will apply the collector function on a ~cons~ of ~(car lat)~ to ~newlat~ and that is ~(cons (car lat) newlat)~ and the other two arguments to collector
  will be ~L~ and ~R~ because we need to keep a count of the insertions.
+ The two collector in the ~cond~ for ~oldL~ and ~oldR~ will essentially be an appropriate ~cons~ of ~new~ to ~oldL~ or ~oldR~. In addition we will increment ~oldL~ or ~oldR~ appropriately.
  So finally we get ~multiinsertLR&co~ as below and also we write the collector function here.
  #+begin_src scheme
	(define multiinsertLR&co
	  (lambda (new oldL oldR lat col)
	    (cond
	      ((null? lat) (col (quote ()) 0 0))
	      ((eq? (car lat) oldL)
	       (multiinsertLR&co new oldL oldR (cdr lat)
				 (lambda (newlat L R)
				   (col (cons new
					      (cons oldL newlat))
					      (add1 L) R))))
	      ((eq? (car lat) oldR)
	       (multiinsertLR&co new oldL oldR (cdr lat)
				 (lambda (newlat L R)
				   (col (cons oldR
					      (cons new newlat))
					L (add1 R)))))
	      (else
	       (multiinsertLR&co new oldL oldR (cdr lat)
				 (lambda (newlat L R)
				   (col (cons (car lat) newlat) L R)))))))

	(define col
	  (lambda (newlat L R)
	    (cons newlat (cons L (cons R (quote ()))))))
        
    > (multiinsertLR&co 'salty 'fish 'chips
			'(chips and fish or fish and chips) col)
    '((chips salty and salty fish or salty fish and chips salty) 2 2)

  #+end_src

*** Multiple Number Operations: ~evens-only*&co~
+ We got back to the ~*~ functions in this example. ~*~ functions basically traverse entire nested lists.
+ Short term objective is to right a functions which removes all odd numbers from a nested list of numbers. First we can write a predicate which tests if a number is even or not.
  #+begin_src scheme
    (define even?
      (lambda (n)
	(cond
	  ((= (modulo n 2) 0) #t)
	  (else #f))))

    (define evens-only*
      (lambda (l)
	(cond
	  ((null? l) (quote ()))
	  ((atom? (car l))
	   (cond
	     ((even? (car l))
	      (cons (car l) (evens-only* (cdr l))))
	     (else (evens-only* (cdr l)))))
	  (else (cons (evens-only* (car l))
		      (evens-only* (cdr l)))))))

  #+end_src
+ Note that I have used a different way to test whether a number is even or not from that of in the book. We should also look at the ~trace~ of this ~evens-only*~ to refresh the stack flow of
  such a function.
  #+begin_src scheme
    > (evens-only* '((9 1 2 8) 3 10 ((9 9) 7 6) 2))
    >(evens-only* '((9 1 2 8) 3 10 ((9 9) 7 6) 2))
    > (evens-only* '(9 1 2 8))
    > (evens-only* '(1 2 8))
    > (evens-only* '(2 8))
    > >(evens-only* '(8))
    > > (evens-only* '())
    < < '()
    < <'(8)
    < '(2 8)
    > (evens-only* '(3 10 ((9 9) 7 6) 2))
    > (evens-only* '(10 ((9 9) 7 6) 2))
    > >(evens-only* '(((9 9) 7 6) 2))
    > > (evens-only* '((9 9) 7 6))
    > > >(evens-only* '(9 9))
    > > >(evens-only* '(9))
    > > >(evens-only* '())
    < < <'()
    > > >(evens-only* '(7 6))
    > > >(evens-only* '(6))
    > > > (evens-only* '())
    < < < '()
    < < <'(6)
    < < '(() 6)
    > > (evens-only* '(2))
    > > >(evens-only* '())
    < < <'()
    < < '(2)
    < <'((() 6) 2)
    < '(10 (() 6) 2)
    <'((2 8) 10 (() 6) 2)
    '((2 8) 10 (() 6) 2)

  #+end_src

+ We write the function ~evens-only*&co~ which removes the odd numbers from a nested list, multiplies all the even numbers and sums all the odd numbers which had been removed and gives this list
  as the answer.
  #+begin_src scheme
	(define evens-only*&co
	  (lambda (l col)
	    (cond
	      ((null? l) (col (quote ()) 1 0))
	      ((atom? (car l))
	       (cond
		 ((even? (car l))
		  (evens-only*&co (cdr l)
				  (lambda (newl p s)
				    (col (cons (car l) newl)
					      (* (car l) p) s))))
		 (else (evens-only*&co (cdr l)
				       (lambda (newl p s)
					 (col newl p
						   (+ (car l) s)))))))
	      (else (evens-only*&co
		     (car l) (lambda (al ap as)
			       (evens-only*&co
				(cdr l) (lambda (dl dp ds)
					  (col (cons al dl)
					       (* ap dp)
					       (+ as ds))))))))))

    > (evens-only*&co '((9 1 2 8) 3 10 ((9 9) 7 6) 2) col)
    '(((2 8) 10 (() 6) 2) 1920 38)
    
  #+end_src
  
+ The last collector function we write in this chapter is not coincidentally called ~the-last-friend~.
  #+begin_src scheme
    (define the-last-friend
      (lambda (newl product sum)
	(cons sum (cons product newl))))

  #+end_src
  When we pass this to ~evens-only*&co~ we get:
  #+begin_src scheme
    > (evens-only*&co '((9 1 2 8) 3 10 ((9 9) 7 6) 2) the-last-friend)
    '(38 1920 (2 8) 10 (() 6) 2)

  #+end_src

*Core Terms/Concepts Learnt*
+ Higher Order Functions
+ Meta Functions
+ Functions taking other functions as arguments
+ Functions returning functions
+ Collectors or Continuations
+ Helper Functions
+ Continuation Passing Style


#+LATEX: \newpage

* ... and Again, and Again, and Again, ...

The hardest chapter: Derive recursion without names using self-application. Build the conceptual machinery that leads to fixed point combinators and the Y combinator.

#+LATEX: \bigskip

Key Takeaway:

/Partial Functions vs Total Functions/

#+LATEX: \bigskip

/Deriving the Y Combinator/

#+LATEX: \bigskip

/Y Combinator/

#+LATEX: \vspace{1em}

