schemer-notes.tex

\subsubsection{Inserting and counting: \texttt{multiinsertLR\&co}}
\label{sec:orgfcbcc32}
\begin{itemize}
\item We revisit the functions \texttt{multiinsertL} and \texttt{multiinsertR} from chapter 3: Cons the magnificent.
\item We can combine the left and right functions as one below:
\begin{verbatim}
(define multiinsertLR
  (lambda (new oldL oldR lat)
    (cond
      ((null? lat) (quote ()))
      (eq? (car lat) oldL
           (cons new
                 (cons oldL
                       (multiinsertLR new oldL oldR (cdr lat)))))
      (eq? (car lat) oldR
           (cons oldR
                 (cons new
                       (multiinsertLR new oldL oldR (cdr lat)))))
      (else
       (cons (car lat)
             (multiinsertLR new oldL oldR (cdr lat)))))))

\end{verbatim}

\item Now we can write a \texttt{multiinsertLR\&co} which will have a collector function. The collector will work on the new list of atoms and on the number of
left and right insertions. The outline of the function looks something like this.
\begin{verbatim}
(define multiinsertLR&co
  (lambda (new oldL oldR lat col)
    (cond
      ((null? lat) (col (quote ()) 0 0))
      ((eq? (car lat) oldL)
       (multiinsertLR&co new oldL oldR (cdr lat)
                         (lambda (newlat L R)
                           ...)))
      ((eq? (car lat) oldR)
       (multiinsertLR&co new oldL oldR (cdr lat)
                         (lambda (newlat L R)
                           ...)))
      (else
       (multiinsertLR&co new oldL oldR (cdr lat)
                         (lambda (newlat L R)
                           ...))))))


\end{verbatim}
\item The base collector in the \texttt{(null? lat)} test returns an empty list thus we return \texttt{(quote ())} and since there are no occurrences of \texttt{oldL} or \texttt{oldR}
the count remains 0 for both these.
\item The book now asks us exactly what I mention above that what happens in the case we pass an empty list as the \texttt{lat}.
\item The \texttt{else} part of the \texttt{cond} gets triggered when \texttt{(car lat)} is neither equal to \texttt{oldL} or \texttt{oldR}. The collector in the \texttt{else} part will take this \texttt{newlat} which
is essentially produced by \texttt{multiinsertLR\&co} on \texttt{(cdr lat)}, \texttt{oldL}, and \texttt{oldR}. The second and third arguments are the left and right insertion counts.
\item This \texttt{else} collector will apply the collector function on a \texttt{cons} of \texttt{(car lat)} to \texttt{newlat} and that is \texttt{(cons (car lat) newlat)} and the other two arguments to collector
will be \texttt{L} and \texttt{R} because we need to keep a count of the insertions.
\item The two collector in the \texttt{cond} for \texttt{oldL} and \texttt{oldR} will essentially be an appropriate \texttt{cons} of \texttt{new} to \texttt{oldL} or \texttt{oldR}. In addition we will increment \texttt{oldL} or \texttt{oldR} appropriately.
So finally we get \texttt{multiinsertLR\&co} as below and also we write the collector function here.
\begin{verbatim}
    (define multiinsertLR&co
      (lambda (new oldL oldR lat col)
        (cond
          ((null? lat) (col (quote ()) 0 0))
          ((eq? (car lat) oldL)
           (multiinsertLR&co new oldL oldR (cdr lat)
                             (lambda (newlat L R)
                               (col (cons new
                                          (cons oldL newlat))
                                          (add1 L) R))))
          ((eq? (car lat) oldR)
           (multiinsertLR&co new oldL oldR (cdr lat)
                             (lambda (newlat L R)
                               (col (cons oldR
                                          (cons new newlat))
                                    L (add1 R)))))
          (else
           (multiinsertLR&co new oldL oldR (cdr lat)
                             (lambda (newlat L R)
                               (col (cons (car lat) newlat) L R)))))))

    (define col
      (lambda (newlat L R)
        (cons newlat (cons L (cons R (quote ()))))))

> (multiinsertLR&co 'salty 'fish 'chips
                    '(chips and fish or fish and chips) col)
'((chips salty and salty fish or salty fish and chips salty) 2 2)

\end{verbatim}
\end{itemize}

\subsubsection{Multiple Number Operations: \texttt{evens-only*\&co}}
\label{sec:org11389ee}
\begin{itemize}
\item We got back to the \texttt{*} functions in this example. \texttt{*} functions basically traverse entire nested lists.
\item Short term objective is to right a functions which removes all odd numbers from a nested list of numbers. First we can write a predicate which tests if a number is even or not.
\begin{verbatim}
(define even?
  (lambda (n)
    (cond
      ((= (modulo n 2) 0) #t)
      (else #f))))

(define evens-only*
  (lambda (l)
    (cond
      ((null? l) (quote ()))
      ((atom? (car l))
       (cond
         ((even? (car l))
          (cons (car l) (evens-only* (cdr l))))
         (else (evens-only* (cdr l)))))
      (else (cons (evens-only* (car l))
                  (evens-only* (cdr l)))))))

\end{verbatim}
\item Note that I have used a different way to test whether a number is even or not from that of in the book. We should also look at the \texttt{trace} of this \texttt{evens-only*} to refresh the stack flow of
such a function.
\begin{verbatim}
> (evens-only* '((9 1 2 8) 3 10 ((9 9) 7 6) 2))
>(evens-only* '((9 1 2 8) 3 10 ((9 9) 7 6) 2))
> (evens-only* '(9 1 2 8))
> (evens-only* '(1 2 8))
> (evens-only* '(2 8))
> >(evens-only* '(8))
> > (evens-only* '())
< < '()
< <'(8)
< '(2 8)
> (evens-only* '(3 10 ((9 9) 7 6) 2))
> (evens-only* '(10 ((9 9) 7 6) 2))
> >(evens-only* '(((9 9) 7 6) 2))
> > (evens-only* '((9 9) 7 6))
> > >(evens-only* '(9 9))
> > >(evens-only* '(9))
> > >(evens-only* '())
< < <'()
> > >(evens-only* '(7 6))
> > >(evens-only* '(6))
> > > (evens-only* '())
< < < '()
< < <'(6)
< < '(() 6)
> > (evens-only* '(2))
> > >(evens-only* '())
< < <'()
< < '(2)
< <'((() 6) 2)
< '(10 (() 6) 2)
<'((2 8) 10 (() 6) 2)
'((2 8) 10 (() 6) 2)

\end{verbatim}

\item We write the function \texttt{evens-only*\&co} which removes the odd numbers from a nested list, multiplies all the even numbers and sums all the odd numbers which had been removed and gives this list
as the answer.
\begin{verbatim}
    (define evens-only*&co
      (lambda (l col)
        (cond
          ((null? l) (col (quote ()) 1 0))
          ((atom? (car l))
           (cond
             ((even? (car l))
              (evens-only*&co (cdr l)
                              (lambda (newl p s)
                                (col (cons (car l) newl)
                                          (* (car l) p) s))))
             (else (evens-only*&co (cdr l)
                                   (lambda (newl p s)
                                     (col newl p
                                               (+ (car l) s)))))))
          (else (evens-only*&co
                 (car l) (lambda (al ap as)
                           (evens-only*&co
                            (cdr l) (lambda (dl dp ds)
                                      (col (cons al dl)
                                           (* ap dp)
                                           (+ as ds))))))))))

> (evens-only*&co '((9 1 2 8) 3 10 ((9 9) 7 6) 2) col)
'(((2 8) 10 (() 6) 2) 1920 38)

\end{verbatim}

\item The last collector function we write in this chapter is not coincidentally called \texttt{the-last-friend}.
\begin{verbatim}
(define the-last-friend
  (lambda (newl product sum)
    (cons sum (cons product newl))))

\end{verbatim}
When we pass this to \texttt{evens-only*\&co} we get:
\begin{verbatim}
> (evens-only*&co '((9 1 2 8) 3 10 ((9 9) 7 6) 2) the-last-friend)
'(38 1920 (2 8) 10 (() 6) 2)

\end{verbatim}
\end{itemize}

\textbf{Core Terms/Concepts Learnt}
\begin{itemize}
\item Higher Order Functions
\item Meta Functions
\item Functions taking other functions as arguments
\item Functions returning functions
\item Collectors or Continuations
\item Helper Functions
\item Continuation Passing Style
\end{itemize}


\newpage

\section{\ldots{} and Again, and Again, and Again, \ldots{}}
\label{sec:org15f75df}

The hardest chapter: Derive recursion without names using self-application. Build the conceptual machinery that leads to fixed point combinators and the Y combinator.

\bigskip

Key Takeaway:

\emph{Partial Functions vs Total Functions}

\bigskip

\emph{Deriving the Y Combinator}

\bigskip

\emph{Y Combinator}

\vspace{1em}
