schemer-notes.org
** Partial Functions
+ With a series of examples we are led to the concept of partial functions. Initially the reader will be stumped to find that their elementary logic be defied but on reading what
  the function ~looking~ and ~keep-looking~ do then things fall into place easily. In this ~lat~ which is the argument to ~looking~ the numbers determine where we eventually land up
  after multiple recursions and at times we will not reach the desired destination conclusively hence the function will return ~#f~ while at other times it could skip certain elements
  in ~lat~ forever. When the recursion skips certain element(s) then it is said to be a partial function. This is a very crude definition from what we observe from the initial examples.
+ The functions can be written as following. Note the argument ~sorn~ stands for symbol or number.
  #+begin_src scheme
    (define looking
      (lambda (a lat)
	(keep-looking a (pick 1 lat) lat)))

    (define keep-looking
      (lambda (a sorn lat)
	(cond ((number? sorn)
	       (keep-looking a (pick sorn lat) lat))
	      (else (eq? sorn a)))))

  #+end_src
  
+ The unusual thing about the function ~keep-looking~ is that it does not recur on a part of the list and the book calls it `unnatural' recursion.
+ So depending on how the ~lat~ argument to ~keep-looking~ is the result returned could be anything. Sometimes (as above) it would skip certain elements forever, at times the recursion
  will never stop (when a tuple of numbers is provided as ~lat~). Example of an endless loops can be ~(7 2 4 7 5 6 3)~ and ~(7 1 2 caviar 5 6 3)~.
+ Now the book calls ~keep-looking~ a partial function.
+ An example of infinite recursion or as the book calls it the `most partial' function.
  #+begin_src scheme
    (define eternity
      (lambda (x)
	(eternity x)))

  #+end_src
+ Now we come to the function ~shift~. This function takes a pair in which the first element is itself a pair. It then takes the second of the first pair and builds a new pair with this
  second as the first and the second pair as the second element of the second new pair. Function definition ans examples below.
  #+begin_src scheme
	(define shift
	  (lambda (pair)
	    (build (first (first pair))
		   (build (second (first pair))
			  (second pair)))))
    > (shift '((a b) c))
    '(a (b c))
    > (shift '((a b) (c d)))
    '(a (b (c d)))
    
  #+end_src
+ The next function ~align~ is tricky. It takes an argument called ~pora~ which is a pair or an atom. It aims to normalize a nested pair into a right associated form where the left branch is always atomic.
  It converts ~pora~ to a form like this ~(atom.fully aligned tail)~.
  #+begin_src scheme
    (define align
      (lambda (pora)
	(cond ((atom? pora) pora)
	      ((a-pair? (first pora))
	       (align (shift pora)))
	      (else (build (first pora)
			   (align (second pora)))))))

  #+end_src
+ We want to now count the number of elements in ~pora~. This is done by the function ~length*~ (~*~ because it will traverse the entire nested list).
  #+begin_src scheme
    (define length*
      (lambda (pora)
	(cond ((atom? pora) 1)
	      (else
	       (+ (length* (first pora))
		  (length* (second pora)))))))


  #+end_src
+ The ~length*~ function gives equal weight to all atoms to the arguments of ~pora~ and does not consider the complexity of the structure of ~pora~. To correct this we write
  a new function called ~weight*~.
  #+begin_src scheme
    (define weight*
      (lambda (pora)
	(cond ((atom? pora) 1)
	      (else
	       (+ (* (weight* (first pora)) 2)
		  (weight* (second pora)))))))

  #+end_src
+ The example given is important and we can work it out by hand. We notice the weights of the arguments get simpler once aligned.

  Before aligning:
  #+begin_src
    ((a b) c)

    = first: (a b)
      second: c

      (weight* (a b)) = (+ (*1 2) 1) = 3
      (weight* c)     = 1

    Total = 3*2 + 1 = 7

  #+end_src

  After aligning:
  #+begin_src
    (a (b c))

    = first: a
      second: (b c)

      (weight* a)     = 1
      (weight* (b c)) = (+ (*1 2) 1) = 3

    Total = 1*2 + 3 = 5

  #+end_src

+ ~align~ is not a partial function because it yields a value for every argument.
+ We write ~shuffle~ which is also a partial function. What this function does it make the first element of the ~pora~ an atom and pushes the complex parts to the second element. Why
  it is partial is because if the argument is ~((a b) (c d))~ this function will go on till eternity.
  #+begin_src scheme
	(define shuffle
	  (lambda (pora)
	    (cond
	      ((atom? pora) pora)
	      ((a-pair? (first pora))
	       (shuffle (revpair pora)))
	      (else (build (first pora)
			   (shuffle (second pora)))))))

    > (shuffle '(a (b c)))
    '(a (b c))
    > (shuffle '((a b) (c)))
    '((c) (a b))
    > (shuffle '((a b) c))
    '(c (a b))
    > (shuffle '((a b) (c d)))
    . . user break
    
  #+end_src

** Recursive nature of functions

+ Next is the famous Collatz Conjecture which is defined as the function ~C~ in the book. Collatz rule is simple where we start from any positive integer and do repeated procedure basis the rule:
  if even divide by 2 and if odd then multiply by 3 and add 1. No matter what the sequence terminates in 1. This has not been proven yet rigorously in mathematics since 1937.
  Paul Erdős said about the Collatz conjecture that /Mathematics may not be ready for such problems/. Why the book shows this example is because the computation of ~C~ is not narrowing down to a number.
  The values of interim ~C~ jump around. I have added a few examples.
  #+begin_src scheme
	(define C
	  (lambda (n)
	    (cond
	      ((one? n) 1)
	      (else
	       (cond
		 ((even? n) (C (/ n 2)))
		 (else (C (add1 (* 3 n)))))))))

    > (C 2)
    >(C 2)
    >(C 1)
    <1
    1

    > (C 3)
    >(C 3)
    >(C 10)
    >(C 5)
    >(C 16)
    >(C 8)
    >(C 4)
    >(C 2)
    >(C 1)
    <1
    1
    
    > (C 11)
    >(C 11)
    >(C 34)
    >(C 17)
    >(C 52)
    >(C 26)
    >(C 13)
    >(C 40)
    >(C 20)
    >(C 10)
    >(C 5)
    >(C 16)
    >(C 8)
    >(C 4)
    >(C 2)
    >(C 1)
    <1
    1
    >

  #+end_src
+ The next is the Ackermann function. The book uses the common version of this called the Ackermann–Péter function. Ackermann function is a total function but is not primitive recursive.
  This means a computer program cannot compute it always generally speaking. Let us write the function and give it few seed arguments.
  #+begin_src scheme
	(define A
	  (lambda (n m)
	    (cond
	      ((zero? n) (add1 m))
	      ((zero? m) (A (sub1 n) 1))
	      (else (A (sub1 n) (A n (sub1 m)))))))
    > (A 1 1)
    >(A 1 1)
    > (A 1 0)
    > (A 0 1)
    < 2
    >(A 0 2)
    <3
    3
    
    > (A 2 1)
    >(A 2 1)
    > (A 2 0)
    > (A 1 1)
    > >(A 1 0)
    > >(A 0 1)
    < <2
    > (A 0 2)
    < 3
    >(A 1 3)
    > (A 1 2)
    > >(A 1 1)
    > > (A 1 0)
    > > (A 0 1)
    < < 2
    > >(A 0 2)
    < <3
    > (A 0 3)
    < 4
    >(A 0 4)
    <5
    5

  #+end_src
  Now if we pass the argument (4 3) my machine will go on endlessly probably till the end of time.

** Turing Halting Problem

+ The next endeavor is to write a function which will tell us if a function is a total or a partial function. The book is slowly leading us into the true definition of recursion and functions
  in computer science. This is the Turing Halting Problem. Some functions can be described but not defined. No function in Scheme (or any programming language) can determine in general whether another function halts.
  This is not possible in Mathematics. There is no general procedure that can always tell whether a computation will halt. This is the cornerstone of computability theory, limits of programming languages
  limits of mathematics, Gödel incompleteness, and Turing machines.

