schemer-notes.tex

\subsection{Partial Functions}
\label{sec:org607ff12}
\begin{itemize}
\item With a series of examples we are led to the concept of partial functions. Initially the reader will be stumped to find that their elementary logic be defied but on reading what
the function \texttt{looking} and \texttt{keep-looking} do then things fall into place easily. In this \texttt{lat} which is the argument to \texttt{looking} the numbers determine where we eventually land up
after multiple recursions and at times we will not reach the desired destination conclusively hence the function will return \texttt{\#f} while at other times it could skip certain elements
in \texttt{lat} forever. When the recursion skips certain element(s) then it is said to be a partial function. This is a very crude definition from what we observe from the initial examples.
\item The functions can be written as following. Note the argument \texttt{sorn} stands for symbol or number.
\begin{verbatim}
(define looking
  (lambda (a lat)
    (keep-looking a (pick 1 lat) lat)))

(define keep-looking
  (lambda (a sorn lat)
    (cond ((number? sorn)
           (keep-looking a (pick sorn lat) lat))
          (else (eq? sorn a)))))

\end{verbatim}

\item The unusual thing about the function \texttt{keep-looking} is that it does not recur on a part of the list and the book calls it `unnatural' recursion.
\item So depending on how the \texttt{lat} argument to \texttt{keep-looking} is the result returned could be anything. Sometimes (as above) it would skip certain elements forever, at times the recursion
will never stop (when a tuple of numbers is provided as \texttt{lat}). Example of an endless loops can be \texttt{(7 2 4 7 5 6 3)} and \texttt{(7 1 2 caviar 5 6 3)}.
\item Now the book calls \texttt{keep-looking} a partial function.
\item An example of infinite recursion or as the book calls it the `most partial' function.
\begin{verbatim}
(define eternity
  (lambda (x)
    (eternity x)))

\end{verbatim}
\item Now we come to the function \texttt{shift}. This function takes a pair in which the first element is itself a pair. It then takes the second of the first pair and builds a new pair with this
second as the first and the second pair as the second element of the second new pair. Function definition ans examples below.
\begin{verbatim}
    (define shift
      (lambda (pair)
        (build (first (first pair))
               (build (second (first pair))
                      (second pair)))))
> (shift '((a b) c))
'(a (b c))
> (shift '((a b) (c d)))
'(a (b (c d)))

\end{verbatim}
\item The next function \texttt{align} is tricky. It takes an argument called \texttt{pora} which is a pair or an atom. It aims to normalize a nested pair into a right associated form where the left branch is always atomic.
It converts \texttt{pora} to a form like this \texttt{(atom.fully aligned tail)}.
\begin{verbatim}
(define align
  (lambda (pora)
    (cond ((atom? pora) pora)
          ((a-pair? (first pora))
           (align (shift pora)))
          (else (build (first pora)
                       (align (second pora)))))))

\end{verbatim}
\item We want to now count the number of elements in \texttt{pora}. This is done by the function \texttt{length*} (\texttt{*} because it will traverse the entire nested list).
\begin{verbatim}
(define length*
  (lambda (pora)
    (cond ((atom? pora) 1)
          (else
           (+ (length* (first pora))
              (length* (second pora)))))))


\end{verbatim}
\item The \texttt{length*} function gives equal weight to all atoms to the arguments of \texttt{pora} and does not consider the complexity of the structure of \texttt{pora}. To correct this we write
a new function called \texttt{weight*}.
\begin{verbatim}
(define weight*
  (lambda (pora)
    (cond ((atom? pora) 1)
          (else
           (+ (* (weight* (first pora)) 2)
              (weight* (second pora)))))))

\end{verbatim}
\item The example given is important and we can work it out by hand. We notice the weights of the arguments get simpler once aligned.

Before aligning:
\begin{verbatim}
((a b) c)

= first: (a b)
  second: c

  (weight* (a b)) = (+ (*1 2) 1) = 3
  (weight* c)     = 1

Total = 3*2 + 1 = 7

\end{verbatim}

After aligning:
\begin{verbatim}
(a (b c))

= first: a
  second: (b c)

  (weight* a)     = 1
  (weight* (b c)) = (+ (*1 2) 1) = 3

Total = 1*2 + 3 = 5

\end{verbatim}

\item \texttt{align} is not a partial function because it yields a value for every argument.
\item We write \texttt{shuffle} which is also a partial function. What this function does it make the first element of the \texttt{pora} an atom and pushes the complex parts to the second element. Why
it is partial is because if the argument is \texttt{((a b) (c d))} this function will go on till eternity.
\begin{verbatim}
    (define shuffle
      (lambda (pora)
        (cond
          ((atom? pora) pora)
          ((a-pair? (first pora))
           (shuffle (revpair pora)))
          (else (build (first pora)
                       (shuffle (second pora)))))))

> (shuffle '(a (b c)))
'(a (b c))
> (shuffle '((a b) (c)))
'((c) (a b))
> (shuffle '((a b) c))
'(c (a b))
> (shuffle '((a b) (c d)))
. . user break

\end{verbatim}
\end{itemize}

\subsection{Recursive nature of functions}
\label{sec:org9eb780b}

\begin{itemize}
\item Next is the famous Collatz Conjecture which is defined as the function \texttt{C} in the book. Collatz rule is simple where we start from any positive integer and do repeated procedure basis the rule:
if even divide by 2 and if odd then multiply by 3 and add 1. No matter what the sequence terminates in 1. This has not been proven yet rigorously in mathematics since 1937.
Paul Erdős said about the Collatz conjecture that \emph{Mathematics may not be ready for such problems}. Why the book shows this example is because the computation of \texttt{C} is not narrowing down to a number.
The values of interim \texttt{C} jump around. I have added a few examples.
\begin{verbatim}
    (define C
      (lambda (n)
        (cond
          ((one? n) 1)
          (else
           (cond
             ((even? n) (C (/ n 2)))
             (else (C (add1 (* 3 n)))))))))

> (C 2)
>(C 2)
>(C 1)
<1
1

> (C 3)
>(C 3)
>(C 10)
>(C 5)
>(C 16)
>(C 8)
>(C 4)
>(C 2)
>(C 1)
<1
1

> (C 11)
>(C 11)
>(C 34)
>(C 17)
>(C 52)
>(C 26)
>(C 13)
>(C 40)
>(C 20)
>(C 10)
>(C 5)
>(C 16)
>(C 8)
>(C 4)
>(C 2)
>(C 1)
<1
1
>

\end{verbatim}
\item The next is the Ackermann function. The book uses the common version of this called the Ackermann–Péter function. Ackermann function is a total function but is not primitive recursive.
This means a computer program cannot compute it always generally speaking. Let us write the function and give it few seed arguments.
\begin{verbatim}
    (define A
      (lambda (n m)
        (cond
          ((zero? n) (add1 m))
          ((zero? m) (A (sub1 n) 1))
          (else (A (sub1 n) (A n (sub1 m)))))))
> (A 1 1)
>(A 1 1)
> (A 1 0)
> (A 0 1)
< 2
>(A 0 2)
<3
3

> (A 2 1)
>(A 2 1)
> (A 2 0)
> (A 1 1)
> >(A 1 0)
> >(A 0 1)
< <2
> (A 0 2)
< 3
>(A 1 3)
> (A 1 2)
> >(A 1 1)
> > (A 1 0)
> > (A 0 1)
< < 2
> >(A 0 2)
< <3
> (A 0 3)
< 4
>(A 0 4)
<5
5

\end{verbatim}
Now if we pass the argument (4 3) my machine will go on endlessly probably till the end of time.
\end{itemize}

\subsection{Turing Halting Problem}
\label{sec:org775d5ca}

\begin{itemize}
\item The next endeavor is to write a function which will tell us if a function is a total or a partial function. The book is slowly leading us into the true definition of recursion and functions
in computer science. This is the Turing Halting Problem. Some functions can be described but not defined. No function in Scheme (or any programming language) can determine in general whether another function halts.
This is not possible in Mathematics. There is no general procedure that can always tell whether a computation will halt. This is the cornerstone of computability theory, limits of programming languages
limits of mathematics, Gödel incompleteness, and Turing machines.
\end{itemize}
