schemer-notes.org
** What is Recursion? What is a Function?

+ ~will-stop?~ is a function to show the Turing Halting problem cannot be `defined' in our programming language or for that matter any programming language. This is the last leg of this chapter.
+ We revisit the function ~length~ which counts the number of S-expressions in a list. It was in the chapter `Number Games'.
  #+begin_src scheme
    (define length
      (lambda (lat)
	(cond ((null? lat) 0)
	      (else (add1 (length (cdr lat)))))))


  #+end_src
+ The last line of ~length~ refers to itself so if we do not ~define~ ~length~ then how would we refer back to it in the recursive call?

*** Closures and Lexical Scoping
+ The first time we have a ~lambda~ expression without defining it. Dr. Racket will see the ~lambda~ expression, evaluate it and then return a procedure value which is a closure. So the value
  of a ~lambda~ expression is a procedure. Now what is a closure? A closure is a function in its lexical scoped environment. A closure is a pair of ~(code environment)~. We can use an example here
  to differentiate between lexical scoping and dynamic scoping.
  #+begin_src scheme
    (let ((x 5))
      (lambda (y) (+ x y)))

  #+end_src
  
  In this the ~lambda~ expression remembers the value ~x = 5~ even after it has left the ~let~.
  In lexical scoping a variable’s meaning is determined by where it appears in the source code. In dynamic scoping a variable’s meaning is determined by which function called which function at runtime.
  #+begin_src scheme
    (define x 10)

    (define (f)
      x)

    (define (g)
      (let ((x 20))
	(f)))

  #+end_src
  Under lexical scoping what does ~(g)~ see the value of ~x~? ~g~ calls ~f~ and ~f~ in turn sees that ~x = 10~. Thus it is checking the environment to get the value of ~x~.
  But under dynamic scoping ~(g)~ will check the value of ~x~ on the call stack. And the value of ~x~ on call stack has changed from 10 to 20. So in this case ~x = 20~.

