schemer-notes.tex

\subsection{What is Recursion? What is a Function?}
\label{sec:orge73855e}

\begin{itemize}
\item \texttt{will-stop?} is a function to show the Turing Halting problem cannot be `defined' in our programming language or for that matter any programming language. This is the last leg of this chapter.
\item We revisit the function \texttt{length} which counts the number of S-expressions in a list. It was in the chapter `Number Games'.
\begin{verbatim}
(define length
  (lambda (lat)
    (cond ((null? lat) 0)
          (else (add1 (length (cdr lat)))))))


\end{verbatim}
\item The last line of \texttt{length} refers to itself so if we do not \texttt{define} \texttt{length} then how would we refer back to it in the recursive call?
\end{itemize}

\subsubsection{Closures and Lexical Scoping}
\label{sec:org7165019}
\begin{itemize}
\item The first time we have a \texttt{lambda} expression without defining it. Dr. Racket will see the \texttt{lambda} expression, evaluate it and then return a procedure value which is a closure. So the value
of a \texttt{lambda} expression is a procedure. Now what is a closure? A closure is a function in its lexical scoped environment. A closure is a pair of \texttt{(code environment)}. We can use an example here
to differentiate between lexical scoping and dynamic scoping.
\begin{verbatim}
(let ((x 5))
  (lambda (y) (+ x y)))

\end{verbatim}

In this the \texttt{lambda} expression remembers the value \texttt{x = 5} even after it has left the \texttt{let}.
In lexical scoping a variable’s meaning is determined by where it appears in the source code. In dynamic scoping a variable’s meaning is determined by which function called which function at runtime.
\begin{verbatim}
(define x 10)

(define (f)
  x)

(define (g)
  (let ((x 20))
    (f)))

\end{verbatim}
Under lexical scoping what does \texttt{(g)} see the value of \texttt{x}? \texttt{g} calls \texttt{f} and \texttt{f} in turn sees that \texttt{x = 10}. Thus it is checking the environment to get the value of \texttt{x}.
But under dynamic scoping \texttt{(g)} will check the value of \texttt{x} on the call stack. And the value of \texttt{x} on call stack has changed from 10 to 20. So in this case \texttt{x = 20}.
\end{itemize}
