schemer-notes.org
*** The Y Combinator Derivation

+ Back to the first ~lambda~ expression. Here it is.
  #+begin_src scheme
	(lambda (l)
	  (cond
	    ((null? l) 0)
	    (else (add1 (eternity (cdr l))))))
    
    #<procedure:...chemer-workbook.rkt:907:0>

  #+end_src
+ If we call this for an empty list all is good we get ~0~ as return. But when we call it for any other list the ~eternity~ call will go on for eternity! It keeps calling it itself with ~'()~.
  #+begin_src scheme
    #<procedure:...chemer-workbook.rkt:906:0>
    #<procedure:...chemer-workbook.rkt:912:3>
    > ((lambda (l)
      (cond
	((null? l) 0)
	(else (add1 (eternity (cdr l)))))) '())
    0
    > ((lambda (l)
      (cond
	((null? l) 0)
	(else (add1 (eternity (cdr l)))))) '(a))
    . . user break

  #+end_src

+ We can call the ~eternity~ as ~length-0~ because it returns ~0~ for an empty list. Thus we can rewrite it as below. 
  #+begin_src scheme
    (lambda (l)
      (cond
	((null? l) 0)
	(else (add1 (length-0 (cdr l))))))

  #+end_src
+ Now for ~length-1~ up to one we can nest the two lambdas. Since we cannot use ~define~ to put in the function we place the ~lambda~ object itself. In fact we can keep adding for measuring
  length of longer lists.
  #+begin_src scheme
    (lambda (l)
      (cond
	((null? l) 0)
	(else
	 (add1
	  ((lambda (l)
	     (cond
	       ((null? l) 0)
	       (else (add1
		      (eternity (cdr l))))))
	  (cdr l))))))


  #+end_src
  The same nesting can be done for ~length-2~ showing an application on a 2 element list below.
  #+begin_src scheme
    > ((lambda (l)
      (cond
	((null? l) 0)
	(else
	 (add1
	  ((lambda (l)
	     (cond
	       ((null? l) 0)
	       (else (add1
		      ((lambda (l)
			 (cond
			   ((null? l) 0)
			   (else
			    (add1
			     (eternity
			      (cdr l))))))
		       (cdr l))))))
	   (cdr l)))))) '(a b))
    2

  #+end_src

+ For ~length-2~ we can add more nesting (as above). I would not pass the function for multiple examples. One thing to note is that the scope of the parameters is local and we see the term ~length~ being used across. I think
  this is done deliberately by the authors to drive this point home.
+ The playful but insightful question to ask is `What is recursion?' now.
+ If we could go on and on and keep nesting ~lambdas~ up to infinity with ~length-infinity~ being the last one perhaps then we would have derived the function for ~length~. But it is not possible
  to write an infinite function. But we do see patterns emerging, repetitions. We can abstract out the common recurring patterns as another function which is the ninth commandment.
  #+begin_src scheme
    ((lambda (f)
       (lambda (l)
	 (cond
	   ((null? l) 0)
	   (else (add1 (f (cdr l)))))))
     ((lambda (g)
	(lambda (l)
	  (cond
	    ((null? l) 0)
	    (else (add1 (g (cdr l)))))))
      eternity))


		  #<procedure:...chemer-workbook.rkt:906:0>
		  #<procedure:...chemer-workbook.rkt:912:3>
		  #<procedure:...chemer-workbook.rkt:919:3>
		  > (((lambda (f)
		     (lambda (l)
		       (cond
			 ((null? l) 0)
			 (else (add1 (f (cdr l)))))))
		   ((lambda (g)
		      (lambda (l)
			(cond
			  ((null? l) 0)
			  (else (add1 (g (cdr l)))))))
		    eternity)) '())
		  0
		  > (((lambda (f)
		     (lambda (l)
		       (cond
			 ((null? l) 0)
			 (else (add1 (f (cdr l)))))))
		   ((lambda (g)
		      (lambda (l)
			(cond
			  ((null? l) 0)
			  (else (add1 (g (cdr l)))))))
		    eternity)) '(a))
		  1
		  > (((lambda (f)
		     (lambda (l)
		       (cond
			 ((null? l) 0)
			 (else (add1 (f (cdr l)))))))
		   ((lambda (g)
		      (lambda (l)
			(cond
			  ((null? l) 0)
			  (else (add1 (g (cdr l)))))))
		    eternity)) '(a b))
		  . . user break

  #+end_src

+ For ~length-2~ the change is below.
  #+begin_src scheme
	((lambda (length)
	   (lambda (l)
	     (cond
	       ((null? l) 0)
	       (else (add1 (length (cdr l)))))))
	 ((lambda (length)
	    (lambda (l)
	      (cond
		((null? l) 0)
		(else (add1 (length (cdr l)))))))
	  ((lambda (length)
	     (lambda (l)
	       (cond
		 ((null? l) 0)
		 (else (add1 (length (cdr l)))))))
	   eternity)))
    
    > (((lambda (length)
       (lambda (l)
	 (cond
	   ((null? l) 0)
	   (else (add1 (length (cdr l)))))))
     ((lambda (length)
	(lambda (l)
	  (cond
	    ((null? l) 0)
	    (else (add1 (length (cdr l)))))))
      ((lambda (length)
	 (lambda (l)
	   (cond
	     ((null? l) 0)
	     (else (add1 (length (cdr l)))))))
       eternity))) '(a b))
    2

  #+end_src
+ We still have repetitions in our functions above. We can still abstract away and make functions.
+ The authors guide us to rename the function which takes ~length~ as an argument and returns a function that looks like length.
+ Now comes a syntactic trick. Assume that the function to generate or get length is called ~F~:
  #+begin_src scheme
    (lambda (length)
       (lambda (l)
	 (cond
	   ((null? l) 0)
	   (else (add1 (length (cdr l)))))))

  #+end_src
+ We have to pass ~eternity~ to it. So we have to something like ~F eternity~. This is the structure. An outer ~lambda~ can take this ~F~ and apply that ~F~ to eternity. Let
  us build a basic length of empty list as an example.
  #+begin_src scheme
    ((lambda (mk-length)
       (mk-length eternity))
     (lambda (length)
       (lambda (l)
	 (cond
	   ((null? l) 0)
	   (else (add1 (length (cdr l))))))))

  #+end_src
  What we have done is have ~((lambda (F) (F eternity)).....F)~. The outer ~lambda~ returns ~F eternity~ just like before! Why are we doing this? So that we can nest it.
+ Now if we want to go for ~length-1~ or ~length-2~ we just need to make the outer ~lambda~ pass more ~mk-length~. For instance:
  #+begin_src scheme
    ((lambda (mk-length)
       (mk-length
	(mk-length
	 (mk-length
	  (mk-length
	   (mk-length eternity))))))
     (lambda (length)
       (lambda (l)
	 (cond
	   ((null? l) 0)
	   (else (add1 (length (cdr l))))))))

  #+end_src
+ The next manipulation which the book does is to get a structure of this form.
  #+begin_src scheme
    ((lambda (mk-length)
       (mk-length mk-length))
     (lambda (mk-length)
       (lambda (l)
	 (cond
	   ((null? l) 0)
	   (else (add1
		  ((mk-length eternity) (cdr l))))))))

  #+end_src
  The outer ~lambda~ is there and an inner ~lambda~. After applying the inner ~lambda~ to the outer one we essentially get inner being applied to inner. For testing ~'()~ we see that
  it hits ~null?~ and actually does not go into recurrence.
+ Also note that parameter name in the function does not matter.
+ The example for ~(apples)~ yields 1. This is something on the lines of ~(F (F '(apples)))~ where ~F~ is a combination of the outer ~lambda~ and inner one.
+ We can keep passing ~mk-length~ to itself.
  #+begin_src scheme
    ((lambda (mk-length)
       (mk-length mk-length))
     (lambda (mk-length)
       (lambda (l)
	 (cond
	   ((null? l) 0)
	   (else (add1
		  ((mk-length mk-length) (cdr l))))))))

  #+end_src
+ We extract ~mk-length~ call to itself but we get an infinite recursion actually.
  #+begin_src scheme
	((lambda (mk-length)
	   (mk-length mk-length))
	 (lambda (mk-length)
	   ((lambda (length)
	      (lambda (l)
		(cond
		  ((null? l) 0)
		  (else (add1 (length (cdr l)))))))
	    (mk-length mk-length))))
    
    #<procedure:...chemer-workbook.rkt:1027:3>
    . Interactions disabled; out of memory

  #+end_src
  The book shows that with next set of recursions as examples.
+ Actually ~mk-length~ now is not returning a function anymore (it is a list).
+ The book now manipulates it into another lambda function.
  #+begin_src scheme
    ((lambda (mk-length)
       (mk-length mk-length))
     (lambda (mk-length)
       (lambda (l)
	 (cond
	   ((null? l) 0)
	   (else (add1
		  ((lambda (x)
		     ((mk-length mk-length) x))
		   (cdr l))))))))


    ((lambda (mk-length)
       (mk-length mk-length))
     (lambda (mk-length)
       ((lambda (length)
	  (lambda (l)
	    (cond
	      ((null? l) 0)
	      (else (add1 (length (cdr l)))))))
	(lambda (x)
	  ((mk-length mk-length) x)))))


  #+end_src
+ The next modification is to move the ~(lambda (length))~ out. Before we did the opposite by replacing a name with its value, now we extract the value and give it a name.
  We actually get the Y combinator now but the book will separate out the ~length~ function later.
  #+begin_src scheme
    ((lambda (le)
       ((lambda (mk-length)
	  (mk-length mk-length))
	(lambda (mk-length)
	  (le (lambda (x)
		((mk-length mk-length) x))))))
     (lambda (length)
       (lambda (l)
	 (cond
	   ((null? l) 0)
	   (else (add1 (length (cdr l))))))))


  #+end_src
+ Extracting out the ~length~ function and giving it the official nomenclature.
  #+begin_src scheme
    (define Y
      (lambda (le)
	((lambda (f) (f f))
	 (lambda (f)
	   (le (lambda (x) ((f f) x)))))))

  #+end_src
+ ~(Y Y)~ will be infinite recursion. ~Y~ is called the Y Combinator, ~le~ is the little evaluator. This ~(Y Y)~ has no base case.
+ This is a very difficult chapter and the authors could have done a much better job in teaching this. Trying to be clever does not lead to clarity in this chapter at all.
  The above were my raw notes, I am going to put diagrams and more simplification in terms of visuals to clarify this. The intent of the chapter should be clear after reading these notes
  but if one were to derive the Y Combinator by themselves it will be a tough task.


*Core Terms/Concepts Learnt*
+ Partial Functions
+ Total Functions
+ Combinators
+ Turing Halting Problem
+ Fixed Point Combinators 
+ Collectors or Continuations
+ Y Combinator



#+LATEX: \newpage

