schemer-notes.tex

\subsubsection{The Y Combinator Derivation}
\label{sec:org1237bee}

\begin{itemize}
\item Back to the first \texttt{lambda} expression. Here it is.
\begin{verbatim}
    (lambda (l)
      (cond
        ((null? l) 0)
        (else (add1 (eternity (cdr l))))))

#<procedure:...chemer-workbook.rkt:907:0>

\end{verbatim}
\item If we call this for an empty list all is good we get \texttt{0} as return. But when we call it for any other list the \texttt{eternity} call will go on for eternity! It keeps calling it itself with \texttt{'()}.
\begin{verbatim}
#<procedure:...chemer-workbook.rkt:906:0>
#<procedure:...chemer-workbook.rkt:912:3>
> ((lambda (l)
  (cond
    ((null? l) 0)
    (else (add1 (eternity (cdr l)))))) '())
0
> ((lambda (l)
  (cond
    ((null? l) 0)
    (else (add1 (eternity (cdr l)))))) '(a))
. . user break

\end{verbatim}

\item We can call the \texttt{eternity} as \texttt{length-0} because it returns \texttt{0} for an empty list. Thus we can rewrite it as below. 
\begin{verbatim}
(lambda (l)
  (cond
    ((null? l) 0)
    (else (add1 (length-0 (cdr l))))))

\end{verbatim}
\item Now for \texttt{length-1} up to one we can nest the two lambdas. Since we cannot use \texttt{define} to put in the function we place the \texttt{lambda} object itself. In fact we can keep adding for measuring
length of longer lists.
\begin{verbatim}
(lambda (l)
  (cond
    ((null? l) 0)
    (else
     (add1
      ((lambda (l)
         (cond
           ((null? l) 0)
           (else (add1
                  (eternity (cdr l))))))
      (cdr l))))))


\end{verbatim}
The same nesting can be done for \texttt{length-2} showing an application on a 2 element list below.
\begin{verbatim}
> ((lambda (l)
  (cond
    ((null? l) 0)
    (else
     (add1
      ((lambda (l)
         (cond
           ((null? l) 0)
           (else (add1
                  ((lambda (l)
                     (cond
                       ((null? l) 0)
                       (else
                        (add1
                         (eternity
                          (cdr l))))))
                   (cdr l))))))
       (cdr l)))))) '(a b))
2

\end{verbatim}

\item For \texttt{length-2} we can add more nesting (as above). I would not pass the function for multiple examples. One thing to note is that the scope of the parameters is local and we see the term \texttt{length} being used across. I think
this is done deliberately by the authors to drive this point home.
\item The playful but insightful question to ask is `What is recursion?' now.
\item If we could go on and on and keep nesting \texttt{lambdas} up to infinity with \texttt{length-infinity} being the last one perhaps then we would have derived the function for \texttt{length}. But it is not possible
to write an infinite function. But we do see patterns emerging, repetitions. We can abstract out the common recurring patterns as another function which is the ninth commandment.
\begin{verbatim}
((lambda (f)
   (lambda (l)
     (cond
       ((null? l) 0)
       (else (add1 (f (cdr l)))))))
 ((lambda (g)
    (lambda (l)
      (cond
        ((null? l) 0)
        (else (add1 (g (cdr l)))))))
  eternity))


              #<procedure:...chemer-workbook.rkt:906:0>
              #<procedure:...chemer-workbook.rkt:912:3>
              #<procedure:...chemer-workbook.rkt:919:3>
              > (((lambda (f)
                 (lambda (l)
                   (cond
                     ((null? l) 0)
                     (else (add1 (f (cdr l)))))))
               ((lambda (g)
                  (lambda (l)
                    (cond
                      ((null? l) 0)
                      (else (add1 (g (cdr l)))))))
                eternity)) '())
              0
              > (((lambda (f)
                 (lambda (l)
                   (cond
                     ((null? l) 0)
                     (else (add1 (f (cdr l)))))))
               ((lambda (g)
                  (lambda (l)
                    (cond
                      ((null? l) 0)
                      (else (add1 (g (cdr l)))))))
                eternity)) '(a))
              1
              > (((lambda (f)
                 (lambda (l)
                   (cond
                     ((null? l) 0)
                     (else (add1 (f (cdr l)))))))
               ((lambda (g)
                  (lambda (l)
                    (cond
                      ((null? l) 0)
                      (else (add1 (g (cdr l)))))))
                eternity)) '(a b))
              . . user break

\end{verbatim}

\item For \texttt{length-2} the change is below.
\begin{verbatim}
    ((lambda (length)
       (lambda (l)
         (cond
           ((null? l) 0)
           (else (add1 (length (cdr l)))))))
     ((lambda (length)
        (lambda (l)
          (cond
            ((null? l) 0)
            (else (add1 (length (cdr l)))))))
      ((lambda (length)
         (lambda (l)
           (cond
             ((null? l) 0)
             (else (add1 (length (cdr l)))))))
       eternity)))

> (((lambda (length)
   (lambda (l)
     (cond
       ((null? l) 0)
       (else (add1 (length (cdr l)))))))
 ((lambda (length)
    (lambda (l)
      (cond
        ((null? l) 0)
        (else (add1 (length (cdr l)))))))
  ((lambda (length)
     (lambda (l)
       (cond
         ((null? l) 0)
         (else (add1 (length (cdr l)))))))
   eternity))) '(a b))
2

\end{verbatim}
\item We still have repetitions in our functions above. We can still abstract away and make functions.
\item The authors guide us to rename the function which takes \texttt{length} as an argument and returns a function that looks like length.
\item Now comes a syntactic trick. Assume that the function to generate or get length is called \texttt{F}:
\begin{verbatim}
(lambda (length)
   (lambda (l)
     (cond
       ((null? l) 0)
       (else (add1 (length (cdr l)))))))

\end{verbatim}
\item We have to pass \texttt{eternity} to it. So we have to something like \texttt{F eternity}. This is the structure. An outer \texttt{lambda} can take this \texttt{F} and apply that \texttt{F} to eternity. Let
us build a basic length of empty list as an example.
\begin{verbatim}
((lambda (mk-length)
   (mk-length eternity))
 (lambda (length)
   (lambda (l)
     (cond
       ((null? l) 0)
       (else (add1 (length (cdr l))))))))

\end{verbatim}
What we have done is have \texttt{((lambda (F) (F eternity)).....F)}. The outer \texttt{lambda} returns \texttt{F eternity} just like before! Why are we doing this? So that we can nest it.
\item Now if we want to go for \texttt{length-1} or \texttt{length-2} we just need to make the outer \texttt{lambda} pass more \texttt{mk-length}. For instance:
\begin{verbatim}
((lambda (mk-length)
   (mk-length
    (mk-length
     (mk-length
      (mk-length
       (mk-length eternity))))))
 (lambda (length)
   (lambda (l)
     (cond
       ((null? l) 0)
       (else (add1 (length (cdr l))))))))

\end{verbatim}
\item The next manipulation which the book does is to get a structure of this form.
\begin{verbatim}
((lambda (mk-length)
   (mk-length mk-length))
 (lambda (mk-length)
   (lambda (l)
     (cond
       ((null? l) 0)
       (else (add1
              ((mk-length eternity) (cdr l))))))))

\end{verbatim}
The outer \texttt{lambda} is there and an inner \texttt{lambda}. After applying the inner \texttt{lambda} to the outer one we essentially get inner being applied to inner. For testing \texttt{'()} we see that
it hits \texttt{null?} and actually does not go into recurrence.
\item Also note that parameter name in the function does not matter.
\item The example for \texttt{(apples)} yields 1. This is something on the lines of \texttt{(F (F '(apples)))} where \texttt{F} is a combination of the outer \texttt{lambda} and inner one.
\item We can keep passing \texttt{mk-length} to itself.
\begin{verbatim}
((lambda (mk-length)
   (mk-length mk-length))
 (lambda (mk-length)
   (lambda (l)
     (cond
       ((null? l) 0)
       (else (add1
              ((mk-length mk-length) (cdr l))))))))

\end{verbatim}
\item We extract \texttt{mk-length} call to itself but we get an infinite recursion actually.
\begin{verbatim}
    ((lambda (mk-length)
       (mk-length mk-length))
     (lambda (mk-length)
       ((lambda (length)
          (lambda (l)
            (cond
              ((null? l) 0)
              (else (add1 (length (cdr l)))))))
        (mk-length mk-length))))

#<procedure:...chemer-workbook.rkt:1027:3>
. Interactions disabled; out of memory

\end{verbatim}
The book shows that with next set of recursions as examples.
\item Actually \texttt{mk-length} now is not returning a function anymore (it is a list).
\item The book now manipulates it into another lambda function.
\begin{verbatim}
((lambda (mk-length)
   (mk-length mk-length))
 (lambda (mk-length)
   (lambda (l)
     (cond
       ((null? l) 0)
       (else (add1
              ((lambda (x)
                 ((mk-length mk-length) x))
               (cdr l))))))))


((lambda (mk-length)
   (mk-length mk-length))
 (lambda (mk-length)
   ((lambda (length)
      (lambda (l)
        (cond
          ((null? l) 0)
          (else (add1 (length (cdr l)))))))
    (lambda (x)
      ((mk-length mk-length) x)))))


\end{verbatim}
\item The next modification is to move the \texttt{(lambda (length))} out. Before we did the opposite by replacing a name with its value, now we extract the value and give it a name.
We actually get the Y combinator now but the book will separate out the \texttt{length} function later.
\begin{verbatim}
((lambda (le)
   ((lambda (mk-length)
      (mk-length mk-length))
    (lambda (mk-length)
      (le (lambda (x)
            ((mk-length mk-length) x))))))
 (lambda (length)
   (lambda (l)
     (cond
       ((null? l) 0)
       (else (add1 (length (cdr l))))))))


\end{verbatim}
\item Extracting out the \texttt{length} function and giving it the official nomenclature.
\begin{verbatim}
(define Y
  (lambda (le)
    ((lambda (f) (f f))
     (lambda (f)
       (le (lambda (x) ((f f) x)))))))

\end{verbatim}
\item \texttt{(Y Y)} will be infinite recursion. \texttt{Y} is called the Y Combinator, \texttt{le} is the little evaluator. This \texttt{(Y Y)} has no base case.
\item This is a very difficult chapter and the authors could have done a much better job in teaching this. Trying to be clever does not lead to clarity in this chapter at all.
The above were my raw notes, I am going to put diagrams and more simplification in terms of visuals to clarify this. The intent of the chapter should be clear after reading these notes
but if one were to derive the Y Combinator by themselves it will be a tough task.
\end{itemize}


\textbf{Core Terms/Concepts Learnt}
\begin{itemize}
\item Partial Functions
\item Total Functions
\item Combinators
\item Turing Halting Problem
\item Fixed Point Combinators
\item Collectors or Continuations
\item Y Combinator
\end{itemize}



\newpage
