schemer-notes.org
* What Is the Value of All of This?

Climax of the book which leads to getting ready to build an interpreter.

#+LATEX: \bigskip

Key Takeaway:

/Use all previous ideas to sketch an interpreter: environments, lookup, closures, and application.
Shows that evaluation itself is just another recursive function built from structural principles./


#+LATEX: \vspace{1em}

** Entries and Lookups

+ An entry is defined as a pair of lists whose first list is a set and both the lists in the entry have equal length.
+ We seem to be defining a method to look for a particular element in the set get its position and then lookup in the second list the element in the same position.
+ Now we build a function to do exactly this by looking up the position of an input in the first set and then finding the element in the second list.
  #+begin_src scheme
    (define lookup-in-entry
      (lambda (name entry entry-f)
	(lookup-in-entry-help name
			      (first entry)
			      (second entry)
			      entry-f)))

    (define lookup-in-entry-help
      (lambda (name names values entry-f)
	(cond
	  ((null? names) (entry-f name))
	  ((eq? (car names) name)
	   (car values))
	  (else (lookup-in-entry-help name
				      (cdr names)
				      (cdr values)
				      entry-f)))))

  #+end_src

+ We have a helper function ~lookup-in-entry-help~. The book always uses fallback functions so the code stays `pure lambda' - no errors, no special forms, no exceptions.
+ This is how the interpreter will find values defined in nested scopes. We are building an interpreter in this chapter perhaps.
+ We will stack a new entry on top of the existing table via ~(define extend-table ...)~. 
+ So now we have a list of entries inside a table. We can look for specific values and if the value is appearing multiple times the evaluation order makes sure to return the first instance
  only.
+ The ~lookup-in-table~ function is written which is fairly simple. The note here is how the ~cdr~ portion of the table is being recursed into. The bottom ~lambda~ function does that.
  #+begin_src scheme
    (define lookup-in-table
      (lambda (name table table-f)
	(cond
	  ((null? table) (table-f name))
	  (else (lookup-in-entry name (car table)
				 (lambda (name)
				   (lookup-in-table name
						    (cdr table)
						    table-f)))))))

  #+end_src
+ Reiterating that ~value~ is the function that returns the natural value of expressions.
  #+begin_src scheme
    > (car (quote (a b c)))
    'a

  #+end_src
+ Then we ~cons~ in a nested fashion. Fairly straightforward.
  #+begin_src scheme
	(cons rep-a
	      (cons rep-b
		    (cons rep-c (quote ()))))
    
    > (cons 'a
	  (cons 'b
		(cons 'c (quote ()))))
    '(a b c)

  #+end_src
+ The book is driving us to something similar we see in macros of Common Lisp. We are quoting ~car~ and ~quote~ and then that is getting used to build a Lisp object which can further be evaluated.
  #+begin_src scheme
	(cons rep-car
	      (cons (cons rep-quote
			  (cons
			   (cons rep-a
				 (cons rep-b
				       (cons rep-c
					     (quote ()))))
			   (quote ())))
	      (quote ())))

    > (cons 'car
	  (cons (cons 'quote
		      (cons
		       (cons 'a
			     (cons 'b
				   (cons 'c
					 (quote ()))))
		       (quote ())))
	  (quote ())))
    '(car '(a b c))
    
  #+end_src

** Values  
  
+ Next is a series of expressions we can test out in the REPL of Dr Racket.
  #+begin_src scheme
    > (car (quote (a b c)))
    'a

    > (car (quote (a b c)))
    'a

    > (quote (car (quote (a b c))))
    '(car '(a b c))

    > (value (add1 6))
    7

    > (value 6)
    6
    
    > (value (quote nothing))
    'nothing

  #+end_src
+ Although the ~value~ function which we defined this chapter assumes that it can take arguments of other types. So readers should be careful here, they will get an error. The book should have been more explicit.
  #+begin_src scheme
    (value '((lambda (nothing)
       (cons nothing (quote ())))
     (quote
      (from nothing comes something))))

    > ((from nothing comes something))
  #+end_src
+ Similarly the next expression also is simple. It gives ~something~.
  #+begin_src scheme
    ((lambda (nothing)
       (cond
	 (nothing (quote something))
	 (else (quote nothing))))
       #t)
  #+end_src

