schemer-notes.org
** Types, Value, and Meaning

+ The next set of questions just wants us to know what types are and how they are being defined in the current context. Listing them below. For folks from C language do not get confused here! Also this type system is specific to
  the book and has little or nothing to do with Scheme or Dr Racket. Again the book in this chapter is cryptic and for new comers tough to decipher.
  - Number (for example 42, 007) is a ~*const~
  - Boolean ~#t~ or ~#f~ is a ~*const~
  - Atoms are ~*const~
  - ~(value car)~ gives the primitive but `car' will be treated as an atom and give a ~*const~
  - ~(quote nothing)~ gives the type in this case as ~*quote~
  - An atom that is not a primitive is treated as a variable thus is given the type ~*identifier~
  - A function made using ~lambda~ is simply given a ~*lambda~ type
  - When a ~lambda~ expression is called it is given the type ~*application~
  - The conditional ~cond~ is given ~*cond~ type
  So if we notice we have 6 types in this chapter built for us.
+ Now the authors say that for a particular type an appropriate action has to be taken for us to get its value.
+ Now we aim to write the function ~value~ and this is actually the interpreter. A very rudimentary one.
+ I will work backwards unlike the book. ~value~ takes and argument and finds its ~meaning~ in a table. When it is found it looks for the action to take. A conditional decides whether we need to check if its an atom and then
  do a ~atom-to-action~ and if it is anything else then we check in the function ~list-to-action~ for the application type. The functions are written below.
  #+begin_src scheme
    (define expression-to-action
      (lambda (e)
	(cond
	  ((atom? e) (atom-to-action e))
	  (else (list-to-action e)))))

    (define atom-to-action
      (lambda (e)
	(cond
	  ((number? e) *const)
	  ((eq? #t) *const)
	  ((eq? #f) *const)
	  ((eq? e (quote cons)) *const)
	  ((eq? e (quote car)) *const)
	  ((eq? e (quote cdr)) *const)
	  ((eq? e (quote null?)) *const)
	  ((eq? e (quote eq?)) *const)
	  ((eq? e (quote atom?)) *const)
	  ((eq? e (quote zero?)) *const)
	  ((eq? e (quote add1)) *const)
	  ((eq? e (quote sub1)) *const)
	  ((eq? e (quote number?)) *const)
	  (else *identifier))))

    (define list-to-action
      (lambda (e)
	(cond
	  ((atom? (car e))
	   (cond
	     ((eq? (car e) (quote quote)) *quote)
	     ((eq? (car e) (quote lambda)) *lambda)
	     ((eq? (car e) (quote cond)) *cond)
	     (else *application)))
	  (else *application))))
         
    (define value
      (lambda (e)
	(meaning e (quote ()))))

    (define meaning
      (lambda (e table)
	((expression-to-action e) e table)))

  #+end_src
+ A point to call out is that by the end of this chapter we truly would not have a full fledged interpreter but rather a working knowledge of the ingredients required to make one.
+ Some of the types get defined for the interpreter.
  #+begin_src scheme
    (define *const
      (lambda (e table)
	(cond
	  ((number? e) e)
	  ((eq? e #t) #t)
	  ((eq? e #f) #f)
	  (else (build (quote primitive) e)))))

    (define *quote
      (lambda (e table)
	(text-of e)))

    (define *identifier
      (lambda (e table)
	(lookup-in-table e table initial-value)))

    (define initial-table
      (lambda (name)
	(car (qote ()))))

    (define *lambda
      (lambda (e table)
	(build (quote non-primitive)
	       (cons table (cdr e)))))


  #+end_src
+ Finally we see the explanation of what ~cond~ is. It is a series of tests with fall through as I noted it before. In Common Lisp we put a ~t~ and in Scheme we use ~else~.
  #+begin_src scheme
    (define evcon
      (lambda (lines table)
	(cond
	  ((else? (question-of (car lines)))
	   (meaning (answer-of (car lines)) table))
	  ((meaning (question-of (car lins)) table)
	   (meaning (answer-of (car lines)) table))
	  (else (evcon (cdr lines) table)))))

    (define else?
      (lambda (x)
	(cond ((atom? x) (eq? x  (quote else)))
	      (else #f))))


  #+end_src
  Helper functions are also defined ~question-of first~ and ~answer-of second~. In this definition every line of the ~cond~ should be true.
+ The book asks us to start having helper functions in place ~table-of first~, ~formals-of second~, and ~body-of third~.
+ Finally
  #+begin_src scheme
    (define *cond
      (lambda (e table)
	(evcon (cond-lines-of e) table)))

  #+end_src
  With a helper of ~cond-lines-of cdr~.

