schemer-notes.org
** Evaluation and Application

+ The working example is good to follow through. Here ~coffee~ evaluates to ~#t~ and then ~klatsch~ gives 5 as the final answer.
+ An application is a list whose ~car~ is a function.
+ An application has to determine the meaning of all its arguments but that is not the case with special forms such as ~cond~ or logic ones such as ~and~ and ~or~. This is
  very important.
+ Now we evaluate a list via a function ~evlis~ which evaluates every argument. And then that is applied (we use helper functions again ~function-of car~ and ~arguments-of cdr~).
  #+begin_src scheme
    (define evlis
      (lambda (args table)
	(cond
	  ((null? args) (quote ()))
	  (else (cons (meaning (car args) table)
		      (evlis (cdr args) table))))))
    (define *application
      (lambda (e table)
	(apply
	 (meaning (function-of e) table)
	 (evlis (arguments-of e) table))))

  #+end_src
+ There are 2 types of functions - primitives and non primitives.
  - A primitive is shown as ~(primitive primitive-name)~
  - A non-primitive is shown as ~(non-primitive (table formals body))~. ~(table formals body)~ is called a closure record.
  #+begin_src scheme
    (define primitive?
      (lambda (l)
	(eq? (first l) (quote primitive))))

    (define non-primitive?
      (lambda (l)
	(eq? (first l) (quote non-primitive))))

  #+end_src
+ Now we write the ~apply~ function
  #+begin_src scheme
    (define apply
      (lambda (fun vals)
	(cond
	  ((primitive? fun)
	   ((apply-primitive (second fun) vals))
	   ((non-primitive? fun)
	    (apply-closure (second fun) vals))))))

  #+end_src
+ The helper function ~apply-primitive~ and ~apply-closure~ are written as follows.
  #+begin_src scheme
    (define apply-primitive
      (lambda (name vals)
	(cond
	  ((eq? name (quote cons)) (cons (first vals) (second vals)))
	  ((eq? name (quote car)) (car (first vals)))
	  ((eq? name (quote cdr)) (cdr (first vals)))
	  ((eq? name (quote null?)) (null? (first vals)))
	  ((eq? name (quote eq?)) (eq? (first vals) (second vals)))
	  ((eq? name (quote atom?)) (:atom? (first vals)))
	  ((eq? name (quote zero?)) (zero? (first vals)))
	  ((eq? name (quote add1)) (add1 (first vals)))
	  ((eq? name (quote sub1)) (sub1 (first vals)))
	  ((eq? name (quote number?)) (number? (first vals))))))

    (define apply-closure
      (lambda (closure vals)
	(meaning (body-of closure)
		 (extend-table
		  (new-entry
		   (formals-of closure)
		   vals)
		  (table-of clsoure)))))

  #+end_src
+ The book says that applying a non-primitive function is the same as finding the meaning of the closure's body with its table extended by an entry of the ~(formals values)~.
+ In the final pages of the book the authors make us do some examples of the application of ~meaning~ on identifiers and constants.
+ We see the statement about applying a primitive function.
+ Then we see a statement about applying ~cons~ and which ~cond~ line we will hit. These last few examples seem like a starter for something major to come but would not be covered in this book.
+ Finally we come to ~define~ we skip it. We know that we truly do not needed because we have our Y Combinator.
+ The interpreter can run on the interpreter if we do the transformation with the Y combinator the book says.
+ Pretty sure The Seasoned Schemer will have much greater details in the book related to interpreters.
+ It is time for a banquet.


*Core Terms/Concepts Learnt*
+ Entry
+ Types definition
+ Evaluation, Apply
+ Interpreter

#+LATEX: \bigskip
#+LATEX: \vspace{10em}

#+LATEX: \begin{center}
#+LATEX: \bigskip
#+LATEX: \large { ~'(Bon Appétit)~}
#+LATEX: \end{center}


 
#+LATEX: \newpage

* Intermission

+ Books to read in my opinion from the list based on my personal knowledge
  - The Seasoned Schemer
  - Naive Set Theory
  - How to Solve It
  - Introduction to Logic
  - Structure and Interpretation of Computer Programs
  - Alice's Adventure in Wonderland

#+LATEX: \newpage

# --- End Page ---
#+LATEX: \thispagestyle{empty}
#+LATEX: \begin{center}
#+LATEX: \vspace*{0.3\textheight}
#+LATEX: \large {\emph{``Now get ready for the next show''}}
#+LATEX: \bigskip
#+LATEX: \vfill
#+LATEX: \end{center}
#+LATEX: \clearpage
# --- End Page ---

