schemer-notes.tex

\subsection{Evaluation and Application}
\label{sec:orgeb495f4}

\begin{itemize}
\item The working example is good to follow through. Here \texttt{coffee} evaluates to \texttt{\#t} and then \texttt{klatsch} gives 5 as the final answer.
\item An application is a list whose \texttt{car} is a function.
\item An application has to determine the meaning of all its arguments but that is not the case with special forms such as \texttt{cond} or logic ones such as \texttt{and} and \texttt{or}. This is
very important.
\item Now we evaluate a list via a function \texttt{evlis} which evaluates every argument. And then that is applied (we use helper functions again \texttt{function-of car} and \texttt{arguments-of cdr}).
\begin{verbatim}
(define evlis
  (lambda (args table)
    (cond
      ((null? args) (quote ()))
      (else (cons (meaning (car args) table)
                  (evlis (cdr args) table))))))
(define *application
  (lambda (e table)
    (apply
     (meaning (function-of e) table)
     (evlis (arguments-of e) table))))

\end{verbatim}
\item There are 2 types of functions - primitives and non primitives.
\begin{itemize}
\item A primitive is shown as \texttt{(primitive primitive-name)}
\item A non-primitive is shown as \texttt{(non-primitive (table formals body))}. \texttt{(table formals body)} is called a closure record.
\end{itemize}
\begin{verbatim}
(define primitive?
  (lambda (l)
    (eq? (first l) (quote primitive))))

(define non-primitive?
  (lambda (l)
    (eq? (first l) (quote non-primitive))))

\end{verbatim}
\item Now we write the \texttt{apply} function
\begin{verbatim}
(define apply
  (lambda (fun vals)
    (cond
      ((primitive? fun)
       ((apply-primitive (second fun) vals))
       ((non-primitive? fun)
        (apply-closure (second fun) vals))))))

\end{verbatim}
\item The helper function \texttt{apply-primitive} and \texttt{apply-closure} are written as follows.
\begin{verbatim}
(define apply-primitive
  (lambda (name vals)
    (cond
      ((eq? name (quote cons)) (cons (first vals) (second vals)))
      ((eq? name (quote car)) (car (first vals)))
      ((eq? name (quote cdr)) (cdr (first vals)))
      ((eq? name (quote null?)) (null? (first vals)))
      ((eq? name (quote eq?)) (eq? (first vals) (second vals)))
      ((eq? name (quote atom?)) (:atom? (first vals)))
      ((eq? name (quote zero?)) (zero? (first vals)))
      ((eq? name (quote add1)) (add1 (first vals)))
      ((eq? name (quote sub1)) (sub1 (first vals)))
      ((eq? name (quote number?)) (number? (first vals))))))

(define apply-closure
  (lambda (closure vals)
    (meaning (body-of closure)
             (extend-table
              (new-entry
               (formals-of closure)
               vals)
              (table-of clsoure)))))

\end{verbatim}
\item The book says that applying a non-primitive function is the same as finding the meaning of the closure's body with its table extended by an entry of the \texttt{(formals values)}.
\item In the final pages of the book the authors make us do some examples of the application of \texttt{meaning} on identifiers and constants.
\item We see the statement about applying a primitive function.
\item Then we see a statement about applying \texttt{cons} and which \texttt{cond} line we will hit. These last few examples seem like a starter for something major to come but would not be covered in this book.
\item Finally we come to \texttt{define} we skip it. We know that we truly do not needed because we have our Y Combinator.
\item The interpreter can run on the interpreter if we do the transformation with the Y combinator the book says.
\item Pretty sure The Seasoned Schemer will have much greater details in the book related to interpreters.
\item It is time for a banquet.
\end{itemize}


\textbf{Core Terms/Concepts Learnt}
\begin{itemize}
\item Entry
\item Types definition
\item Evaluation, Apply
\item Interpreter
\end{itemize}

\bigskip
\vspace{10em}

\begin{center}
\bigskip
\large { ~'(Bon Appétit)~}
\end{center}



\newpage

\section{Intermission}
\label{sec:orgaea1a9c}

\begin{itemize}
\item Books to read in my opinion from the list based on my personal knowledge
\begin{itemize}
\item The Seasoned Schemer
\item Naive Set Theory
\item How to Solve It
\item Introduction to Logic
\item Structure and Interpretation of Computer Programs
\item Alice's Adventure in Wonderland
\end{itemize}
\end{itemize}

\newpage

\thispagestyle{empty}
\begin{center}
\vspace*{0.3\textheight}
\large {\emph{``Now get ready for the next show''}}
\bigskip
\vfill
\end{center}
\clearpage
\end{document}
